{
  "acoustic_model": "assemblyai_default",
  "audio_duration": 6511,
  "audio_url": "https://cloud.inlupus.at/s/pyRCw7KbNZtnGip/download",
  "auto_chapters": false,
  "auto_highlights": false,
  "auto_highlights_result": {},
  "confidence": 0.9527798,
  "content_safety": false,
  "content_safety_labels": {
    "status": "unavailable"
  },
  "custom_topics": false,
  "disfluencies": false,
  "dual_channel": false,
  "entity_detection": true,
  "filter_profanity": false,
  "format_text": false,
  "iab_categories": true,
  "iab_categories_result": {},
  "id": "28e47657-53e8-460d-8373-184321b19648",
  "language_code": "de",
  "language_detection": false,
  "language_model": "assemblyai_default",
  "punctuate": true,
  "redact_pii": false,
  "redact_pii_audio": false,
  "sentiment_analysis": false,
  "speaker_labels": true,
  "speakers_expected": 4,
  "speed_boost": false,
  "status": "completed",
  "summarization": false,
  "throttled": false,
  "utterances": [
    {
      "end": 16279,
      "speaker": "A",
      "start": 8400,
      "text": "Willkommen zur Folge zwei hundert des Engineering Kiosk. Eine ganz besondere Jubiläumsausgabe, exklusiv gehostet von."
    },
    {
      "end": 23560,
      "speaker": "B",
      "start": 16279,
      "text": "Mir, Christian und Thomas vom Index out of Bounds Podcast und natürlich wie immer mit Andi Grunwald."
    },
    {
      "end": 46460,
      "speaker": "A",
      "start": 23560,
      "text": "Der Mann, der Meetups wie militärische Operationen plant, heimlich Go Code schreibt, aber nie darüber redet und seine fertige Flutter App in der Show Schublade verstauben lässt. Wäre vermutlich längst aufstrebender CEO, hätte er nicht zu viel Angst vorm Freelancen. Ruhrpott Schnauze meets Engineering Excellence und inklusive der Organized Wahnsinn, aus dem Andi und."
    },
    {
      "end": 72440,
      "speaker": "B",
      "start": 46540,
      "text": "Wolfgang Gassler der entspannteste Mann der Alpen. Während andere einen Job haben, hat Wolfgang Consulting Firma, freiwillige Feuerwehr, Berghütte und mindestens drei Start ups. Man wow, so organisiert. Aber nein, das ist einfach österreichische Gelassenheit, die Chaosresistenz macht zwischen Datenbankphilosophie und Menschenrettung. Die wichtige kann er eigentlich noch coden? Pure Austrian Engineering."
    },
    {
      "end": 78600,
      "speaker": "A",
      "start": 72520,
      "text": "Wolfgang schnallt euch an, es wird nerdig, persönlich und ein kleines bisschen chaotisch."
    },
    {
      "end": 82120,
      "speaker": "B",
      "start": 78760,
      "text": "Hier ist Engineering Kiosk, Folge zwei hundert."
    },
    {
      "end": 88520,
      "speaker": "C",
      "start": 87160,
      "text": "Ganz großes Tennis."
    },
    {
      "end": 90520,
      "speaker": "D",
      "start": 89240,
      "text": "Wo ist dieses Publikum?"
    },
    {
      "end": 98240,
      "speaker": "A",
      "start": 91360,
      "text": "Ich hatte vor allem noch so einen Track gefunden mit so sarkastischen klatschen, aber das hat leider nicht so gut funktioniert wie gewünscht."
    },
    {
      "end": 100400,
      "speaker": "D",
      "start": 98240,
      "text": "Das macht der C Andi gerade, das passt schon."
    },
    {
      "end": 110200,
      "speaker": "C",
      "start": 100560,
      "text": "Meine erste Frage ist habt ihr alle Podcast Folgen durchgehört und euch immer so nebenbei Notizen gemacht? Oder habt ihr einmal alle Transkripte runtergeladen und Perplexity gefragt? Hol mir mal Funfacts raus."
    },
    {
      "end": 114120,
      "speaker": "D",
      "start": 110200,
      "text": "Andi, du bist heute nicht der, der Fragen stellt. Das hast du falsch verstanden."
    },
    {
      "end": 115400,
      "speaker": "B",
      "start": 114120,
      "text": "Eigentlich sind wir die Hosts."
    },
    {
      "end": 117600,
      "speaker": "D",
      "start": 115400,
      "text": "Gebt es mal ab. Christian, willst du es auflösen?"
    },
    {
      "end": 141640,
      "speaker": "B",
      "start": 117600,
      "text": "Genau, tatsächlich, die Sachen, die wir da jetzt gehört haben, da haben wir uns zusammengesetzt, Thomas und ich, und haben einfach alles mal runtergeschrieben, was wir über euch wissen. Und dann haben wir die KI gefragt, ob sie daraus einen Text generieren kann. Aber die Information, die haben wir tatsächlich nicht aus den Transkripten gezogen. Aber gehören euch auch regelmäßig, deswegen wissen wir natürlich auch viel über den."
    },
    {
      "end": 163840,
      "speaker": "C",
      "start": 141800,
      "text": "Das ist natürlich schon stark, weil wir kennen uns ja vor der ganzen Podcasterei nicht. Das bedeutet, wir haben uns durchs Podcasten ja kennengelernt. Ich hab einmal den Thomas auf einen Kaffee oder auf ein Bier oder was in Duisburg getroffen, als er auf einer Konferenz war, aber wir kennen uns persönlich eigentlich gar nicht und das finde ich dann schon ein bisschen faszinierend, vielleicht auch ein bisschen gruselig, aber nun gut."
    },
    {
      "end": 167520,
      "speaker": "A",
      "start": 165360,
      "text": "Naja, bleiben wir mal bei faszinieren."
    },
    {
      "end": 179980,
      "speaker": "B",
      "start": 168320,
      "text": "Was ich interessant finde tatsächlich, also Thomas hat mir das erzählt mit dieser Flutter App von dir, Andi. Das war nämlich, ist er tatsächlich ein Insiderwissen? Ich glaube, das hast du noch nie irgendwann mal erzählt, dass du tatsächlich, also erstmal stimmt es überhaupt?"
    },
    {
      "end": 187220,
      "speaker": "A",
      "start": 180540,
      "text": "Das war zumindest das, was du mir erzählt hattest, als wir uns eben an dem besagten da, als ich auf dieser Konferenz war, getroffen hatten."
    },
    {
      "end": 193459,
      "speaker": "C",
      "start": 187220,
      "text": "Ja, die war auch im App Store, ist inzwischen nicht mehr im App Store, weil die auf den aktuellen iOS Versionen nicht mehr lief. Aber ja, ich hatte eine fertige Flutter."
    },
    {
      "end": 197260,
      "speaker": "D",
      "start": 193459,
      "text": "App und zwar zur, Moment, fertig, definiere fertig."
    },
    {
      "end": 215250,
      "speaker": "C",
      "start": 197260,
      "text": "Die hat das getan, was ich als MVP definiert habe, aber das war eine Workout Generator App. Also die hatte Crossfit und Functional Fitness Workouts und du hast ihr, da kannst du sagen, okay, ich hatte dieses Equipment, so eine kettlebell und dann Springseil und Rudergerät und dann hat er dir Workouts definiert anhand von deinen Kriterien, so Dauer und Co."
    },
    {
      "end": 233050,
      "speaker": "D",
      "start": 215330,
      "text": "Und die, also es waren so drei Dropdowns, glaube ich, die man auswählen können. Dann ist so eine Info gekommen, also das, was ungefähr heute in einer Sekunde herbringen würde. Und der Andi hat, glaube ich, ungefähr acht und zwanzig Stunden einen Hardcore Kurs gemacht, damit er diese drei Dropdowns da."
    },
    {
      "end": 234570,
      "speaker": "A",
      "start": 233050,
      "text": "Irgendwie, es war noch alles vor KI."
    },
    {
      "end": 238010,
      "speaker": "D",
      "start": 234570,
      "text": "Zeit, aber er hat dann flatter verstanden. Er hat dann wirklich, ja, ich gebe."
    },
    {
      "end": 256730,
      "speaker": "C",
      "start": 238010,
      "text": "Zu, ich habe einen Udemy Kurs von vorne bis hinten durchgeschaut, um zu wissen, ob ich ein Lerntyp für Video Tutorials bin. Die Antwort nach acht und zwanzig Stunden ist nein. Ich habe es geschrieben, habe es hochgeladen, habe es auch ein paar mal genutzt und habe irgendwann die Lust verloren, weil ich dann wusste, wie Flutter funktioniert. Also."
    },
    {
      "end": 322650,
      "speaker": "B",
      "start": 318970,
      "text": "Wolfgang, findest du dich wieder in der Beschreibung oder haben wir noch was vergessen gehabt?"
    },
    {
      "end": 333990,
      "speaker": "D",
      "start": 322650,
      "text": "Na, das trifft es ganz gut. Also wir haben ja gerade im Vorgespräch darüber gesprochen, über die ganzen side Projects. Also der Andi hat sich ja schon wieder beschwert, dass sie zu viele Projekte und zu viele side Projects habe. Also ja, trifft schon ganz gut."
    },
    {
      "end": 360730,
      "speaker": "B",
      "start": 334230,
      "text": "Das freut mich sehr. Wir haben auch noch eine andere Kleinigkeit vorbereitet und zwar tatsächlich das, zum Teil sind da die Inhalte von KI generiert, was ich sehr, sehr spannend finde. Ich schere hier mal kurz einen Link bei uns in die Gruppe. Ihr packt den sehr gerne in die Show Notes. Und zwar ist das ein Bingo mit häufigen Phrasen, die ihr verwendet in eurem Podcast und interessanterweise, also die Webseite selbst ist wipe gecodet, also innerhalb von fünfzehn Minuten entstanden. Das fand ich auch irgendwie cool."
    },
    {
      "end": 366850,
      "speaker": "A",
      "start": 360730,
      "text": "Nicht mal wahrscheinlich, das lief so nebenbei, während wir eigentlich die restliche Folge geplant haben, hat der Kodex das irgendwie umgesetzt."
    },
    {
      "end": 410550,
      "speaker": "B",
      "start": 367330,
      "text": "Genau, und wir haben hier einfach quasi so gängige Phrasen von euch mal draufgepackt. Zum Beispiel Wolfgang sagt akademisch, Wolfgangs Doktor wird erwähnt, Andi neckt Wolfgang, geht natürlich auch in die andere Richtung. Wolfgang neckt Anni, Ruhrgebietsreferenz. Andi sagt Legacy verdient das Geld und noch ein paar andere können die Zuhörer innen sehr gerne mitspielen. Würde uns auch interessieren, wenn ihr es gemacht habt, ihr könnt das auch als PNG dann scheren im Discord von den Jungs könnt ihr mal sagen, habt ihr es geschafft ein Bingo zu bekommen? Wer weiß, ob wir in dieser Episode überhaupt über diese Sachen sprechen, die auf diesem Bingo zu finden sind. Aber wir dachten es mal ganz witzig, falls jemand aufmerksam zuhört und nicht nur irgendwie beim Autofahren nebenbei oder beim Arbeiten, dann kann er das ja gerne nebenbei noch aufmachen."
    },
    {
      "end": 414310,
      "speaker": "D",
      "start": 410550,
      "text": "Erstmal eine sinnvollere und die ist weitgecoded."
    },
    {
      "end": 417270,
      "speaker": "B",
      "start": 414630,
      "text": "Also zu ein hundert Prozent bugfrei. Wahrscheinlich."
    },
    {
      "end": 422150,
      "speaker": "A",
      "start": 419590,
      "text": "Kein MVP, sondern funktioniert produktiv."
    },
    {
      "end": 426150,
      "speaker": "B",
      "start": 422310,
      "text": "Ihr könnt ja auch sehr gerne nebenbei aufmachen, Andi und Wolfgang. Ich weiß nicht, ob es euch zu sehr ablenkt."
    },
    {
      "end": 427950,
      "speaker": "C",
      "start": 426230,
      "text": "Ne, ich habe es auf. Sehr, sehr gut."
    },
    {
      "end": 454250,
      "speaker": "A",
      "start": 427950,
      "text": "Ja und das krasse ist vor allem, wir haben da ja irgendwie dann noch gesagt, dass der irgendwie so ein URL Sharing einbauen soll, wo er den Seed irgendwie sowas festschreibt und so. Das heißt also theoretisch könnt ihr auch ein Bingo erstellen, wo dann die Begriffe feststehen. Also es sind insgesamt neun Felder, es wird dann einfach glaube ich, nur noch der Seed geändert, aber die Texte in den Feldern bleiben letztendlich gleich, nur die Anordnung verändert sich je nach Person, die den Link das erstmal aufruft, oder?"
    },
    {
      "end": 455650,
      "speaker": "B",
      "start": 454250,
      "text": "So war es, genau, richtig."
    },
    {
      "end": 458970,
      "speaker": "C",
      "start": 456610,
      "text": "Habt ihr den Source Code veröffentlicht irgendwo auf der Webseite?"
    },
    {
      "end": 460210,
      "speaker": "B",
      "start": 458970,
      "text": "Es ist eine HTML Seite."
    },
    {
      "end": 465570,
      "speaker": "C",
      "start": 463570,
      "text": "Ich habe gedacht, da ist so ein Backend hinter allem."
    },
    {
      "end": 528000,
      "speaker": "B",
      "start": 466830,
      "text": "Alles klar. Thomas hat noch so gemeint, hey, lass uns das doch so machen. Der erste, der ein Bingo hat, der kriegt dann auch noch was zu gewinnen. Wir haben vor allem angefangen, als ihr uns gefragt habt, ob wir diese Folge hosten wollen für euch, haben wir ja noch so gesagt, wir haben wenig Zeit und so. Und dann kamen so diese Anforderungen rein, so von wegen, ja, lass uns da ein backend schreiben. Naja, so weit ist es dann ja nicht gekommen, aber es ist eine kleine Spielerei genau, lass uns doch mal gerne damit rein starten, worum es heute hier so ein bisschen gehen soll. Ihr habt es ja in der Vorstellung schon gehört, wir wollen euch so ein bisschen persönlicher kennenlernen, natürlich alles im IT Bereich, aber gerne auch, was ihr sonst so neben der IT irgendwie macht. Und wir haben auch so ein paar Fragen mitgebracht, wo uns natürlich auch interessieren würde, wie würden denn die Zuhörenden die beantworten? Sind ja nicht nur irgendwie spezifisch auf euch zugeschnittene, sondern auch Mindset Fragen und so weiter und so fort. Und ich würde jetzt einfach sagen, lass uns mal gleich mit der ersten Frage rein starten, die beim Wolfgang ja schon im Intro drin war. Und Wolfgang, wie viel programmierst du eigentlich überhaupt noch?"
    },
    {
      "end": 529920,
      "speaker": "D",
      "start": 528000,
      "text": "Willst du jetzt eine Prozentanzahl hören?"
    },
    {
      "end": 531120,
      "speaker": "B",
      "start": 530720,
      "text": "Ja."
    },
    {
      "end": 534280,
      "speaker": "A",
      "start": 532960,
      "text": "Eine exakte."
    },
    {
      "end": 567000,
      "speaker": "D",
      "start": 534280,
      "text": "Ja, ich programmiere schon noch bei allen meinen side Projects, also überall, wo der Code anfällt, programmiere das ist schon durchaus einiges. Open Podcast zum Beispiel, da programmiere ich noch relativ viel Typescript. Primär dann für Engineering Kiosk wollte ich programmieren in Typescript. Das hat mir der Andi weggenommen und macht jetzt Go. Insofern habe ich das delegiert. Also falls ihr Techniken für delegieren haben wollt, so geht es, man fangt mit JavaScript an und jemand wird dann ziemlich grantig und übernimmt es einfach und macht es in Go."
    },
    {
      "end": 571640,
      "speaker": "B",
      "start": 567000,
      "text": "Also Andi, bist du sauer geworden, weil du es warten musstest, oder ist es einfach eine generelle Abneigung gegen JavaScript?"
    },
    {
      "end": 574530,
      "speaker": "D",
      "start": 571640,
      "text": "Also du gesagt hast generelle Abneigung, aber."
    },
    {
      "end": 626750,
      "speaker": "C",
      "start": 574530,
      "text": "Bitte Andi, ich mag JavaScript schon wirklich nicht, weil ich denke mir, so einen Compiler zu haben, der dann TypeScript in JavaScript transpiliert und also das war ja eine Toolchain, ist ja unglaublich. Und dann habe ich mir gedacht, ach, weißt du was, ich programmiere in meiner Freizeit, das ganze Projekt wird in der Freizeit betrieben und da muss ich mich jetzt nicht kontinuierlich jeden Abend ärgern, indem ich diese Sprache a nicht verstehe und b die ganzen Any types daraus operieren muss, weil wir haben ja Typescript genutzt, aber überall wo ein Type war, war any. Dann habe ich Wolfgang gefragt, warum das so ist und dann kam da halt oft auch keine wirkliche Antwort, der mir das wirklich erklären konnte. Also das war das schon so ein bisschen krude. Und da habe ich jungs, ernsthaft, das kann doch jetzt nicht sein. Wir nehmen hier eine typensichere Sprache, nutzen überall any, haben drei hundert Dependencies und nutzen nochmal einen Transpiler, um das in JavaScript. Also da habe ich irgendwann gedacht, Jungs, ernsthaft jetzt?"
    },
    {
      "end": 634160,
      "speaker": "A",
      "start": 628030,
      "text": "Der Klassiker, wenn man die Typen Fehler schnell loswerden möchte, einfach überall Annie hinschreiben."
    },
    {
      "end": 643960,
      "speaker": "D",
      "start": 634320,
      "text": "Ja, es war in dem Fall wirklich nicht möglich, da einen Type eigentlich zu haben oder ganz schwierig, weil das aus falsch gelesen wurde, wie dieser Juniordev, der."
    },
    {
      "end": 651120,
      "speaker": "B",
      "start": 643960,
      "text": "Sich rechtfertigt vor demjenigen, den man halt reporten muss. Es ist sehr schwierig gewesen, das besser zu machen."
    },
    {
      "end": 663980,
      "speaker": "C",
      "start": 651120,
      "text": "Ich lehne mich jetzt auch mal aus dem Fenster. Ich habe dasselbe Programm jetzt oder haben wir jetzt in Go geschrieben und da haben wir nirgendwo ein Anytype oder ähnliches. Also ich würde die Aussage, die Wolfgang da unterschrieben hat, nicht wiedergeben."
    },
    {
      "end": 682700,
      "speaker": "D",
      "start": 664060,
      "text": "Geht das eigentlich in Go? Nein, ich sage ja, es geht. In Typescript geht es nur sehr, sehr schwierig. Bzw. Du brauchst halt ein Programm, was ein Schema von dir nimmt und dann die Daten aus einer Datei ausliest und auf dieses Schema mappt automatisch, damit du Types hast. Und das bekommst du halt bei Go automatisch, weil du die Types angeben."
    },
    {
      "end": 705640,
      "speaker": "C",
      "start": 682700,
      "text": "Du hast ja ein YAML Schema. Also es ging darum, dass wir YAML Dateien eingelesen haben und YAML hat ja Typen. Also das habe ich alles nicht verstanden, warum der TypeScript YAML Parser dann den Typen nicht unterstützen kann und so weiter. Aber ja, Punkt ist, ich wollte in meiner Freizeit nicht mit etwas kämpfen, wo ich dann am Abend immer schlechte Laune habe, weil da überall steht und allem drum und dran und weil mir dann das npm Instagram wieder um die Ohren fliegt. Ihr kennt diese ganzen Thematiken."
    },
    {
      "end": 720060,
      "speaker": "A",
      "start": 705640,
      "text": "Aber das beantwortet ja auch so ein bisschen die Frage für dich, also zumindest im Kontext des Podcast Projekts scheinst du noch zu programmieren, Go Code. Gibt es noch irgendwelche anderen Sachen, wo du sagst, da programmierst du noch tatsächlich oder gehört es tatsächlich gar nicht mehr so viel zu deinem Berufsalltag?"
    },
    {
      "end": 733020,
      "speaker": "C",
      "start": 720140,
      "text": "In meinem aktuellen Job komme ich nicht zum Programmieren, weil ich zwei komplette Teams leite. Da komme ich einfach nicht mehr zu. Aber Podcast und ein paar Seiten Projekte und ich habe hier noch so ein kleines Home Lab und all so, dann da mache ich ziemlich viel."
    },
    {
      "end": 737100,
      "speaker": "B",
      "start": 733420,
      "text": "Und Wolfgang, ist bei dir nur Typescript oder auch noch was anderes?"
    },
    {
      "end": 743580,
      "speaker": "D",
      "start": 737260,
      "text": "Ja, alles was sein muss und was so ein LLM halt ausspucken kann. Also meistens so richtig."
    },
    {
      "end": 752400,
      "speaker": "A",
      "start": 748240,
      "text": "Von welchem Coding surfst mit Windsurf."
    },
    {
      "end": 768840,
      "speaker": "B",
      "start": 752400,
      "text": "Aber fehlt es euch dann, wenn ihr sagt, ihr habt jetzt, also wenn ihr längere Phasen habt, wo ihr nicht mehr entwickelt oder würdet ihr sagen, ist es halt einfach, weiß ich nicht, es ist halt einfach Teil der Weiterentwicklung auch so ein Stück weit oder zumindest für den Weg, für den ihr euch entschieden habt, dass man vielleicht weniger entwickelt, aber darum."
    },
    {
      "end": 804710,
      "speaker": "D",
      "start": 768840,
      "text": "Ist es ja cool, wenn man Inside Projects noch irgendwie coden kann. Also ich glaube zu ein hundert Prozent Coding programmieren, gut, habe ich auch nie gemacht so richtig in meinem Leben, aber könnte mir auch jetzt nicht vorstellen. Aber es ist ja cool, wenn man dann irgendwo so eine Nische hat, wo man sich mal rein kann und dann irgendwas machen kann. Also so null prozent programmieren würde ich glaube nicht schaffen. Habe ich auch noch nie gemacht in meinem Leben. Also irgendwie so in side projects habe ich immer selber noch das Keyboard in irgendeiner Form verwendet. Aber es wird weniger auch durch Vibe Coding, muss ich sagen. Ich habe jetzt paar Sachen Vibe gecodet, funktioniert erstaunlich gut."
    },
    {
      "end": 850050,
      "speaker": "C",
      "start": 804870,
      "text": "Das Problem an side Projects ist aber, dass du oft die schwierigen Dinge einfach weglässt und auf der Arbeit kannst du die schwierigen Dinge nicht weglassen, denn also das ist schon ein Unterschied. Und dann navigierst du dich immer so ein bisschen um die wahren Herausforderungen drumherum, denke ich. Und das ist natürlich dann schon Nachteil. Aber deswegen fehlt mir ab und zu programmieren auf der Arbeit schon. Ich gebe auch ehrlich zu, ich frage mich ab und zu, warum dauert das so lange bei meinem Team? Weil ich denke mir, könnte ich so machen und dann schaue ich da mal rein. Ja fuck, das dauert alles richtig lange halt wegen diesen Constraints, die ich in meinem Kopf wegen den ganzen Sideprojects einfach wegschmeißen würde. Da steige ich dir natürlich dann jetzt nicht auf die Füße. Man vergisst dann halt oft dieses ganze Strukturding drumherum und dann die Anbindung an irgendwelche Authentifizierungsserver und und und."
    },
    {
      "end": 871850,
      "speaker": "A",
      "start": 851010,
      "text": "Ich finde es lustig, dass du das sagst. Bei mir ist es gerade andersrum. Ich habe gerade auch wieder ein kleineres side Project gestartet und habe mir so als Anforderung gesetzt, dass ich die Architektur versuche möglichst clean aufzubauen und möchte auch für lokale Datenbanken und so weiter bisschen etabliertere Sachen nutzen, als ich in der Vergangenheit genutzt habe. Und da lasse ich mir für diese Dinge ein bisschen mehr Zeit."
    },
    {
      "end": 877250,
      "speaker": "D",
      "start": 872010,
      "text": "Moment, was hast du für Datenbanken benutzt, die nicht etabliert sind? Was für nerdiges Zeug verwendest du?"
    },
    {
      "end": 887600,
      "speaker": "A",
      "start": 877250,
      "text": "Flatter Umfeld. Die nennt sich Isar tatsächlich. Also wirklich genannt nach dem Fluss. Und ich glaube nicht, dass irgendjemand schon mal das gehört hat. Dark native database."
    },
    {
      "end": 891680,
      "speaker": "D",
      "start": 887600,
      "text": "Naja, auf ISA is a relationship, Wolfgang."
    },
    {
      "end": 896320,
      "speaker": "A",
      "start": 891760,
      "text": "Keine Ahnung, könnte sein. Kann er nicht beantworten."
    },
    {
      "end": 903520,
      "speaker": "B",
      "start": 899920,
      "text": "Eigentlich ganz cool. Außer es ist eine nicht relationale Datenbank."
    },
    {
      "end": 925640,
      "speaker": "A",
      "start": 903920,
      "text": "Ja, das ist tatsächlich ein Dokument Datenbank. Also nicht passt es nicht. Aber worauf ich hinaus wollte ist, da lasse ich mir die Zeit und in den Projekten, wo es um Geld und Kunden und so weiter geht, ist das Zeitfenster manchmal ein bisschen enger. Da kann man sich diese Zeit halt nicht nehmen, sich in Sachen reinzunerden und so weiter. Aber ich glaube, dass es je nach Projekt unterschiedlich."
    },
    {
      "end": 961190,
      "speaker": "D",
      "start": 925640,
      "text": "Also ich hätte auch gesagt, was der Andi gemeint hat, ist, dass man in der Firma keine Möglichkeit hat, sich, oder wirst du gesagt, dass du schnell was machst. In der Firma muss alles immer perfekt sein, oder? Also du kannst privat in privaten Projekten etwas weglassen. Ich würde es ja teilweise auch umgekehrt sehen. Also zumindest haben mir das auch viele Programmierer immer berichtet. Wenn ich privat was mache, dann kann ich mich austoben, kann das Perfekte bauen, kann mir da in irgendeine Architektur rein nerden. Und in der Firma ist genau umgekehrt. Da muss ich das machen, was die Firma macht. Da muss teilweise schnell gehen, ich muss pragmatisch sein und in privaten Projekten brauche ich nicht pragmatisch sein."
    },
    {
      "end": 996310,
      "speaker": "C",
      "start": 961190,
      "text": "Ken, von dir verstehe ich genau, was du meinst, aber das meine ich ja nicht. Ich meine diese ganze Compliance Thematik, die noch dazu kommt, oder irgendwelche Deployment Mechanismen, die du dann, oder vielleicht musst du ein change Request vorher einstellen, bevor du was deploys und ein Standard Operation Procedure schreiben, damit Teammitglieder in anderen Zeitzonen das machen können und all sowas. Also dieser ganze Struktur Moped muss dann halt, den hast du halt im side Project nicht. Da machst du git push, YOLO und Abfahrt Force. Und ihr merkt schon, ich bin voll."
    },
    {
      "end": 1001270,
      "speaker": "A",
      "start": 996310,
      "text": "Drin wie der Peter Levels, wo jeder Commit einfach X. Macht er doch, oder?"
    },
    {
      "end": 1040290,
      "speaker": "B",
      "start": 1001590,
      "text": "Auf Enter Command, Enter Committed. Ich würde auch sagen, tatsächlich, ich halte da dagegen, weil ich finde in side Project, man hat eigentlich nicht die Zeit, manchmal Sachen schön zu machen. Also die wenigen Stunden, die ich habe, um an meinen eigenen Projekten zu entwickeln, da kann ich mir keine Gedanken drüber machen. Wie kann ich meine Konfiguration wiederverwendbar machen und keine Ahnung. Damit möchte ich mich da nicht auseinandersetzen. Aber wo wir schon mal so über Programm gesprochen haben, mich würde interessieren, hängt vielleicht auch ein bisschen damit zusammen, aber zum einen, wieso seid ihr überhaupt in die IT gekommen und wolltet ihr schon immer Spieleentwicklung machen?"
    },
    {
      "end": 1041170,
      "speaker": "A",
      "start": 1040370,
      "text": "Schon immer mal."
    },
    {
      "end": 1065410,
      "speaker": "B",
      "start": 1041410,
      "text": "Immer mal, genau, richtig. Ich habe die Frage so vorgelesen, wie sie dasteht, aber es ist ja so ein Gerücht, dass jeder Entwickler, jede Entwicklerin irgendwie mal ein Spiel entwickeln wollte. Oder zumindest geht es mir so und in meinem Freundeskreis. Mich würde interessieren, ging es euch auch so? Wolltet ihr eigentlich mal Spiel entwickeln oder ist es eine Sache, auf die ihr keinen Bock hattet? Und wieso seid ihr überhaupt ITler geworden? Vielleicht geht die Frage gleich mal. Der Wolfgang wollte was sagen, also frage."
    },
    {
      "end": 1070210,
      "speaker": "D",
      "start": 1065410,
      "text": "Ich Andi, ich wollte eigentlich was sagen, aber nicht deine Frage beantworten."
    },
    {
      "end": 1072050,
      "speaker": "A",
      "start": 1070530,
      "text": "Aber ich war gerade bei der letzten Frage."
    },
    {
      "end": 1119540,
      "speaker": "D",
      "start": 1073890,
      "text": "Nein, nein, es betrifft schon die Frage. Ich war gerade vor ein paar Tagen in einer Schule und habe da so einen kleinen Gastvortrag gemacht. Das ist so ein Informatikzweig mit Jährigen, die wirklich viel Informatik haben, programmieren lernen und so weiter. Und die hatte so einen Mentimeter, wo ich gefragt habe, warum habt ihr diesen Informatikzweig gewählt oder diese Informatikschule? Und neben ganz vielen sexuellen Begriffen, weil die sind alle in der Pubertät scheinbar, ist es sehr cool, wenn man da auf der Leinwand irgendwelche Wörter sieht, die man eingibt, sind auch sinnvolle Sachen gestanden. Und da war Game Design eines der meistgenannten Wörter oder Games an sich. Und die hab auch dann gefragt, wer will Game Entwicklung machen? Und irgendwie siebzig Prozent haben aufgezeigt. Also das scheint schon wirklich in den Köpfen so drin zu sein. Ich kann es recht schnell beantworten. Ich wollte nie Games machen."
    },
    {
      "end": 1123500,
      "speaker": "A",
      "start": 1119540,
      "text": "Du wolltest schon immer Datenbanken, bist auf die Welt gekommen und dachtest, die Datenbanken, das ist es."
    },
    {
      "end": 1131980,
      "speaker": "B",
      "start": 1123820,
      "text": "Consulting. Der Mustang wollte immer Consulting machen. Er ist rausgekommen aus dem Mutterleib und hat wie viel kostet, was ist das Budget?"
    },
    {
      "end": 1174950,
      "speaker": "D",
      "start": 1134780,
      "text": "Ich wollte in der Tat zu Schulzeiten wollte ich eigentlich, das war ja so zur Dotcom Bubble Zeit oder kurz davor noch in den ERN habe ich eigentlich vorgehabt, so eine Plattform zu bauen wie WebDE, so einen Konkurrenten zu WebDE, wo man gratis E Mails bekommen kann und eine Such Engine und so weiter. Und die haben mir damals dann schon schlau gemacht, woher bekommt man die Daten, wie kann man Such Engine bauen oder irgendwie mieten, E Mail aufsetzen über irgendwelche Postfix Server und so weiter. Mit einem Kollegen, der so bisschen Linux kannte. Hat natürlich hinten und vorne nie funktioniert und wir sind nie aus der Planung rausgekommen, aber das wollte damals eigentlich schon machen. Also da war irgendwie, keine Ahnung, siebzehn, sechzehn, irgend sowas."
    },
    {
      "end": 1181110,
      "speaker": "B",
      "start": 1174950,
      "text": "Okay, krass. Aber wer hat dir das gezeigt? Oder was war der Funke?"
    },
    {
      "end": 1216700,
      "speaker": "D",
      "start": 1181750,
      "text": "Ja, also der richtige Funke war eigentlich, es ist schwierig. Ich habe schon natürlich mit Spiele und so begonnen. Ich habe dann mal so ein c Buch von meinem Bruder bekommen, der in der Programmierung so ein bisschen tätig war. Kein Wort verstanden, es war Englisch auch noch und da sind irgendwas mit Pointer drin, null Chance da irgendwas zu verstehen. Und ich habe dann glaube ich, irgendwann mal angefangen mit Webseiten, so mit Frontpage, Microsoft Frontpage, Einwahlmodem hat mir Freund gezeigt, der bisschen älter war und in dem Business schon was gestartet hatte, so eine Webseite und da habe ich dann meine erste Webseite, glaube ich, gestartet und mit Bannerwerbung sogar monetarisiert."
    },
    {
      "end": 1222260,
      "speaker": "B",
      "start": 1216700,
      "text": "Und deswegen war für dich auch irgendwie klar, dass du das auch studieren möchtest und weiterverfolgen, weil du es einfach schon konntest."
    },
    {
      "end": 1248200,
      "speaker": "D",
      "start": 1223140,
      "text": "Das war eigentlich total zufällig, das Informatikstudium, weil in Innsbruck gab es kein Informatikstudium. Und dann wollte ich eigentlich Mathematik studieren. Mein Bruder hat Mathematik studiert, war irgendwie technisch. Mathe war cool, studiere Mathe. Und irgendwie zwei Wochen oder drei Wochen in der Sommerzeit, Urlaubszeit, habe ich dann zufällig irgendwo gelesen, Informatik startet in Innsbruck. Und dann habe ich halt einfach ah, das ist natürlich noch cooler. Dann habe ich Informatik gestartet."
    },
    {
      "end": 1250320,
      "speaker": "A",
      "start": 1248200,
      "text": "Schön, dass du sagst, das ist noch cooler als Mathematik."
    },
    {
      "end": 1253440,
      "speaker": "B",
      "start": 1251040,
      "text": "Und Andi, wie bist du dazu gekommen?"
    },
    {
      "end": 1259340,
      "speaker": "C",
      "start": 1253440,
      "text": "Ich habe überlegt, ob ich die Frage beantworte oder jetzt wieder einen Witz über Wolfgang Xocdor mache, wie lange eigentlich gesessen hat."
    },
    {
      "end": 1261980,
      "speaker": "D",
      "start": 1259340,
      "text": "Aber Moment, den will jetzt aber schon wissen."
    },
    {
      "end": 1267100,
      "speaker": "C",
      "start": 1261980,
      "text": "Ja, also für den Doktor hast ja zehn Jahre gebraucht. Hast du deinen Bachelor und deinen Master? War noch Diplom?"
    },
    {
      "end": 1276700,
      "speaker": "D",
      "start": 1268220,
      "text": "Es war schon Bachelor. Ich habe zwar einen Dipl. Ingenieur, aber es war offiziell schon ein Baccalaureatstudium. Nicht Englisch, sondern Deutsch. Baccalaureatsstudium und dann ein Diplomstudium."
    },
    {
      "end": 1278380,
      "speaker": "C",
      "start": 1276700,
      "text": "Gut, war jetzt nicht witzig. Schade eigentlich."
    },
    {
      "end": 1285180,
      "speaker": "D",
      "start": 1281980,
      "text": "Das sind aber alle gewöhnt, die unseren Podcast hören. Gar kein Problem."
    },
    {
      "end": 1370730,
      "speaker": "C",
      "start": 1285700,
      "text": "Ich wollte nie Spiele programmieren. Ich denke mir jedes Jahr mal so ein geiles D Game zu programmieren, so mit Godot oder so, was es da inzwischen gibt mit der Engine habe ich aber noch nie die Motivation gehabt, mich dahin zu setzen, auf jeden Fall mal ein Tutorial zu machen oder mal dieses Chrome Dino Spiel nachzuprogrammieren oder sowas. Irgendwie sowas, so was einfaches. Wie bin ich zur Informatik gekommen? Durchs Zocken. Also ich habe früher super viel gezockt. Tactical Ops, wer das noch kennt. Das ist so diese Counter Strike Variante von Unreal Tournament. Und irgendwann hat World of Warcraft und ziemlich viel age of Empires, so die LAN Party Zeit und so. Und damals zur Schule habe ich irgendwann wäre doch mal cool, wenn man sowas irgendwie dauerhaft macht, weil ich mache das ja als Hobby so ein bisschen hier so ein bisschen Game Skripten und Clan Page machen und so. Ja, so die ganze Kinderkram Thematik und eigene Computer zusammenbauen, bla bla bla. Habt ihr bestimmt alle auch gemacht. Und dann bin ich halt in diese informationstechnische Ausbildung gegangen. Es war so Fachabitur mit so einem Informatikhauch dabei. Und dann habe ich eine ganz normale klassische Softwareentwicklungsausbildung gemacht. Informationstechnischer. Wie nennt sich das denn? Anwendungsentwickler. Genau, Anwendungsentwickler heißt das ja. Und dann habe ich irgendwann festgestellt, ja scheiße, wenn du das den ganzen Tag machst, dann hast du ja gar kein Hobby mehr, weil dann war das Hobby mit Programmieren ja gar nicht mehr so spannend. Dann hatte ich so ein kleines Programmierloch und dann bin ich da irgendwie so halt weiter reingerutscht."
    },
    {
      "end": 1375360,
      "speaker": "B",
      "start": 1370960,
      "text": "Also du hast es quasi einfach, du hast es realisiert, dass dir Programmieren jetzt in der Freizeit nicht mehr Spaß macht."
    },
    {
      "end": 1379760,
      "speaker": "A",
      "start": 1375440,
      "text": "Du hast es einfach akzeptiert, OK, that's my life."
    },
    {
      "end": 1401010,
      "speaker": "C",
      "start": 1381280,
      "text": "Ich hatte ja einen guten Job und so weiter und so fort. Dann habe ich halt ein Jahr oder so halt ein bisschen was anderes gemacht und auf einmal hatte ich wieder mega Bock. Ich meine, ihr habt das ja sehr wahrscheinlich auch, ihr programmiert ja jetzt nicht acht Stunden, acht Stunden in eurem Job und dann geil, jetzt fahre ich vom Büro nach Hause und wow, direkt für den Computer und weitere acht Stunden. Also ihr macht ja auch ein bisschen Sachen nebenbei, oder? Wollte man den Kopf frei haben?"
    },
    {
      "end": 1409090,
      "speaker": "B",
      "start": 1401490,
      "text": "Wie bist du dann zu diesem ganzen DevOps Thema gekommen? Auch einfach, weil du diese Aufgaben bekommen hast, da wo du gearbeitet hast, oder?"
    },
    {
      "end": 1492700,
      "speaker": "C",
      "start": 1409330,
      "text": "Ich glaube, die Story habe ich schon ein paar mal erzählt, aber im Endeffekt, also ich habe in einer klassischen Zehn Mann Webagentur gelernt, PHP Typo, ziemlich viel Web gemacht, auch JavaScript und jQuery und XJS, falls das noch wer kennt. Und dann habe ich mich irgendwann woanders beworben, bei Trivago wurde auch genommen, war da ganz normal PHP Entwickler, ziemlich viel PHP Cron Jobs gemacht. Und irgendwann kam die Sysops Leute, die Systemadministratoren, zu meinem Vorgesetzten und gesagt ja, unsere Datenbank schmiert die ganze Zeit ab und die ist die ganze Zeit überlastet und neu starten hilft nicht mehr. Einer von deinen Jungs muss sich das mal anschauen. Da kam mein Chef so ins große Stand up, so mit zwanzig, dreiig Leuten hat man immer so ein Stand up und dann hat er gefragt, ja, irgendeiner muss sich das mal ansehen. Dann habe ich einfach meine Hand gehoben, dann habe ich mir das ein paar Tage angesehen, habe das erste Problem gefixt und dann habe ich gesagt, okay, das Problem ist jetzt gefixt, aber wir haben ein paar mehr Probleme. Und dann sagt er dann fix, die kann ich machen, aber dafür bräuchte ich mal Hilfe. So, und dann fing der an, weil Trivago war in einem Bereich, wo die sehr, sehr stark gewachsen sind. Dann fangen an jemanden einzustellen, so ich als Nulpe Programmierer. Und dann habe ich ein Team gegründet und dann ging das dann so weiter. Und irgendwann habe ich halt mich nur noch um Schreib und Lesezugriffe in Datenbanken gekümmert um architekturelle Dinge, verschiedene Datacenter, wie die miteinander kommunizieren. Hab angefangen diese Sachen zu optimieren, damit diese ganzen Probleme verschwinden. So bin ich dann halt da reingerutscht. Okay."
    },
    {
      "end": 1493980,
      "speaker": "B",
      "start": 1492700,
      "text": "Und es hat ja auch immer Spaß gemacht."
    },
    {
      "end": 1506060,
      "speaker": "D",
      "start": 1494220,
      "text": "Das ist die offizielle Geschichte. Und meine Geschichte, was ich gehört habe von unserem gemeinsamen Chef, ist, dass der Chef einfach unzufrieden war mit andis Leistung als Programmierer. Und dann hat dann zu dem ganzen."
    },
    {
      "end": 1510620,
      "speaker": "C",
      "start": 1506060,
      "text": "DevOps Bereich rübergeschoben, ich bin bei weitem nicht der beste Programmierer. Also das."
    },
    {
      "end": 1516060,
      "speaker": "A",
      "start": 1511260,
      "text": "Aber er hat dich gefragt, Wolfgang, wo man unterbringen kann und du hast dann."
    },
    {
      "end": 1520730,
      "speaker": "B",
      "start": 1516060,
      "text": "Gesagt, DevOps, da ist dieser Andi und wir brauchen eine Beschäftigung."
    },
    {
      "end": 1523330,
      "speaker": "D",
      "start": 1520730,
      "text": "Aber der Andi war auf jeden Fall besserer Programmierer als sein Chef."
    },
    {
      "end": 1533490,
      "speaker": "B",
      "start": 1524370,
      "text": "Ich hab schon mal Code vom Andi benutzt, weil du hast ja diesen Jira Client geschrieben in Go. Und den habe ich tatsächlich, oder ich hab das richtig noch auf dem Schirm, ja."
    },
    {
      "end": 1566400,
      "speaker": "C",
      "start": 1535330,
      "text": "Das Jira SDK für die Sprache Go ist eine Open Source Library, nicht offiziell von Atlassian oder sowas. Habe ich ziemlich früh gestartet, weil wir das auch bei Trivago genutzt hatten für so ganz doof damals noch git pre commit hooks. Das Bedeutet, bevor der Commit auf dem Server gelandet ist, wurde die Commit Message gepasst und gegen einen Jira Server geknallt. Gibt es das Ticket und hat das Ticket den richtigen Status und so weiter. Musste man damals wegen Audit Kram machen. Heutzutage würde ich das auch hart in Frage stellen, wenn ich mehr über Audit Kram weiß. Aber so ist das entstanden."
    },
    {
      "end": 1574080,
      "speaker": "D",
      "start": 1566560,
      "text": "Und Christian, wie war das Gefühl? Wie war die API? War die leicht verständlich, die Interface? Ich muss ehrlicherweise sagen, Katastrophe."
    },
    {
      "end": 1597700,
      "speaker": "B",
      "start": 1575780,
      "text": "Ich hab's ungefähr so gehandhabt, wie Andi seine Flutter App gehandhabt hat. Ich fand es am Anfang ganz cool und dann habe ich es einfach liegen lassen und nie wieder berührt. Ich könnte dir nicht mal mehr sagen, ob ich es gut fand oder nicht. Ich weiß nur, dass ich es mal benutzt habe. Und vom Andi habe ich schon mal Code verwendet, von dir noch nicht, Wolfgang. Aber beides stimmt ja nicht. Das Engineering Kiosk Dev frontend ist von dir, Wolfgang, richtig? Das habe ich auch schon mal benutzt."
    },
    {
      "end": 1602340,
      "speaker": "D",
      "start": 1597700,
      "text": "Na, das hat prima der Andi eigentlich geschrieben. In JavaScript bitte? In Astro."
    },
    {
      "end": 1602620,
      "speaker": "A",
      "start": 1602340,
      "text": "Ja."
    },
    {
      "end": 1602860,
      "speaker": "D",
      "start": 1602620,
      "text": "Okay."
    },
    {
      "end": 1627570,
      "speaker": "A",
      "start": 1603010,
      "text": "Naja, ihr habt ja vorhin oder jetzt gerade, Andy, vor allem du, auch schon gesagt, dass du eigentlich übers Zocken irgendwie zur IT gekommen bist und das ja damals dein Hobby war und du es jetzt irgendwie zum Beruf gemacht hast. Aber was macht ihr denn jetzt andersrum? So zum Ausgleich für euren Beruf. Ich würde mal die Frage zuerst an dich geben, Wolfgang. Machst du irgendwie zocken, Sport, sonst was, irgendwelche anderen Tätigkeiten, die so ein bisschen Ausgleich sind?"
    },
    {
      "end": 1630130,
      "speaker": "D",
      "start": 1627730,
      "text": "Also Programmieren ist noch kein Ausgleich vom Job."
    },
    {
      "end": 1639110,
      "speaker": "A",
      "start": 1631490,
      "text": "Ich kenne es ja. Wie ist es denn? Siehst du das als Ausgleich, wenn du hobbymäßig programmierst im Vergleich zu du machst deinen Job?"
    },
    {
      "end": 1640590,
      "speaker": "D",
      "start": 1639110,
      "text": "Ja, ich habe da eigentlich wenig."
    },
    {
      "end": 1646910,
      "speaker": "B",
      "start": 1643230,
      "text": "Das ist, wenn du einen Programmierer fragst, ob er was anderes macht als programmieren."
    },
    {
      "end": 1662910,
      "speaker": "D",
      "start": 1649470,
      "text": "Stille. Ja, das ist ja, wir schneiden ja die Stille immer automatisch raus und darum sind wir es gewöhnt, wenn wir nicht weiter wissen, einfach leise zu sein und stille zu halten und dann einfach weiterzumachen."
    },
    {
      "end": 1663550,
      "speaker": "B",
      "start": 1662910,
      "text": "Ein Punkt."
    },
    {
      "end": 1665230,
      "speaker": "D",
      "start": 1663550,
      "text": "Jetzt hast du das natürlich alles zerstört."
    },
    {
      "end": 1678250,
      "speaker": "B",
      "start": 1665950,
      "text": "Ein Punkt im B hätte auch sein sollen. Wolfgang sagt die Stille wird rausgeschnitten und Andi sagt das lassen wir aber drin. Haben wir leider nicht reingepackt, aber das passiert schon auch immer mal wieder."
    },
    {
      "end": 1685050,
      "speaker": "D",
      "start": 1678570,
      "text": "Kleiner Bingo Zwischenstand. Ich habe schon zwei Andi neckt Wolfgang und Wolfgang Doktor wird erwähnt."
    },
    {
      "end": 1691930,
      "speaker": "B",
      "start": 1686330,
      "text": "Ich habe auch schon drei Werte tatsächlich. Andi sagt jetzt sind wir doch mal ehrlich, habe ich noch dazu Open Source wurde."
    },
    {
      "end": 1692850,
      "speaker": "D",
      "start": 1692250,
      "text": "Das war schon."
    },
    {
      "end": 1695210,
      "speaker": "C",
      "start": 1692850,
      "text": "Oh, dann habe ich Open Source wurde auch schon erwähnt."
    },
    {
      "end": 1695610,
      "speaker": "D",
      "start": 1695210,
      "text": "Na stimmt."
    },
    {
      "end": 1699920,
      "speaker": "B",
      "start": 1699120,
      "text": "Sehr, sehr schnell."
    },
    {
      "end": 1718480,
      "speaker": "D",
      "start": 1700400,
      "text": "Aber um die Frage zu beantworten. Also ich habe da nicht so viel Unterschied eigentlich zwischen Arbeit. Bei mir verschwimmt das alles und meine side Project sind ja teilweise auch Arbeit und bei manchen verdienen auch Geld. Also das ist halt alles sehr schwammig. Aber natürlich gibt es natürlich Sachen, die außerhalb von tech mache."
    },
    {
      "end": 1718880,
      "speaker": "A",
      "start": 1718480,
      "text": "Natürlich."
    },
    {
      "end": 1763440,
      "speaker": "D",
      "start": 1718960,
      "text": "Also es gibt schon. Wobei mein neuestes side Project ist ja so halb tech, halb Energie Bereich, wo ja auch sehr interessiert bin. Und im Vorspann ist ja diese Berghütte erwähnt worden, die wir mit der Feuerwehr besitzen, wo ja gern irgendwie eine PV Anlage oder so herumbastel oder andere Sachen. Also da gibt es schon auch Sachen, die sehr tech nahe sind, so dass das klassische, was wahrscheinlich auch viele andere Informatiker so haben, dieses ganze ich baue irgendwas oder Strom. An sich bin ich sehr interessiert, aber abgesehen davon ja Sport natürlich. Klar. Sport gibt es in den in den Bergen genug. Bisschen klettern hin und wieder. Andi, wir waren schon lange nicht mehr klettern. Früher sind wir hin und wieder klettern gegangen. Wann warst du das letzte mal klettern, Andi?"
    },
    {
      "end": 1767280,
      "speaker": "C",
      "start": 1763440,
      "text": "Ich glaube letzte mal mit dir, weil es war, als wir in der Boulderhalle waren, glaube ich."
    },
    {
      "end": 1769600,
      "speaker": "D",
      "start": 1767360,
      "text": "Gut, es ist Jahre, viele Jahre her."
    },
    {
      "end": 1795990,
      "speaker": "B",
      "start": 1769760,
      "text": "Würdet ihr sagen, es ist schon irgendwie wichtig Hobbys zu haben, neben der IT vor allem? Weil also ich habe das Gefühl, mit diesem, das mit diesem Verschwimmen ist so ein generelles ITler Problem oder halt Leute, die ihre Arbeit auch als Hobby weiterführen können. Es gibt ja, ist ja nicht für alle Berufe der Fall. Ist es eine, also würde ich sagen, ist es schon wichtig, dass ihr so einen Ausgleich dann habt. Für dich jetzt der Sport, Wolfgang, bei dir, die warten wir noch auf die."
    },
    {
      "end": 1816770,
      "speaker": "C",
      "start": 1795990,
      "text": "Antwort, aber passt schon ein hundert Prozent, weil sonst denke ich, bist du so eine Person, die nur noch über IT und Programmierung in AI reden kann. Sorry, aber ich kriege ja Krätze, wenn ich mit Leuten spreche, die immer nur ein Thema, auch wenn du die fünf, sechs, acht mal in einem Monat siehst und die reden immer nur über das eine Thema. Da denke ich mir, das kann doch nicht sein. Also allein davor möchte ich mich persönlich auch schützen."
    },
    {
      "end": 1840220,
      "speaker": "D",
      "start": 1816770,
      "text": "Ja, vielleicht einfach ein Leben haben, was es auch immer ist. Du kannst ja auch Family oder so haben. Also diese, ich finde Hobby ja immer so schräg. Was ist ein Hobby? Weil wenn ich jetzt irgendein side Project starte, ist es ein Hobby, weil eigentlich will ja schon, dass es irgendwann Geld verdient und dann wird es zum Business oder ist es eigentlich von Anfang an irgendwie Business, was ich starten will? Also was definiert, ich glaube halt schon."
    },
    {
      "end": 1869520,
      "speaker": "C",
      "start": 1840220,
      "text": "Dass du mal andere Einflüsse brauchst. Ich glaube jetzt Hobby hin oder her, wie du es bezeichnest, mach mal was komplett anderes. Und ich meine, dadurch wird ja auch Innovation getrieben später. Also damit du mal was anderes siehst. Also du gehst jetzt in die Berge, hoffentlich hat jetzt nicht jeder Baumcomputer irgendwie da dran gepackt oder so. Also dann fragst du dich schon, okay, warum wird hier was abgeholzt? Und dann lernst du vielleicht was ein bisschen darüber und so. Es gehört ja schon ein bisschen, damit du auch mal andere Synapsen irgendwie in deine Gehirn beanspruchst, anstatt immer nur diese Programmierthematik."
    },
    {
      "end": 1873440,
      "speaker": "B",
      "start": 1869840,
      "text": "Ihr habt jetzt beide nicht den Podcast erwähnt als Hobby. Wollte ich nur mal gesagt haben."
    },
    {
      "end": 1877920,
      "speaker": "C",
      "start": 1876640,
      "text": "Ich habe ja noch gar nicht geantwortet."
    },
    {
      "end": 1880880,
      "speaker": "B",
      "start": 1878960,
      "text": "Dann geht die Frage an dich, wenn du jetzt. Podcast."
    },
    {
      "end": 1884400,
      "speaker": "D",
      "start": 1881360,
      "text": "Podcast, nein, also Hasenmähen."
    },
    {
      "end": 1928750,
      "speaker": "C",
      "start": 1884400,
      "text": "Genau. Also Podcasting ist natürlich, nimmt leider sehr viel Zeit ein, muss man schon sagen. Mehr als wir ihn nicht gedacht haben. Ne, ich mache in letzter Zeit, besonders in den letzten Jahren, anderthalb Jahren, sehr, sehr viel Sport. Also so drei bis viermal die Woche. Primär halt functional fitness, crossfit, solche Sachen. Und das mache ich, weil die Workouts so anstrengend sind, dass ich mich diese eine Stunde eigentlich nur darauf konzentriere, diese Workout zu überleben. Und dadurch vergesse ich einfach alles. Du machst, das ist wie wirklich so ein Kopf Reset. Du kannst die härtesten Probleme haben, du kannst die härtesten Gedanken haben und so weiter. Du gehst dann in diese Halle mit den mit den Leuten und du knallt sich einfach total weg, also sporttechnisch. Und das ist halt schon krass."
    },
    {
      "end": 1933150,
      "speaker": "D",
      "start": 1928750,
      "text": "Du hörst da aber nichts oder dabei, was tue ich? Jackpot zum Beispiel."
    },
    {
      "end": 1940110,
      "speaker": "C",
      "start": 1936110,
      "text": "Die Halle ist meist mit sehr lauter Musik ausgestattet."
    },
    {
      "end": 1943230,
      "speaker": "D",
      "start": 1940110,
      "text": "Ja, du könntest ja trotzdem was hören. Gibt ja genug Leute, die da irgendwas."
    },
    {
      "end": 2002560,
      "speaker": "C",
      "start": 1943230,
      "text": "Ja, ist ja kein klassisches Fitnessstudio und so weiter. Du hast da schon meist Kurse und allem drum und dran. Aber ja, dann bin ich oft draußen mit meinem Hund, da höre ich dann auch oft nichts, weil ich dann auch mal Pause von dem Podcast haben möchte, muss ich zugeben. Da höre ich dann die kaputten Schiffsmotoren auf dem Rhein und ich habe noch zwei Trecker mit denen großen Garten und da versuche ich, bin handwerklich nicht begabt, aber ich mache es gerne. Und dann schaut man sich gerne YouTube Videos an und merkt okay, wie funktioniert das? Also zum Beispiel, es gab mal eine Zeit, da hatte ich noch nie eine Kettensäge in der Hand und ein halbes Jahr später, ein halbes Jahr später konnte ich blind auseinander bauen, Kette schärfen, allem drum und dran, weil ich halt so viel dann mit der Kettensäge dann gemacht habe. Also ich bin da nicht gut drin, aber es macht mir Spaß, weil ich bin immer super stolz, wenn ich dann irgendwas mit meinen eigenen Händen gemacht habe. Und Freunde, die dann wirklich viel mit Holz machen, die lachen mich dann immer aus, finde ich dann immer. Aber nun gut, gehört halt dazu."
    },
    {
      "end": 2027750,
      "speaker": "A",
      "start": 2002640,
      "text": "Ja, aber ich finde es interessant. Also das, was finde ich oft oder jetzt auch in dieser vierer Runde allein schon irgendwie so eine Ähnlichkeit ist es halt immer dieses neugierig sein, Sachen zu verstehen und sich irgendwie vielleicht auch neue Sachen beizubringen. Und das kann man ja eben dann auch von der IT und Programmiersprachen und Frameworks auf komplett andere Bereiche übertragen. Ich glaube, das ist vielleicht auch das am Ende, was einen dann so antreibt und einen daran grundsätzlich interessiert."
    },
    {
      "end": 2064910,
      "speaker": "C",
      "start": 2028470,
      "text": "Es gibt ja viele Softwareentwickler und Softwareentwicklerinnen, die danach irgendwas Praktisches machen, irgendwas in der realen Welt. Viele machen ja Holzverarbeitung oder irgendwie sowas. Und ich meine, es ist ja auch super frustrierend. Du hängst acht Stunden vor diesem, vor diesem Rechner, vor dieser IDE Codes irgendwas und drückst auf compile und der schreit dich an, hey, dann Semikolon fehlt und denkst fuck, jetzt schon wieder. Also du erschaffst ja nichts. Das ist ja alles eigentlich hier nichts wert. Das ist ja alles nur virtuell, was wir hier machen und deswegen finde ich Rasenmähen ganz stark. Also du bewegst etwas von drückst was nach vorne und dann wird der Rasen von lang nach kurz schon Wahnsinn."
    },
    {
      "end": 2074430,
      "speaker": "A",
      "start": 2066030,
      "text": "Das ist natürlich, der Rasenmäher geht nicht an. Dann musst du nämlich erst einen Werkzeugkoffer holen und gucken, dass du den aufmachst, den Motor. Und vielleicht musst du die Zündkerze. Dann bist du wieder beim Engineering."
    },
    {
      "end": 2107180,
      "speaker": "D",
      "start": 2074510,
      "text": "Ja, aber das ist ja. Wobei das ist ja auch noch mal so eher, was du mit den Händen machst. Und ich glaube, was Andi sagt, ist ja noch mal schlimmer, wenn du irgendwie in der Karriereleiter dürft man sie eigentlich nicht nennen, aber wenn du dann irgendwie Lead wirst oder irgendwie weiter nach oben wächst, wo du immer weiter weg vom Coding bist, da hast du ja noch schlimmere Feedback Cyclen. Und da merkst du ja erst, wenn ein Team gut performt, ein Jahr später oder zwei Jahre später, dass irgendwas funktioniert hat. Und da ist es natürlich dann noch mal cooler, einfach zu sehen, wenn das Gras dann kurz ist oder wenn die PV Anlage funktioniert am Tag."
    },
    {
      "end": 2113100,
      "speaker": "B",
      "start": 2107420,
      "text": "Jetzt, wo Wolfgang Andi mal zugestimmt hat, das ist ja ein sehr seltenes Naturereignis."
    },
    {
      "end": 2118980,
      "speaker": "D",
      "start": 2114620,
      "text": "Stimmt, das wird nie ausgefüllt."
    },
    {
      "end": 2125999,
      "speaker": "B",
      "start": 2118980,
      "text": "Gar nicht in unserem Bingo. Aber ich habe hier quasi so ein Fragenpaar. Thomas, ich hoffe, du müsstest mir nicht übel, wenn ich die einfach zusammenfasse, die beiden."
    },
    {
      "end": 2127119,
      "speaker": "A",
      "start": 2125999,
      "text": "Mach das, mach das."
    },
    {
      "end": 2141119,
      "speaker": "B",
      "start": 2127119,
      "text": "Und zwar haben wir uns mal. Ich meine, ihr neckt euch ja immer, aber im Endeffekt, ihr kennt euch ja schon wirklich lang. Andi, im Vorgespräch hast du erwähnt, dass ihr so wie eine Art Ehe führt. Das waren deine Worte eins zu eins. Du hebst den Finger."
    },
    {
      "end": 2173499,
      "speaker": "C",
      "start": 2141119,
      "text": "Ja, das ist korrekt. Aber pass auf, das ist kein Scheiß. Und ich habe das jetzt auch nicht irgendwie aufbewahrt oder ähnlich. Und zwar hat mir jemand über. Ich bin noch in so einer anderen Discord Community und da habe ich eine Frage gestellt und irgendwann schreibt der Typ Hey, ich kann deine Frage zwar nicht beantworten, aber ich höre ab und zu in eure Podcast rein. Ziemlich gute Arbeit, die ihr da macht. Und dann habe ich dem privat geschrieben, habe gesagt Hey, danke fürs positive Feedback. Und dann so ja, ich habe lange nicht kapiert, dass du der Podcast Andi bist. Und auf einmal sagt die Dynamik zwischen dir und Wolfgang ist so süß. Er als Österreicher, lol."
    },
    {
      "end": 2178130,
      "speaker": "B",
      "start": 2177250,
      "text": "Was zur Hölle."
    },
    {
      "end": 2184530,
      "speaker": "C",
      "start": 2179810,
      "text": "Ich weiß jetzt nicht ganz, ob das positiv ist. Doch, ich finde schon. Ich muss oft schmunzeln."
    },
    {
      "end": 2194370,
      "speaker": "D",
      "start": 2185810,
      "text": "Wir haben auch mal E Mail bekommen, wo irgendwie drinsteht, wie toll der Andi ist. Und Andi, du bist ein super Typ und dann so Wolfgang du auch, aber auf eine andere Art."
    },
    {
      "end": 2200690,
      "speaker": "B",
      "start": 2195170,
      "text": "Ich finde einfach die Formulierung eher als Österreicher einfach so als Satz da stehen zu haben."
    },
    {
      "end": 2202640,
      "speaker": "C",
      "start": 2201200,
      "text": "Ja, also stark."
    },
    {
      "end": 2215600,
      "speaker": "D",
      "start": 2203840,
      "text": "Wobei ich habe von mehreren Leuten schon öfters gehört, also tiroler Freunde von mir, die irgendwie so sagen, checkt der Andi eigentlich immer, wenn du ihn verarschst? Also verstehen die Deutschen das, wenn du da sowas sagst?"
    },
    {
      "end": 2230860,
      "speaker": "B",
      "start": 2215760,
      "text": "Ja, also die Frage, die ich eigentlich stellen wollte, nämlich worauf ich hinaus wollte ist vielleicht kurz und knapp Andi, erstmal du an Wolfgang. Was schätzt du am Wolfgang und was nervt dich am Wolfgang? Muss nicht unbedingt it, dass der Andi."
    },
    {
      "end": 2234420,
      "speaker": "D",
      "start": 2230860,
      "text": "Zuerst muss, dann habe ich Zeit zu überlegen. Das finde ich schon sehr gut."
    },
    {
      "end": 2254910,
      "speaker": "C",
      "start": 2234500,
      "text": "Er challenge schon sehr oft und sehr viel aber und das schätze ich, es ist oft sehr fair und er hat echt leider oft gute Argumente. Also er holt dich aus seiner Komfortzone raus und wenn du nämlich mit einem subjektiven Argument um die Ecke kommen möchtest, dann zerlegt das halt oft, was mir auf den Sack geht. Aber er hat ja recht."
    },
    {
      "end": 2258350,
      "speaker": "D",
      "start": 2256190,
      "text": "Jetzt laufe ich gleich rot an. Ich hab noch nie so."
    },
    {
      "end": 2263790,
      "speaker": "C",
      "start": 2258350,
      "text": "Ne, das muss ich zugeben. Und jetzt kommt die Sache, die mich richtig nervt."
    },
    {
      "end": 2267670,
      "speaker": "B",
      "start": 2263870,
      "text": "Ich dachte das war das jetzt auch irgendwie schon inbegriffen verpackt, dachte ich."
    },
    {
      "end": 2271310,
      "speaker": "D",
      "start": 2267670,
      "text": "Nein, nein, es wird noch schlimmer. Abwarten."
    },
    {
      "end": 2306320,
      "speaker": "C",
      "start": 2271470,
      "text": "Der kann einfach keine Frage beantworten. Der fragt immer nämlich mit einer Gegenfrage zurück und stellt zu ihm eine oder Frage dann. Der lenkt immer ab. Der kann keine Frage richtig beantworten. Auf Englisch würde man sagen das drive me crazy. Also da gehe ich an die Decke. Du willst, du hast nur eine kurze Frage, weil du einfach mal weiterkommen möchtest. Ich stelle mir schon gar nicht mehr vor, dass ich eine Antwort kriege. Ich kalkuliere schon wieder delay von acht Stunden ein, weil ich schon wieder irgendwie diskutieren muss wegen irgendeinem Quatsch. Das weiß der aber auch. Also da ist er schlecht, aber er challenge fair. Das muss man sagen."
    },
    {
      "end": 2314260,
      "speaker": "A",
      "start": 2306320,
      "text": "Ich finde es auch, ich kenne auch so paar Leute, wenn du denen in WhatsApp eine Sprache, eine Frage stellst, dann kommt keine Antwort zurück, sondern erst wieso."
    },
    {
      "end": 2317060,
      "speaker": "B",
      "start": 2316100,
      "text": "Wer bist du?"
    },
    {
      "end": 2318020,
      "speaker": "A",
      "start": 2317540,
      "text": "Warum?"
    },
    {
      "end": 2350850,
      "speaker": "D",
      "start": 2320820,
      "text": "Ja, Kontext muss schon sein, das ist doch klar. Und zwar hat mir nämlich heute eine Freundin geschickt, die die letzte Episode gehört hat, hat geschrieben Der Andi ist mir super sympathisch. Der will einfach nackte klare Zahlen wissen und nicht das umgesumse. Ich werde auch jedes mal verrückt, wenn du so um tust mit Bruttogehalt und Zahlen und so weiter. Andi ist super. Der will einfach auf den Punkt kommen und Antworten haben. Finde ich super sympathisch. Passt zu dem was der Andi schon gesagt hat."
    },
    {
      "end": 2354730,
      "speaker": "C",
      "start": 2350850,
      "text": "Kannst du dieses komische Wort da, was du erwähnt hast, noch mal? Ummer. Gesumse."
    },
    {
      "end": 2356010,
      "speaker": "B",
      "start": 2354730,
      "text": "Ja, ich finde es super."
    },
    {
      "end": 2363330,
      "speaker": "D",
      "start": 2356170,
      "text": "Ummersumsen, drumherum reden, umgesumse. Ja, sumsen ist eher so jawohl in dem Kontext."
    },
    {
      "end": 2371980,
      "speaker": "B",
      "start": 2363330,
      "text": "Ich finde, das klingt so, als wäre der Podcast ab jetzt ab achtzehn. Ich bin ehrlich, also. Na gut, aber warum, wenn die."
    },
    {
      "end": 2379660,
      "speaker": "A",
      "start": 2375740,
      "text": "Jetzt wolfgang, your turn so schwer."
    },
    {
      "end": 2381100,
      "speaker": "B",
      "start": 2379740,
      "text": "Mir fällt nichts ein."
    },
    {
      "end": 2446930,
      "speaker": "D",
      "start": 2382379,
      "text": "Ja, es ist schon schwer, relativ einfach. Andi ist super organisiert. Ich schätze mir eigentlich auch als organisiert ein, aber gerade wenn ich mit anderen Leuten zusammenarbeit, weiß ich, wie sehr man das dann auch schätzen muss oder kann. Weil wenn man Andi irgendwas schickt oder wie eine Message sendet, dass irgendwas gemacht gehört oder eine Antwort eigentlich gern erwünscht ist, dann brauche ich nie nachfragen, auch wenn das dann erst paar Tage später passiert, dass die Antwort dann kommt. Aber man muss nie nachhaken. Ich weiß, das landet dann auf irgendeiner To do List oder so und das ist super praktisch. Bei anderen Leuten ist das eine Katastrophe, da musst du immer fünfmal nachhaken und so weiter. Und beim Andi denke ich nicht mal mehr dran, irgendwas auf eine Liste Liste bei mir zu setzen, weil die eh weiß, dass es gemanagt wird. Dann anderer Punkt, der positiv und negativ ist, würde ich sagen, ist die Direktheit vom Andi. Das kann sehr gut sein, weil man direkt weiß, woran man dran ist, aber kann natürlich auch sehr direkt sein. Und ja, gerade wir Österreicher oder auch wenn der andi irgendwem was schreibt, kann sein, dass dann halt etwas zu direkt ist."
    },
    {
      "end": 2449330,
      "speaker": "C",
      "start": 2447330,
      "text": "Ich möchte ganz kurz sagen, ich habe gerade Bingo gehabt."
    },
    {
      "end": 2452770,
      "speaker": "B",
      "start": 2449410,
      "text": "Ich hatte auch schon Bingo, aber ich habe es nicht gesagt. Ich habe gleich noch ein zweites."
    },
    {
      "end": 2457480,
      "speaker": "D",
      "start": 2455480,
      "text": "Und zwar, was habt ihr für Bingo ge."
    },
    {
      "end": 2475400,
      "speaker": "B",
      "start": 2457640,
      "text": "Ich hab Andi neckt Wolfgang. Andi sagt, jetzt sind wir doch mal ehrlich. Österreich wird erwähnt, das ist das erste Bingo und das zweite Bingo ist schon. Hund wird erwähnt, Open Source wird erwähnt und Wolfgang neckt Andi. Ich hatte aber auch mit den beiden Nekt Versionen hatte ich halt eigentlich schon zwei. Das ging ja wirklich nach zehn Sekunden war das eigentlich schon."
    },
    {
      "end": 2483000,
      "speaker": "C",
      "start": 2477240,
      "text": "Ja, ich warte jetzt noch wegen der direkt eigentlich auf die Ruhrgebietsreferenz. Dann hätte ich nämlich auch das zweite Bingo."
    },
    {
      "end": 2486640,
      "speaker": "B",
      "start": 2484360,
      "text": "Ja, deswegen, wenn du selber sagst, das."
    },
    {
      "end": 2489160,
      "speaker": "D",
      "start": 2486640,
      "text": "Ist dann immer Andis Ausrede. Wir sind halt so."
    },
    {
      "end": 2491320,
      "speaker": "C",
      "start": 2490200,
      "text": "War das eine Referenz?"
    },
    {
      "end": 2502960,
      "speaker": "B",
      "start": 2492360,
      "text": "Naja, wenn du sie selber machst, muss jetzt jemand anders machen. Jetzt hast du es gejinxt wahrscheinlich. Aber Wolfgang, hast du jetzt schon gesagt, was dich nervt in Andi? Das habe ich irgendwie noch."
    },
    {
      "end": 2506440,
      "speaker": "A",
      "start": 2502960,
      "text": "Ich glaube nicht. Ne, dass er mit den Fingern knackt."
    },
    {
      "end": 2553160,
      "speaker": "D",
      "start": 2510200,
      "text": "Was mich als Editor nervt, ist jetzt was ganz was unwichtiges, aber Andi lässt immer seinen Ring fallen, weil er spielt immer mit seinem Ring rum. Ich weiß nicht, wie oft ich diesen Damn Ring schon rausgeschnitten habe aus dieser Spur, weil der fällt ihm dann immer runter, wenn er damit rumspielt. Aber abseits davon, was mich nervt, ja so ein bisschen die Direktheit eben und dass der Andi vielleicht gern Fragen beantwortet, die eigentlich an andere gestellt sind, so in Runden. Aber das bekomme ich nur selten mit und im Podcast passiert es auch weniger. Also es ist so im anderen Umfeld. Aber sonst fällt mir jetzt gar nichts schwerwiegendes ein. Leider. Müsste ich noch mal besser drüber nachdenken. Gibt sicher ganz schwerwiegende Dinge, aber wenn einem nichts spontan einfällt, dann kann auch nicht viel falsch sein."
    },
    {
      "end": 2553880,
      "speaker": "A",
      "start": 2553320,
      "text": "Das stimmt."
    },
    {
      "end": 2555440,
      "speaker": "B",
      "start": 2554120,
      "text": "Kommt ja an dir echt gut weg."
    },
    {
      "end": 2557360,
      "speaker": "C",
      "start": 2555440,
      "text": "Ja, also alles fair. Alles fair."
    },
    {
      "end": 2563960,
      "speaker": "B",
      "start": 2557360,
      "text": "Also können die Leute ja mal Discord schreiben, was sie nervt an euch oder was sie gut finden in den Podcast Episoden. Das würde mich nämlich auch interessieren."
    },
    {
      "end": 2565960,
      "speaker": "A",
      "start": 2564040,
      "text": "Stimmt, kann man ja auch aus der."
    },
    {
      "end": 2572480,
      "speaker": "C",
      "start": 2565960,
      "text": "Zuhörerperspektive sehen vielleicht, dass wir irgendwie den Unterschied zwischen Postgre und Postgres nicht auf die Kette kommen kriegen."
    },
    {
      "end": 2606480,
      "speaker": "A",
      "start": 2572480,
      "text": "Jetzt haben wir noch eine letzte Frage, so bisschen für die persönlichen Fragen, die ihr direkt beantwortet. Wir haben da noch so ein paar kleine Special Fragen, aber zuerst noch die. Und zwar Andi, vielleicht zuerst an worüber hast du denn zuletzt deine Meinung geändert? Geweint. Genau, das kannst du gerne auch beantworten, wenn du möchtest. Kannst jederzeit ergänzen. Aber die Frage wäre, wo Hast du deine Meinung geändert? Vielleicht hat es du zu irgendeinem Thema eine starke Meinung, die du lange gehalten hast und dann aber doch eingeknickt bist und die Seite gewechselt hast. Who knows? Wir sind gespannt."
    },
    {
      "end": 2607920,
      "speaker": "D",
      "start": 2606640,
      "text": "Das gute Bild über mich."
    },
    {
      "end": 2610560,
      "speaker": "C",
      "start": 2608320,
      "text": "Boah, das ist echt eine schwierige Frage jetzt gerade."
    },
    {
      "end": 2612640,
      "speaker": "D",
      "start": 2610640,
      "text": "Ich kann ja mal kurz reinschauen, wenn."
    },
    {
      "end": 2613920,
      "speaker": "A",
      "start": 2612640,
      "text": "Der Wolfgang früher was hat."
    },
    {
      "end": 2626830,
      "speaker": "D",
      "start": 2615120,
      "text": "Was mir so spontan einfällt ist, ich bin eingeknickt bei TypeScript. Ich wollte TypeScript für unser Projekt unbedingt durchsetzen, bin dann aber eingeknickt, habe meine Meinung geändert. Go ist schon auch eine gute Lösung und kann manche Sachen sicher schön."
    },
    {
      "end": 2629700,
      "speaker": "A",
      "start": 2627940,
      "text": "Also du siehst deinen Fehler auch ein?"
    },
    {
      "end": 2634740,
      "speaker": "D",
      "start": 2631220,
      "text": "Es ist kein Fehler. Moment, Moment. Kein Fehler."
    },
    {
      "end": 2637460,
      "speaker": "A",
      "start": 2635220,
      "text": "Nein. Ich verwende ja selbst auch viel Typescript."
    },
    {
      "end": 2641540,
      "speaker": "C",
      "start": 2638260,
      "text": "Schwierig zuletzt."
    },
    {
      "end": 2644020,
      "speaker": "B",
      "start": 2641860,
      "text": "Du bist immer beim ersten Mal direkt richtig."
    },
    {
      "end": 2646500,
      "speaker": "C",
      "start": 2644180,
      "text": "Nein, du hast einfach immer recht."
    },
    {
      "end": 2649380,
      "speaker": "A",
      "start": 2646500,
      "text": "Es ist schwierig, dass du mal falsch liegst und deine Meinung ändern musst."
    },
    {
      "end": 2654440,
      "speaker": "D",
      "start": 2649860,
      "text": "Ich hab gedacht, wir sind immer bei dem Bereich, die eh schlecht finden, während."
    },
    {
      "end": 2665080,
      "speaker": "B",
      "start": 2654440,
      "text": "Andi überlegt, was haltet ihr denn von der Aussage, starke Meinungen schwach gehalten? Kennt ihr das, diese Formulierung? Also, dass man quasi, ich muss gerade."
    },
    {
      "end": 2667560,
      "speaker": "D",
      "start": 2665080,
      "text": "Nachdenken, was bedeutet starke Meinungen?"
    },
    {
      "end": 2692660,
      "speaker": "B",
      "start": 2668040,
      "text": "Das heißt quasi, dass man erstmal was rausposaunt im Sinne von Typescript ist nur scheiße, ist nur schlecht und ich bin aber bereit, meine Meinung zu ändern. Ich bin mir, wenn ich, während ich die Meinung, ich fange nicht an, Meinungen, meine Meinung schon so direkt zu differenziert kundzutun, so, naja, also bei TypeScript gibt es halt gute Seiten und ich verstehe ja, wo es herkommt und das ist sinnvoll. Sondern ich sage quasi die starke Meinung."
    },
    {
      "end": 2694260,
      "speaker": "A",
      "start": 2692820,
      "text": "Du provozierst eigentlich."
    },
    {
      "end": 2708590,
      "speaker": "B",
      "start": 2694420,
      "text": "Und ich provoziere, also die Idee dahinter so ein bisschen. Du provozierst Leute, bekommst halt auch vielleicht eher Argumente. Es kommt eher eine Diskussion vielleicht auch auf, als wenn du es eh schon differenziert sagst. Aber es ist natürlich halt auch ein bisschen polarisierender."
    },
    {
      "end": 2724830,
      "speaker": "D",
      "start": 2708750,
      "text": "Ist ein gutes Werkzeug, was man einsetzen kann, aber ich glaube nicht, dass es sinnvoll ist, es immer so zu handhaben. Aber mache ich natürlich ganz gern. Also ist vielleicht auch so ein Hobby von mir, wenn man bei Hobbys schon sind, dass ich probiere, Leute wütend zu machen oder so ein bisschen aufzupumpen."
    },
    {
      "end": 2730510,
      "speaker": "A",
      "start": 2724830,
      "text": "Du setzt es einfach überall ein. Wenn du das nächste Mal irgendwo im Restaurant bist und wie war das Essen? Das Essen war scheiße."
    },
    {
      "end": 2766520,
      "speaker": "C",
      "start": 2731870,
      "text": "Argumentieren wir das mal nicht gemocht. Ja, ich glaube, wenn man auf dieses Thema geht, Eine Meinung, die ich geändert habe, ist jetzt vielleicht nicht eine richtige Meinung, aber ich habe einfach aufgehört, mit solchen Leuten zu diskutieren, weil ich merke, okay, man weiß ja initial nicht, ob die das nur zum Polarisieren machen oder ob die jetzt wirklich davon überzeugt sind. Und deren Datengrundlage schwach gehalten ist einfach nicht existent. Ich sag dann einfach, okay, wenn du sagst, das MacBook ist rot, dann ist das rot, dann keine Wahrnehmung, das ist mir dann jetzt völlig egal."
    },
    {
      "end": 2769640,
      "speaker": "A",
      "start": 2767080,
      "text": "Und früher hättest du vielleicht diskutiert."
    },
    {
      "end": 2796170,
      "speaker": "C",
      "start": 2769880,
      "text": "Ich hätte ewig diskutiert. Ich liebe ja auch diskutieren. Ich liebe aber eine gute Diskussion, aber ich liebe keine Diskussion. Ich habe aufgehört, Energie da reinzusetzen und ich sage, whatever. Wenn du sagst, ein Elefant ist grün, ist okay. Also dann bleib halt so. Habe ich einfach aufgehört. Das ist, und ich glaube beim, ich glaube, das macht aber jeder Programmierer und jede Programmiererin mal irgendwann durch. Am Anfang willst du so schön Code schreiben und inzwischen sage ich, whatever works."
    },
    {
      "end": 2811050,
      "speaker": "A",
      "start": 2796410,
      "text": "Da gibt es doch, da gibt es doch sogar dieses Meme von so einer Kurve, glaube ich, wo irgendwie am Anfang Junior, in der Mitte dann irgendwie, keine Ahnung, der Typ, der sich über alles aufregt und ganz am Ende dann der Typ mit der Cape Kapuze, der wieder genau das gleiche macht wie der Junior."
    },
    {
      "end": 2843040,
      "speaker": "C",
      "start": 2811130,
      "text": "Also ich bin auch oft der Typ, der Shortcuts geht jetzt, wenn ich sage, okay, das muss jetzt skalieren, dann packe ich da schon mal Arbeit rein. Aber wirklich schnell experimentieren, schnell in Produktion testen. Ich provoziere auch ab und zu mal ein Incident dabei, lieber sich schnell bewegen. Und ja, da habe ich meine Meinung halt so ein bisschen geändert. Früher habe ich, oh, ganz vorsichtig und so weiter. Klar, jetzt, wenn jetzt Datenbank Migration machst und so weiter, da habe ich schon drei Sicherungsnetze unten drunter, wenn da was schief geht. Aber sonst bin ich eher auf der schnellen experimentiert und dann stopp da."
    },
    {
      "end": 2875730,
      "speaker": "D",
      "start": 2843350,
      "text": "Ich glaube, das ist halt eine Bandbreite einfach, die man können muss. Bei manchen Projekten oder Tasks kann man einfach schnell pragmatisch sein und bei anderen weniger. Und dasselbe ist auch vielleicht bei den Meinungen. Manchmal ist es sinnvoll, eine starke Meinung zu vertreten oder irgendwas zu challengen oder auch vielleicht im Team, weil man einfach diese andere Sichtweise reinbringen will, um die Diskussion zu fördern. Hatten wir ja auch gerade kürzlich in der Episode, gute Entwickler stellen dumme Fragen oder so ähnlich ist der Titel. Manchmal ist es schon nötig, irgend sowas zu machen und bisschen vorstellen."
    },
    {
      "end": 2904020,
      "speaker": "C",
      "start": 2875730,
      "text": "Ja, aber besonders mit diesem schnell chippen und ab und zu mal den dreckigen Weg zu gehen, da clasht man natürlich auch im Team. Weil jetzt habe ich halt die Meinung und ich denke, es ist ein Attribut von erfahrenen Leuten, diese Balance, wann musst du sicher gehen, wann kannst du einfach schnell und dreckig arbeiten? Und Leute, die das nicht denken, da clasht man natürlich schon. Oh ne, wir müssen jetzt hier Unit Test machen und so weiter. Und dann fragst du dich ja warum? Das Ding hat fünf Benutzer und das Ding hat nur eine Web UI und läuft client side only."
    },
    {
      "end": 2905140,
      "speaker": "D",
      "start": 2904660,
      "text": "Warum?"
    },
    {
      "end": 2925060,
      "speaker": "C",
      "start": 2906180,
      "text": "Also da clasht man natürlich schon und dann kommt man natürlich schon wieder in Diskussion, die man auf der Arbeit dann nicht umgehen kann, weil auf der Arbeit muss das Team die ganze Sache dann maintainen und so weiter. Und da gehe ich dann natürlich schon in Diskussion, da sage ich nicht whatever, da muss das dann natürlich sein. Aber hatten wir gerade gesprochen, das kann ich dann beim side Project schön skippen."
    },
    {
      "end": 2933200,
      "speaker": "D",
      "start": 2925060,
      "text": "Warum darf man auf der Arbeit sagen, aber nicht auf der Uni? Auf der Uni, ja, wir sagen in Österreich auf der Uni, aber Andi sagt mir immer, das heißt an der Uni."
    },
    {
      "end": 2935080,
      "speaker": "A",
      "start": 2933200,
      "text": "Oder in der Uni, aber auf der."
    },
    {
      "end": 2939640,
      "speaker": "D",
      "start": 2935080,
      "text": "Arbeit eben, aber auf der Arbeit geht schon, ich stehe ja nicht auf, ich."
    },
    {
      "end": 2941040,
      "speaker": "B",
      "start": 2939640,
      "text": "Habe dazu keine Meinung, mir ist es."
    },
    {
      "end": 2941400,
      "speaker": "C",
      "start": 2941040,
      "text": "Egal."
    },
    {
      "end": 2947960,
      "speaker": "A",
      "start": 2943480,
      "text": "Macht es doch, wie ihr wollt, ich gebe auf, ich stecke da keine Energie mehr rein."
    },
    {
      "end": 2954040,
      "speaker": "B",
      "start": 2948600,
      "text": "Wenn der Wolfgang sagt, der ist auf der Uni, dann bist du auf der Uni, wir treffen uns auf der Uni, ist okay."
    },
    {
      "end": 2959100,
      "speaker": "C",
      "start": 2954200,
      "text": "Ja, aber Thomas und Christian, könnt ihr das nachvollziehen mit der Diskussion? So nach dem Motto, ist das man einfach keine Energie versorgt?"
    },
    {
      "end": 2979580,
      "speaker": "A",
      "start": 2959100,
      "text": "Natürlich. Also ich finde, ich finde mich da tatsächlich wieder total wieder. Das ist auch was, was sich in den, weiß nicht, letzten zwei, drei Jahren bei mir so ein bisschen entwickelt hat, dass ich auf solche Sachen einfach auch nicht mehr eingehe, mit genau der gleichen Motivation wie du, dass mir die Energie, die man da reinsteckt, einfach zu schade ist und man kann sie in so viel andere Dinge stecken, wieso dann dort investieren?"
    },
    {
      "end": 3065960,
      "speaker": "B",
      "start": 2979820,
      "text": "Also ich hatte schon auch häufig Situationen, in denen ich, also ich habe einen konkreten Freund, ehemaligen Kollegen, der das extremst macht und bei dem, also der immer sehr, sehr starke polarisierende Meinungen äußert. Und vor allem eine Sache, die ich mir auch so ein bisschen abgeschaut habe von ihm, ist, dass er gezielt die andere Seite in einem Gespräch manchmal einnimmt. Wenn Leute sich so, kennt ihr vielleicht auch, man ist im Gespräch und alle regen sich auf über irgendwas und dann ist er derjenige, der sagt, aber wie sollen sie es denn anders machen? Oder was wäre denn das so wirklich? Obwohl er selber eigentlich auch gerne mit quatschen möchte und halt eigentlich auch das alles scheiße findet. Und ich habe schon viele, viele Diskussionen gehabt, die einfach nur Kraft gekostet haben und kacke waren. Aber ich habe schon gemerkt, dass das insgesamt dazu führt, dass man halt mehr versucht, gute Argumente zu finden, als wenn alle, wenn es von vornherein schon so, naja, aber es ist ja, man muss das ja verstehen, man muss ja auch die andere Seite verstehen und so weiter. Und dass da häufig Argumente dann liegen bleiben. Also ich glaube, zum Umdenken hat mich das häufiger gebracht oder häufig gebracht, wenn halt so klare polarisierende Meinungen geäußert worden sind. Aber es ist für mich halt auch sehr wichtig, wer äußert es? Also wenn es jetzt irgendeine random Person ist, wo ich nicht weiß, was ist der Hintergrund, muss ich der überhaupt zuhören, muss ich der glauben? Dann würde ich sagen, ist es irrelevant. Da bin ich voll bei euch, da habe ich auch schon viel Energie verschwendet. Aber da würde ich sagen, die Energie hätte ich mir durchaus sparen können. Aber wenn man weiß, man kann es."
    },
    {
      "end": 3085180,
      "speaker": "D",
      "start": 3065960,
      "text": "Ja auch als Advocate irgendwie markieren oder zumindest auch vielleicht so rüberbringen, dass es jedem klar ist. Es bringt ja teilweise die Leute auch aus diesem ständigen, wie man bei uns sagt, Gesumse raus. Also dass sie sich alle beschweren oder das Sudern einfach, dass sie mal rausgekickt werden. Auch wenn es offensichtlich ist, dass es gar nicht deine Meinung ist."
    },
    {
      "end": 3101400,
      "speaker": "A",
      "start": 3085980,
      "text": "Wir haben jetzt noch eine kleine letzte Frage für die persönlichen Sachen. Und zwar das Besondere daran, ist es eine Rollentauschfrage. Das bedeutet, Andi, Andy bekommt die Frage gestellt und muss sozusagen für Wolfgang beantworten. Und Wolfgang, du bekommst die Frage gestellt und muss für Andi beantworten."
    },
    {
      "end": 3105720,
      "speaker": "D",
      "start": 3101400,
      "text": "Andy, warum haben wir die zwei eigentlich das machen lassen? Das sind voll alle schwierige Fragen."
    },
    {
      "end": 3116520,
      "speaker": "A",
      "start": 3106680,
      "text": "Und zwar, wir haben auch so ein bisschen hier gestrichen, deswegen hat sich das hier auf eine Frage reduziert. Aber Andy, wenn der Wolfgang nicht in der IT arbeiten würde, was wird er dann machen?"
    },
    {
      "end": 3119800,
      "speaker": "B",
      "start": 3116520,
      "text": "Rumsumsen oder irgendwas mit Bergen?"
    },
    {
      "end": 3152040,
      "speaker": "C",
      "start": 3122270,
      "text": "Wenn ihr wandern geht und auf so einer Alm so einen Kaiserschmarrn essen wollt, dann ist meist neben der alm so eine Bank, da sitzt so ein alter, grimmiger Typ drauf mit so einem Wanderstock. Das ist meist der Typ, der die Alm ein tausend, acht hundert, siebzig gebaut hat. Ich glaube, das wird der Wolfgang machen. Und der hat nämlich dann noch so eine kleine Schafsherde hinter der Alm. Und der Wolfgang wird auch auf der Alm wohnen. So auch gut zweieinhalb, dreitausend Meter Höhe. Kein Strom. Und das wird er, glaube ich, machen."
    },
    {
      "end": 3155200,
      "speaker": "A",
      "start": 3152040,
      "text": "Kein Strom. Interessant, weil vorhin hat Wolfgang gesagt, ihn interessiert alles mit Strom."
    },
    {
      "end": 3158320,
      "speaker": "B",
      "start": 3157040,
      "text": "So gut kennt ihr euch."
    },
    {
      "end": 3183610,
      "speaker": "D",
      "start": 3159840,
      "text": "Ja, ich muss zugeben, das ist sehr gut getroffen. Und ich habe schon öfters mit dem Gedanken gespielt, irgendwie mal auf eine Hütte, eine Alm zu ziehen für eine gewisse Zeit oder zumindest komplett disconnecten. Aber ich denke mir dann immer, wahrscheinlich hätte ich ein Problem damit. Aber grundsätzlich klingt es sehr. Ich kann dazu relaten. Also ich könnte mir da auf dieser Bank eigentlich gut vorstellen. Und dann vielleicht so jeden Deutschen, der da so raufgeht und irgendwas sagt, den so anschauen."
    },
    {
      "end": 3185770,
      "speaker": "C",
      "start": 3183690,
      "text": "Schön grimmig. Genau so einer bist du."
    },
    {
      "end": 3188650,
      "speaker": "D",
      "start": 3187290,
      "text": "Schon wieder so ein Biefk."
    },
    {
      "end": 3194410,
      "speaker": "C",
      "start": 3188730,
      "text": "Ja, verdient deinen Lebensunterhalt mit den Touristen. Aber schön mal."
    },
    {
      "end": 3197770,
      "speaker": "D",
      "start": 3194890,
      "text": "Ja, okay, kann ich mich identifizieren, finde ich."
    },
    {
      "end": 3201610,
      "speaker": "A",
      "start": 3198330,
      "text": "Wolfgang, was würde Andi machen, wenn er nichts in der IT machen würde?"
    },
    {
      "end": 3206700,
      "speaker": "D",
      "start": 3201610,
      "text": "Ja, Landwirt, ganz klar. Also das ist super einfach. Klar, auf dem Traktor sitzen."
    },
    {
      "end": 3212210,
      "speaker": "C",
      "start": 3208690,
      "text": "Landwirt und Bauer ist ein richtig, richtig, richtig geiler Beruf."
    },
    {
      "end": 3214690,
      "speaker": "D",
      "start": 3212850,
      "text": "Moment, ist da Unterschied zwischen den zwei?"
    },
    {
      "end": 3219490,
      "speaker": "C",
      "start": 3214850,
      "text": "Ja, ich glaube, wenn du das wirklich tief durchleuchtest, ist das schon ein Unterschied."
    },
    {
      "end": 3221170,
      "speaker": "D",
      "start": 3219730,
      "text": "Ich meine, der Bauer ist da. Andi."
    },
    {
      "end": 3243190,
      "speaker": "C",
      "start": 3223170,
      "text": "Also Landwirt ist, glaube ich, der Oberbegriff und Bauer ist dann so eine Spezialisierung, das zu machen. Aber die haben jeden Tag andere Probleme. Da geht der Trecker kaputt. Sorry, aber da rufst du nicht die Werkstatt an und so weiter. Da kloppen die selbst im Hammer dreimal drauf, dann schweißen die sich neue Sachen dann. Das ist so abwechslungsreich. Wahnsinn."
    },
    {
      "end": 3247790,
      "speaker": "D",
      "start": 3243190,
      "text": "Soll dir mal deinem Chef sagen, dass du glaubst, dass deine Arbeit nicht abwechslungsreich ist und nichts passiert."
    },
    {
      "end": 3256590,
      "speaker": "C",
      "start": 3247790,
      "text": "Das ist nämlich jetzt diese komische Annahme. Also völlig aus dem Kontext gerissen ist, was niemand gesagt hat aus meiner Arbeit. Nicht abwechslungsreich. Ich habe gesagt, ein anderer Job ist abwechslungsreich."
    },
    {
      "end": 3259230,
      "speaker": "D",
      "start": 3256910,
      "text": "Okay, ich setze da jetzt keine Energie rein."
    },
    {
      "end": 3278770,
      "speaker": "B",
      "start": 3264030,
      "text": "Es ist aber auch so ein bisschen eine Trickantwort, weil du ja als. Also gerade Landwirte haben wahnsinnig viel mit Technik auch zu tun, wie viel It die einsetzen und wie viel geile tech die da in ihren Treckern und."
    },
    {
      "end": 3308250,
      "speaker": "C",
      "start": 3279730,
      "text": "Moment mal, also du redest jetzt hier von John Deere, was du auf Hacker News liest und bla. Geh mal in die Realität. Es gibt super viele Höfe, die irgendwie vererbt wurden, die nicht neu hingestellt wurden, wo nicht alles automatisiert ist. Es gibt noch super viele kleine Höfe, die gar nichts mit IT am Hut haben. Die haben immer noch alles auf Papier, die haben noch keinen Trecker mit GPS und Co. Und ich denke mal eher, das ist die Maße und nicht diese großen Landwirte, die du im Fernsehen immer."
    },
    {
      "end": 3324570,
      "speaker": "D",
      "start": 3308410,
      "text": "Und denk mal an unsere armen Bergbauern auf der Bank, ihre Kinder noch irgendwie durchzufüttern. Und dann kommen diese Touristen noch und nur. Also, dass man sich ein Brot leistet, muss man den Touristen noch ein Kaiserschmarrn verkaufen. Wir die armen."
    },
    {
      "end": 3326660,
      "speaker": "A",
      "start": 3325620,
      "text": "Da kann man ja nur grafisch."
    },
    {
      "end": 3329780,
      "speaker": "C",
      "start": 3327300,
      "text": "Also ihr kennt den Big Mac Connex, oder?"
    },
    {
      "end": 3340300,
      "speaker": "B",
      "start": 3329780,
      "text": "Ja, das ist der Preis von einem, was der Big Mac in unterschiedlichen Ländern kostet, oder? Um da die dann festzustellen, was die Kaufkraft im Land ungefähr ist."
    },
    {
      "end": 3340899,
      "speaker": "C",
      "start": 3340300,
      "text": "Ganz genau."
    },
    {
      "end": 3349620,
      "speaker": "D",
      "start": 3341700,
      "text": "Und du hast das letzte Mal, wenn du auf einer Hütte warst, gefragt, wie viel der Big Mac gekostet. Kein Wunder, dass dir der alte Sack da auf den Sack geht. Das ist ja, würde ich auch."
    },
    {
      "end": 3382040,
      "speaker": "C",
      "start": 3349620,
      "text": "Genau. Der Preis eines Big Macs weltweit ist eigentlich so die Referenz für die Kaufkraft. Und das bedeutet, wenn jetzt jemand aus Indien, der kann in der Regel nicht den Preis für einen Artikel zahlen, den ein Amerikaner für den Artikel zahlt. Deswegen ist der gleiche Artikel zum Beispiel in Indien günstiger. Und man nimmt oft den Big Mac Preis so als Referenz und rechnet das runter. Aber für mich gibt es inzwischen den Kaiserschmarrn Index, denn auf österreichischen Hütten. Fragen wir mal ganz kurz den Wolfgang. Ein Kaiserschmarrn, was kostet dich dieser herzustellen, Wolfgang? So, jetzt mal die Zutaten konkret dich, Wolfgang."
    },
    {
      "end": 3407350,
      "speaker": "D",
      "start": 3384200,
      "text": "Du brauchst Eier, du brauchst. Ja, Moment mal, jetzt kommst du da mit so einer Rechnung? Es geht ja nicht um die Zutaten. Außerdem, wenn ordentliche Zutaten sind, dann musst du ja diese arme Henne da pflegen und die Kuh und alles, was da oben steht am Bergbauernhof. Und dann musst du ja mit viel Liebe diese Kraft aus Ostdeutschland zahlen, die den Kaiserschmarrn dann zusammenrührt."
    },
    {
      "end": 3410870,
      "speaker": "C",
      "start": 3407350,
      "text": "Halt mal den Bubble, Christian. Und Thomas, hat er die Frage jetzt beantwortet?"
    },
    {
      "end": 3414950,
      "speaker": "A",
      "start": 3410870,
      "text": "Nein, das kenne ich aber von Christian oft."
    },
    {
      "end": 3426950,
      "speaker": "B",
      "start": 3415270,
      "text": "Ich kenne vor allem auch keine einzige. Also ich kenne nicht viele Berghütten, beim Skifahren und so zum Beispiel auch nicht, wo ich glaube, dass die selber die Hühner halten und so weiter und so fort, sondern die kriegen das alles geliefert aus dem Tal."
    },
    {
      "end": 3432340,
      "speaker": "C",
      "start": 3427030,
      "text": "Also ich glaube mal, ich lebe mich mal aus dem Fenster, die Zutaten für so einen Kaiserschmarrn kosten keine zwei Euro."
    },
    {
      "end": 3463470,
      "speaker": "D",
      "start": 3433770,
      "text": "Ja, aber es geht wirklich um die Arbeitskraft. Das ist das größte Problem. Und ich muss ja ihm, Andi, recht geben, weil das letzte Mal, wie in Andi besucht habe, in Tirol, möchte ich dazu sagen, in St. Anton Skifahren, ich bin fast vom Hocker geflogen. Da kostet dieses scheiß große Bier, also großes Bier ist ein halbes, Thomas, für die in Bayern kostet doch neun Euro. Dieses dumme Bier. Unglaublich. Hat mich umgerissen, mich. Er ist ja kein Kaiserschmarrn. Alles deutsche."
    },
    {
      "end": 3470190,
      "speaker": "C",
      "start": 3463550,
      "text": "Also der Kaiserschmarrn hat jetzt fünfzehn komma acht null Euro gekostet. Fünfzehn komma acht null."
    },
    {
      "end": 3471550,
      "speaker": "D",
      "start": 3470750,
      "text": "War er gut?"
    },
    {
      "end": 3472270,
      "speaker": "C",
      "start": 3471870,
      "text": "Ja."
    },
    {
      "end": 3473470,
      "speaker": "D",
      "start": 3472510,
      "text": "Hast du es gezahlt?"
    },
    {
      "end": 3473870,
      "speaker": "C",
      "start": 3473470,
      "text": "Ja."
    },
    {
      "end": 3478310,
      "speaker": "D",
      "start": 3473950,
      "text": "Aber hättest du es nicht gezahlt, wenn du im Vorhinein gewusst hättest, wie teuer ist."
    },
    {
      "end": 3481070,
      "speaker": "C",
      "start": 3478310,
      "text": "Ich hätte die Speisekarte in der Hand. Also von daher."
    },
    {
      "end": 3484590,
      "speaker": "D",
      "start": 3481150,
      "text": "Ja, eben dann value based pricing. Also wenn du als Tourist."
    },
    {
      "end": 3501290,
      "speaker": "C",
      "start": 3485550,
      "text": "Ich habe mich nie über den Preis beschwert. Ich habe die Fakten gecheckt, habe gesagt, der Preis ist da. Jetzt kommt es ja erst. Du redest hier von diesen armen Bauern, die für fünfzehn komma acht null ein Kaiserschmarrn kaufen, mit einem Wareneinsatz von, keine Ahnung, zwei. Also grantiger Wolfgang."
    },
    {
      "end": 3512210,
      "speaker": "D",
      "start": 3501290,
      "text": "Ja. Geh mal auf eine richtige Berghütte, wo wirklich so Alm Öhi sitzt, da bekommst du einen Kaiserschmarrn noch billiger. Aber da musst du dann abseits von, musst du weg von dieser Bahn und so, die da rein."
    },
    {
      "end": 3515650,
      "speaker": "C",
      "start": 3512690,
      "text": "Wir sind nur einmal Bahn gefahren, aber ich glaube, wir driften hier so ein bisschen ab."
    },
    {
      "end": 3544600,
      "speaker": "B",
      "start": 3516610,
      "text": "Kein Problem, gar kein Problem. Wir haben noch eine. Ihr habt eine Kleinigkeit auch vorbereitet, haben wir euch ja drum gebeten. Und zwar gibt es ja so ein sehr bekanntes Spiel, zwei Wahrheiten, eine Lüge. Da haben wir euch im Vorfeld mal gebeten, macht euch mal Gedanken, was das Gegenüber, mit dem ihr fast verheiratet seid, vielleicht nicht über euch weiß. Tatsächlich habe ich, ich kenne ja hier schon die Antworten. Ich habe das Gefühl, ich könnte vielleicht jetzt auch schon ein bisschen was hier beantworten nach diesem Gespräch. Ich hab euch schon besser kennengelernt hier heute."
    },
    {
      "end": 3545920,
      "speaker": "D",
      "start": 3544600,
      "text": "Moment, warum kennst du die Antwort?"
    },
    {
      "end": 3547880,
      "speaker": "B",
      "start": 3545920,
      "text": "Ich habe das Gefühl, ich kenne die Antworten."
    },
    {
      "end": 3549800,
      "speaker": "A",
      "start": 3548280,
      "text": "Dachte mir auch schon. Woher kennst du die?"
    },
    {
      "end": 3558360,
      "speaker": "C",
      "start": 3552280,
      "text": "Bevor du weitermachst, Wolfgang, weißt du eigentlich, wie lange ich überlegen musste und ich."
    },
    {
      "end": 3560280,
      "speaker": "D",
      "start": 3558360,
      "text": "Habe meine der mit offensichtlich."
    },
    {
      "end": 3569320,
      "speaker": "C",
      "start": 3560280,
      "text": "Ich habe meine Frau gefragt und die so ihr redet echt viel. Ja, ich musste echt viel, also ich musste tief gehen."
    },
    {
      "end": 3580660,
      "speaker": "B",
      "start": 3569320,
      "text": "Ich würde dich mal bitten, Wolfgang, hast du deine drei Punkte parat und nenne sie doch gerne. Erzähl gern noch ein, zwei Sätze dazu und dann kann Andi mal raten, was er denkt, was davon die Lüge ist."
    },
    {
      "end": 3608240,
      "speaker": "D",
      "start": 3581060,
      "text": "Das ist schön, dass du mich fragst, ob ich sie parat habe und du schickst sie dann währenddessen im Chat, um mich im Glanz erscheinen zu lassen. Aber es ist perfekt. Ich bin natürlich super vorbereitet und meine Punkte sind ich bin im Studium in der Vorlesung in die Informatik durchgeführt, Einführung in die Datenbanken durchgefallen. Ich war noch nie in meinem Leben bei einem Fußballspiel im Fußballstadion. Und Punkt drei ich bin mit einem Stapler ohne Führerschein zu schnell durch die Kurve gefahren."
    },
    {
      "end": 3610960,
      "speaker": "A",
      "start": 3608240,
      "text": "Dürfen wir da auch drauf reagieren? Weil irgendwie finde ich es."
    },
    {
      "end": 3621360,
      "speaker": "C",
      "start": 3612800,
      "text": "Ich muss die Lüge fischen. Ja, also die Vorlesung, dass der in dem Datenbank Ding durchgefallen ist, hundertprozentig ist wahr."
    },
    {
      "end": 3624320,
      "speaker": "B",
      "start": 3622400,
      "text": "Du sagst, er ist in Datenbanken durchgefallen."
    },
    {
      "end": 3625570,
      "speaker": "C",
      "start": 3624320,
      "text": "Ja, ich denke, das ist wahr."
    },
    {
      "end": 3627720,
      "speaker": "B",
      "start": 3626040,
      "text": "Ich denke, er würde heute noch durchfallen."
    },
    {
      "end": 3636520,
      "speaker": "D",
      "start": 3631160,
      "text": "Weißt du, wie oft ihr die kontrolliert habe schon und gegeben hab? Ich hoffe nicht."
    },
    {
      "end": 3643800,
      "speaker": "C",
      "start": 3637000,
      "text": "Die Sache mit dem Gabelstapler ist eine Lüge, weil ich denke auch, er war noch nie in einem Fußballstadion. Bei einem Fußballspiel."
    },
    {
      "end": 3645400,
      "speaker": "B",
      "start": 3643800,
      "text": "Wolfgang, machst du auflösen?"
    },
    {
      "end": 3645880,
      "speaker": "D",
      "start": 3645400,
      "text": "Falsch."
    },
    {
      "end": 3650760,
      "speaker": "B",
      "start": 3645880,
      "text": "Es ist falsch. Du bist wirklich mit dem Gabelstapler zu schnell durch eine Kurve gefahren."
    },
    {
      "end": 3661000,
      "speaker": "A",
      "start": 3651080,
      "text": "Und jetzt habe ich die Frage, weil die hätte ich nämlich direkt gestellt. Warum bist du gezielt zu schnell durch die Kurve gefahren und nicht an sich einfach zu schnell? Bist du umgefallen in der Kurve oder wie?"
    },
    {
      "end": 3729900,
      "speaker": "D",
      "start": 3661000,
      "text": "Ja, fast. Also es war während meinem Zivildienst. Ich war bei der Feuerwehr, Zivildienst, bei der Landesfeuerwehrschule und wir haben da auch Stapler fahren dürfen ohne Führerschein. Später dann nicht mehr aus gutem Grund. Und die Dinger sind ja wirklich sau schwer. Also die wiegen ja paar Tonnen, damit du irgendwie Autos und so herumfahren kannst. Und ihr habt so eine Feldküche für einen Kurs herumgeführt. Also alle Militärleute kennen so Feldküchen, da wo man halt dann irgendwie so ein überdimensionierter Griller und wo man Sachen reinstellen kann mit Gas. Ja. Und ich bin halt recht zügig in die Kurve gefahren und dann hat das Ding oben, also dieses Ding vorne Übergewicht bekommen. Das war so sechs Meter breit, so eine Stahlkonstruktion und ist mir einfach von den Gabeln gerutscht und ist dann so umgefallen und gebrochen auch. Hat man dann schweißen können. War schon okay, aber ich hab Gott sei dank den Stapler nicht umgeschmissen. Also der ist Gott sei Dank gerade geblieben, aber ja, habe ich geschafft. Danach hat man glaube ich einen Staplerschein gebracht. Alle, die nach mir gekommen sind und durch die Datenbanken bin ich auch durchgefallen, weil ganz klar, als Junger, der schon lange irgendwie programmiert und glaubt, er weiß alles, braucht er nie zu Vorlesungen gehen. Da kennt man sich doch aus. Und dann."
    },
    {
      "end": 3734480,
      "speaker": "B",
      "start": 3731740,
      "text": "Warst schon mal in einem Fußballstadion zu dem Fußballspiel?"
    },
    {
      "end": 3738160,
      "speaker": "D",
      "start": 3734640,
      "text": "Ich war in der Tat schon mal in einem Fußballspiel, weil ich eine Wette verloren hab."
    },
    {
      "end": 3743360,
      "speaker": "C",
      "start": 3740720,
      "text": "Aber hey komm, so weit war ich da nicht entfernt."
    },
    {
      "end": 3750800,
      "speaker": "B",
      "start": 3744320,
      "text": "Das stimmt. Andi, magst du uns mal mit deinen drei Punkten, zwei Wahrheiten, eine Lüge beglücken?"
    },
    {
      "end": 3761740,
      "speaker": "C",
      "start": 3750800,
      "text": "Mache ich, mache ich gerne, gerne. Ich war mal Mitglied in einer Eisenbahn AG. Ich darf legal Trecker fahren und ich habe jahrelang Kampfsport betrieben, also fechten, Kickboxen und Taekwondo."
    },
    {
      "end": 3764370,
      "speaker": "B",
      "start": 3762210,
      "text": "AG heißt jetzt nicht Aktiegesellschaft, oder?"
    },
    {
      "end": 3764770,
      "speaker": "C",
      "start": 3764370,
      "text": "Ne."
    },
    {
      "end": 3770530,
      "speaker": "A",
      "start": 3769490,
      "text": "Oder für echte?"
    },
    {
      "end": 3774210,
      "speaker": "C",
      "start": 3773010,
      "text": "Muss ich das beantworten?"
    },
    {
      "end": 3776850,
      "speaker": "B",
      "start": 3774690,
      "text": "Du musst nichts beantworten, du kannst, wenn du möchtest."
    },
    {
      "end": 3778930,
      "speaker": "C",
      "start": 3776850,
      "text": "Ne, es war eine Mod."
    },
    {
      "end": 3782690,
      "speaker": "D",
      "start": 3781170,
      "text": "Es ist relativ einfach. Ich sa."
    },
    {
      "end": 3783690,
      "speaker": "B",
      "start": 3783490,
      "text": "Ich."
    },
    {
      "end": 3785730,
      "speaker": "D",
      "start": 3783690,
      "text": "Ich darf legal Trecker fahren ist falsch."
    },
    {
      "end": 3786610,
      "speaker": "C",
      "start": 3785890,
      "text": "Das ist korrekt."
    },
    {
      "end": 3793190,
      "speaker": "B",
      "start": 3787570,
      "text": "Achso, du darfst wirklich nicht Legalträger fahren, aber du fährst dann auch nicht nicht Trecker, zwinker, zwinker."
    },
    {
      "end": 3797670,
      "speaker": "D",
      "start": 3794310,
      "text": "Ja. Auf deinem Privatgrund darfst du schon oder darfst nur nicht auf die Straße?"
    },
    {
      "end": 3800590,
      "speaker": "C",
      "start": 3797670,
      "text": "Nur wenn es eingefriedet ist. Eingefriedet? Eingezäunt."
    },
    {
      "end": 3801990,
      "speaker": "A",
      "start": 3800590,
      "text": "Eigentlich ein Burgfried."
    },
    {
      "end": 3805110,
      "speaker": "B",
      "start": 3803430,
      "text": "Nur wenn du einen Burgfried hast."
    },
    {
      "end": 3812790,
      "speaker": "C",
      "start": 3806070,
      "text": "Das ist eigentlich eine super lustige Thematik im deutschen Gesetz. Also wenn du ein eingefriedetes Grundstück hast, also du hast einen Maschendrahtzaun."
    },
    {
      "end": 3817590,
      "speaker": "D",
      "start": 3812790,
      "text": "Was heißt denn eingezäunt? Warum heißt es eingefriedet? Ja, aber warum heißt es gefriedet?"
    },
    {
      "end": 3826600,
      "speaker": "C",
      "start": 3817910,
      "text": "Wenn du du kennt ihr auch diese Hühnerzäune oder diese Ziegenzäune, die man auf Strom setzen kann, die man einfach so mobil dahin setzen kann?"
    },
    {
      "end": 3829480,
      "speaker": "D",
      "start": 3826840,
      "text": "Ja, aber wirklich so da wo man hinkeln."
    },
    {
      "end": 3844360,
      "speaker": "C",
      "start": 3829640,
      "text": "Diese mobilen Dinger, nicht diese stationären. Wenn du sowas hast, dann darfst du da drin Auto fahren und so weiter und so fort. Ist totaler Irrsinn. Eigentlich, weil wenn du dieses Gerät, was du fährst, nicht steuern kannst, dieser kurze mobile Zaun, der hält ja nichts auf. Also das ist total."
    },
    {
      "end": 3847480,
      "speaker": "A",
      "start": 3844760,
      "text": "In dem Moment, wo du den Zaun umfährst, ist es ja auch wieder illegal."
    },
    {
      "end": 3851720,
      "speaker": "B",
      "start": 3850120,
      "text": "Die Polizei steht schon so da, so draußen."
    },
    {
      "end": 3861800,
      "speaker": "D",
      "start": 3852040,
      "text": "Mein Freund. Ich glaube, bei uns gilt es ohne Zaun. Also da kannst du auch ohne Zaun fahren auf deinem Feld. Aber jetzt klär mal auf, was ist eine Eisenbahn AG?"
    },
    {
      "end": 3889810,
      "speaker": "C",
      "start": 3861960,
      "text": "Und zwar damals in der Schule, wir waren eine Ganztagsschule, das bedeutet so nachmittags gab es dann immer eine Sport AG und Unterwasser Rugby AG und so weiter und so fort. Da konnte halt so. Oder eine schreiner AG sowas. Und da gab es auch eine Modelleisenbahn AG. Da hat so ein crazy Mathelehrer halt einfach in einem Keller seine von der Schule so eine Modelleisenbahn gehabt und dann konnte da mitbasteln. Die habe ich gewählt, weil der Kollege immer die ganze Sache ausgefallen gelassen hat. Da hat sie nämlich immer."
    },
    {
      "end": 3893170,
      "speaker": "B",
      "start": 3892690,
      "text": "Da hat."
    },
    {
      "end": 3896450,
      "speaker": "C",
      "start": 3893170,
      "text": "Sie nämlich so in einem halben Jahr vielleicht so zwei Sessions oder so."
    },
    {
      "end": 3902800,
      "speaker": "D",
      "start": 3897570,
      "text": "Unglaublich. Damals schon so optimiert und so faul und was war es für Spurbreite h?"
    },
    {
      "end": 3905280,
      "speaker": "A",
      "start": 3904400,
      "text": "Er war ja nie da."
    },
    {
      "end": 3908000,
      "speaker": "D",
      "start": 3907280,
      "text": "Keine Ahnung."
    },
    {
      "end": 3909200,
      "speaker": "B",
      "start": 3908480,
      "text": "Spur z."
    },
    {
      "end": 3912160,
      "speaker": "C",
      "start": 3909600,
      "text": "Ich wüsste, die dinger Spurbreite haben."
    },
    {
      "end": 3917920,
      "speaker": "D",
      "start": 3913360,
      "text": "Hast du wenigstens beim Kampfsport, hast du da mehr gemacht oder warst du da auch?"
    },
    {
      "end": 3926000,
      "speaker": "C",
      "start": 3918320,
      "text": "Das habe ich wirklich aktiv gemacht im Kickboxen und im Taekwondo, hohere Gürtel und solche Thematiken. Und habe auch schon mehrere Meisterschaften gewonnen und so. Also das war schon recht."
    },
    {
      "end": 3927280,
      "speaker": "D",
      "start": 3926000,
      "text": "Höhere Gürtel, so Brust."
    },
    {
      "end": 3933960,
      "speaker": "C",
      "start": 3929880,
      "text": "Im Taekwondo nimmt man das da und so weiter. Vom schwarzen Gürtel im Kickboxen ebenfalls."
    },
    {
      "end": 3934920,
      "speaker": "B",
      "start": 3934120,
      "text": "Ach cool."
    },
    {
      "end": 3938120,
      "speaker": "A",
      "start": 3935080,
      "text": "Kann man auch gut mit drohen, wenn irgendein Junior."
    },
    {
      "end": 3966290,
      "speaker": "C",
      "start": 3940440,
      "text": "Wenn es an die Gürtelprüfung geht, besonders im Taekwondo, da lernst du mehr Gesetzestexte, wann du jemanden angreifen darfst und wann es notwehr ist und so weiter und so fort. Also das ist schon eine harte Nummer. Also die Prüfung, natürlich hast du dann da auch irgendwelche Kampfsporttechniken und so, aber du lernst halt echt viel Gesetzestexte, weil die Techniken, die du lernst, da kannst du halt Leute schon wirklich mit ausknocken. Das ist schon gar nicht so doof. Und dann muss halt lernen, okay, wer darf zuerst angreifen, wann, in welchem Umfeld und so weiter und so fort."
    },
    {
      "end": 3969970,
      "speaker": "D",
      "start": 3966290,
      "text": "Und wann hast du es aufgeben oder wann hast du es gemacht? Oder bis wann?"
    },
    {
      "end": 3971090,
      "speaker": "C",
      "start": 3970370,
      "text": "Bis wann?"
    },
    {
      "end": 3973810,
      "speaker": "B",
      "start": 3971730,
      "text": "Ihr lernt richtig was übereinander heute hier."
    },
    {
      "end": 3981010,
      "speaker": "D",
      "start": 3975090,
      "text": "Also hast du das nur so in jungen Jahren mal gemacht oder schon intensiv und dann durch deinen Unfall nicht mehr?"
    },
    {
      "end": 3988070,
      "speaker": "C",
      "start": 3981010,
      "text": "Nee, nee, das war schon intensiv, aber ich glaube zwei, sechs oder zwei sieben. Ich war jünger."
    },
    {
      "end": 3998470,
      "speaker": "D",
      "start": 3988070,
      "text": "Ja, ihr habt schon geschafft, da viele private Sachen heute aus uns rauszubringen, weil Andi hatte ja auch nur ein Unfall, wenn ihr das schon erwähnt habt. Der hat ja irgendwie acht und dreiig Schrauben in seinem Fuß oder so irgendwas versenkt."
    },
    {
      "end": 4005070,
      "speaker": "C",
      "start": 3998470,
      "text": "Aber ja, machst du machst du keinen Sport st früh machst du Sport. Ist halt auch schlecht. Also von daher hast du Schrauben im Fuß, ne?"
    },
    {
      "end": 4007990,
      "speaker": "A",
      "start": 4005390,
      "text": "Ihr kennt doch das Sprichwort ein und."
    },
    {
      "end": 4010590,
      "speaker": "D",
      "start": 4007990,
      "text": "Dreiig der Schrauben fuß."
    },
    {
      "end": 4016670,
      "speaker": "C",
      "start": 4010590,
      "text": "Habe ich jetzt nicht mehr, aber wurde schon alles getackert. Aber ja, es ist halt so. Mach Sport. Passiert halt was."
    },
    {
      "end": 4050200,
      "speaker": "B",
      "start": 4016830,
      "text": "Wir hätten jetzt auch noch Fragen. Wir nehmen ja hier gerade Podcast auf. So ein paar Sachen sind uns schon auch noch quasi zu diesem Projekt sind uns auch noch so ein paar Fragen gekommen, die wir natürlich als Podcaster interessant finden. Aber ja, vielleicht auch eure Zuhörenden. Und zwar was sind Dinge, die euch persönlich wichtig sind bei der Aufnahme von einem Podcast, bei der Auswahl von dem Thema? Worauf achtet ihr da eigentlich, wenn ihr an eurem Podcast arbeitet oder wenn ihr plant, was ihr als nächstes macht? Wolfgang, hast du da spontan eine Antwort parat?"
    },
    {
      "end": 4053400,
      "speaker": "D",
      "start": 4050440,
      "text": "Ja, wenn der Vorschlag vom Andi kommt, dann lehn ihn meistens ab."
    },
    {
      "end": 4057000,
      "speaker": "A",
      "start": 4054120,
      "text": "Gut, die goldene Regel."
    },
    {
      "end": 4062040,
      "speaker": "C",
      "start": 4059560,
      "text": "Und da stecke ich dann auch keine Energie mehr rein."
    },
    {
      "end": 4070420,
      "speaker": "B",
      "start": 4065620,
      "text": "Ich finde, das ist echt ein geflügeltes Wort. Da stecke ich keine Energie mehr rein. Das möchte ich in mein Sprach."
    },
    {
      "end": 4157300,
      "speaker": "D",
      "start": 4071220,
      "text": "Aber da kann man auch so andere aus dem Loch wieder rauslocken, die dann erst recht. Ja Moment, musst du schon diskutieren und weitermachen. Wir achten natürlich schon primär darauf, dass es uns irgendwie spaß macht, dass es interessant ist für uns. Und da haben wir natürlich auch ganz andere Ansichten. Also da sind wir ständig am streiten, ob ein Thema gut oder schlecht ist. Und dann versuchen wir uns halt da irgendwie das so zu verbiegen oder so in eine Richtung zu drücken, dass es für beide interessant ist. Und erst dann denken wir am Ende an unsere Hörer innen. Der Andi remindet mich da auch immer, sagt hey, wir kriechen unseren Hörer nicht in den Arsch. Wir wollen unsere eigenen Themen und das ist uns am wichtigsten. Also was interessiert uns und was glauben wir, was interessant eigentlich ist? Das sind sicher so die Hauptkriterien, wie wir Leute auswählen. Und dann haben wir natürlich ganz viele Kriterien noch so am Rande. Wir wählen die Leute aus. Leute dürfen sich selber nicht vorschlagen, was ja auch oft passiert über so Agenturen. Die Person sollte nicht irgendwie ganz stark einer Firma zuordenbar sein. Also im Idealfall irgendwie abseits, dass es nicht irgendwie nach Werbung klingt oder solche Dinge aus. Es ist wirklich ein Thema, was super interessant ist, soll ein allgemeines Thema sein, allgemein gültig, Evergreen Strategie, das heißt, dass man es auch nach einem Jahr noch hören kann. Also wir haben ganz selten irgendwelche akuten Themen, das heißt lang gültige Themen. Was haben wir sonst noch, Andi? Fällt dir was ein?"
    },
    {
      "end": 4279720,
      "speaker": "C",
      "start": 4157460,
      "text": "Ich glaube, die Themenauswahl kann man in so verschiedene Kategorien unterordnen. Also auf der einen Seite natürlich das, womit wir uns beruflich beschäftigen, weil wir sind auch ehrlich, so eine Vorbereitung von so einer Podcast Episode frisst halt viel Zeit. Und wenn du das gerade beruflich sowieso machst, zum Beispiel jetzt die Tage hatten wir das Thema Role based Access Control, das war bei mir auf der Arbeit auf dem Tisch und dann hat man das halt ready und dann ist das, ich sag mal, so eine low hanging fruit, schreibt man ein paar Notizen und dann hat man eine Podcast Episode vorbereitet. Dann gibt es ab und zu mal so motivationsschübe, wie zum Beispiel habe ich mich mal in diese Schaltsekunde reingenerdet oder in die ganze Doom Episode haben wir uns dann da reingenerdet. Ja, das ist dann so eigene Motivation, eigenes Interesse und da vergehen halt auch mal so locker zehn, zwölf, vierzehn, sechzehn Stunden, wo man dann einfach nur Recherche macht, wie ist eigentlich Doom aufgebaut und allem drum und dran. Das ist dann so Eigeninteresse, ein paar eigene Regeln setzen wir uns auf. Wie gesagt, wir machen jetzt nicht jedes Tool, nur wenn Tool auch so richtig groß ist. Und im Endeffekt ist es eigentlich so, wir machen den Podcast so, wie wir Bock haben und hoffen dann, dass das anderen Leuten gefällt. Und unser Credo ist ja auch, und das bestimmt eigentlich, glaube ich, auch den Podcast, wir denken zwar, IT ist schwierig und kompliziert, aber ein gelöstes Problem, denn die meisten von uns machen halt keine neuen Algorithmen und Co. Die richtige Herausforderung ist halt irgendwie im Team zusammenarbeiten und einer oder was zu bauen, was Leute benutzen. Und das ganze drumherum ist halt die Schwierigkeit. Teilweise versuchen wir uns auch mal Themen zu nehmen, die halt vielleicht jetzt weg vom Mainstream sind. Wir hatten jetzt zum Beispiel über generative Kunst mal eine Episode oder wir haben mal irgendwann auch über sechsstellige Gehälter gesprochen, da sprechen jetzt auch nicht so viele drüber. Und was ist das eigentlich in der Realität? Sechsstellige Gehälter sind oft nicht sechsstellige cash Gehälter, sondern irgendwelche virtuellen Firmenanteile, damit man mal diesen, oh, in Amerika verdienen die Dollar, die Bank scheiße da mal auf dem Tisch kriegt. Also halt mal ein bisschen mit sowas aufräumen."
    },
    {
      "end": 4293950,
      "speaker": "B",
      "start": 4279720,
      "text": "Und genau, also ich finde es interessant, dass du diese menschlichen Aspekt angesprochen hast, ist es auch eine Sache, die euch beiden spaß macht, weil die ist ja schon für euch beide ein sehr großer Teil eures Berufsalltags."
    },
    {
      "end": 4327950,
      "speaker": "D",
      "start": 4293950,
      "text": "Vor allem ich finde es sehr schön, wie du jetzt so die Stimme gesenkt hast, Stimme aufgesetzt hast, was uns im Leben bewegt. Aber um die Frage zu beantworten, daher kommen wir ja eigentlich auch. Also wir haben uns ja bei Trivago kennengelernt, wo wir beide Engineering Manager waren und eigentlich kaum irgendwelche technischen Sachen gelöst haben oder halt nur auf high level und ganz viel mit menschlichen Problemen zu tun hatten. Und daher kommt wahrscheinlich auch diese ganze Motivation, da über den Tellerrand rauszublicken und nicht nur auf der klassischen tech Ebene zu bleiben."
    },
    {
      "end": 4339470,
      "speaker": "C",
      "start": 4327950,
      "text": "Naja, also jetzt kann ich natürlich mit einem Kalauer kommen. Wie ist das? Wenn du schnell gehen möchtest, geh allein, wenn du weit gehen möchtest, geh zusammen oder irgendwie sowas."
    },
    {
      "end": 4344430,
      "speaker": "D",
      "start": 4339630,
      "text": "Also wenn man Kalauer bringen will, dann sollte man den eigentlich zügig sagen können."
    },
    {
      "end": 4346300,
      "speaker": "B",
      "start": 4344430,
      "text": "Aber seid ihr verziehen?"
    },
    {
      "end": 4401080,
      "speaker": "C",
      "start": 4346610,
      "text": "Ich denke halt, die ganze Sache, die wir hier machen, ist ein Teamsport. Natürlich kann sich ein Wipe Coder mal am Wochenende hinsetzen und eine LinkedIn Startpage nachbauen, aber shippen tut er die dann halt auch nicht. Und in den seltensten Fällen wird ein solo Founder eine Milliarden company alleine aufbauen. Also Punkt ist die ganze. Ja, aber das war ein Team. Genau. Als das dann größer wurde, wurde es halt relativ schnell ein Team Team. Ja, die ganze Sache ist halt ein Teamsport und Menschen sind kompliziert. Wolfgang ist auch kompliziert und deswegen, Gott sei Dank. Ich denke halt, also Gott, ich hatte halt glaube ich meine meine besten Hack Sessions mit mit Freunden, die halt hart kreativ sind und mit anderen Perspektiven. Und wenn man sich darauf mal einlässt, dann kommen da echt gute Dinge bei raus. Man kann echt, echt viel lernen, viel mehr als YouTube die alleine beibringen kann."
    },
    {
      "end": 4413880,
      "speaker": "A",
      "start": 4401240,
      "text": "Wo du gerade bei besten Hack Sessions warst, könnt ihr aus dem Bauch raus sagen, was so, also individuell natürlich eure Lieblingsfolge oder beste Folge ist? Und vielleicht auch so die Folge, wo ihr sagt, dass es irgendwie unzufrieden ist?"
    },
    {
      "end": 4416920,
      "speaker": "D",
      "start": 4414840,
      "text": "Man liebt doch alle seine Kinder, oder?"
    },
    {
      "end": 4428870,
      "speaker": "A",
      "start": 4420600,
      "text": "Aber gibt es Folgen, die euch irgendwie so im Kopf geblieben sind, wo ihr sagt, an die erinnere ich mich heute noch, wenn ich den Podcast denke?"
    },
    {
      "end": 4462850,
      "speaker": "D",
      "start": 4429270,
      "text": "Also es gibt ein paar Folgen, die ich gerne weiterempfehle, weil sie einfach gut finde. Und das ist definitiv die Folge mit Pip, weil es auch unsere stärkste Folge und Pip halt einfach cooler Typ ist. Und wann hat man sonst einen Multimillionär, der zusätzlich auch noch cool ist, an der Angel und quatscht einfach mal zwei Stunden mit dem dann die Fanny war super coole Folge. Also sie ist Psychologin und hat über das Impostor Syndrom gesprochen. Die empfehle ich auch sehr gerne, vor allem, wenn es jetz nicht so tech Leute sind, weil denen kann man die auch weiterempfehlen."
    },
    {
      "end": 4479170,
      "speaker": "B",
      "start": 4462850,
      "text": "Ich meine, vielleicht ist auch mit dieser Folge, wo ihr am unzufriedensten seid, ein bisschen eine drastische Frage, aber vielleicht da, wo ihr sagt, da hättet ihr gerne jetzt noch mal, da würdet ihr gerne noch mal nacharbeiten, noch mal nachhaken. Jetzt wo ihr noch mal eine neue Perspektive dazu habt, wäre es cooler, da noch mal drüber zu sprechen."
    },
    {
      "end": 4482930,
      "speaker": "D",
      "start": 4479170,
      "text": "Ja, zuerst will ich schon noch wissen, was der andi Philipp, zwei hundert muss."
    },
    {
      "end": 4483970,
      "speaker": "A",
      "start": 4482930,
      "text": "Man noch mal nacharbeiten."
    },
    {
      "end": 4501000,
      "speaker": "D",
      "start": 4486440,
      "text": "Also Die Folge von ein hundert, sieben und neunzig gefällt dir super gut, oder? Gute Engineers stellen dumme Fragen. Die habe ich glaube ich zwei Jahre gepitcht fast, diese Episode. Die hat der Andi immer abgelehnt, bis er so zermürbt war und irgendwann gemeint hat, ja okay, dann machen wir halt."
    },
    {
      "end": 4548940,
      "speaker": "C",
      "start": 4501320,
      "text": "Jetzt bleib mal bitte bei den Fakten, du hast sie einfach nicht vorbereitet. Ich hab gesagt, jo, geht klar, bereite vor und dann zwei Jahre später kam man raus, hier ist es, ne? Also die Fanny, die Folge, die ging über das Impostor Syndrom, die finde ich unglaublich gut, weil ich denke, das ist Thema. Jeder von uns hat ein Impostor Syndrom und ist auch ein bisschen gesund und das finde ich super. Ich fand die Folge mit Frank Karliczek, dem Gründer von Nextcloud, grandios. Der Typ ist einfach ein so geiler Mensch, der so auf dem Boden geblieben, baut da eine Firma auf, komplett auf Open Source Software. Es ist so wirklich immer noch in dem Open Source Sektor drin, hat Behörden als Kunden und ist einfach, kämpft für das Richtige, habe ich das Gefühl, so als Open Source Nerd. Das finde ich super."
    },
    {
      "end": 4574680,
      "speaker": "D",
      "start": 4549500,
      "text": "Die ein hundert, zwei und vierzig zum Home Office war auch sehr cool, weil da Jean Victor sehr viel Zahlen gebracht hat und aber nicht so wissenschaftlich irgendwie geblieben ist. Also es war sehr nahbar, es hat viele Leute betroffen und man hat endlich einmal echte Zahlen zu dem ganzen Homeoffice Hype gehabt. Und das ist natürlich auch cool, wenn man so wirklich Thema behandelt, was alle betrifft und dann wirklich Fakten und Zahlen hat."
    },
    {
      "end": 4588200,
      "speaker": "B",
      "start": 4574920,
      "text": "Ich muss gestehen, ich habe die Folge nicht gehört. Mich würde aber trotzdem interessieren, einfach nur ganz kurz und knapp, was ist eure persönliche Meinung zu home Office? Ich glaube, ihr seid beide eigentlich hauptsächlich oder nur im Homeoffice, oder?"
    },
    {
      "end": 4659800,
      "speaker": "C",
      "start": 4588600,
      "text": "Ich arbeite seit inzwischen dreieinhalb, vier Jahren ein hundert Prozent aus dem Homeoffice. Ab und zu reise ich ins Büro wenn man so möchte. Es ist schon eine. Man muss sich schon sehr disziplinieren, bin ich ehrlich. Nicht nur auf der Produktivitätsebene. Also man muss viel Proaktivität in den Job bringen, man muss sehr viel aktiven Outreach machen und man muss sich ganz klar seinen Tag auch strukturieren, damit man sich ein bisschen bewegt und mal weg vom Bildschirm kommt und so. Also es ist nicht für jeden, bin ich ehrlich. Und man merkt auch ganz klar, dass der Mensch ein soziales Wesen ist. Wenn man im Büro ist, dann arbeitet man weniger, weil man sehr viel soziale Interaktion hat. Und es ist auch schwieriger, Leute in Meetings Engagement zu erzeugen. Also bei einem Remote Setup, bin ich ehrlich, müssen alle mitarbeiten und alle Energie an den Tisch bringen, sonst wird es schwierig, wenn du sagst, ich schalte mich mal einfach hier auf und so. Kannst du machen, aber ist schon schwierig und geht dann aufs ganze Team. Aber ich mag es immer noch. Ich denke, ich bin auch ehrlich, ich würde für meinen Job aktuell nicht umziehen und bin glücklich, dass ich dann jetzt die Möglichkeit habe, für so ein tolles Unternehmen auch remote arbeiten zu dürfen. Muss ich auch sagen."
    },
    {
      "end": 4666440,
      "speaker": "B",
      "start": 4660200,
      "text": "Wolfgang, hast du überhaupt die Wahl, wieder Leute zu treffen oder musst du komplett alleine sein?"
    },
    {
      "end": 4711780,
      "speaker": "D",
      "start": 4666760,
      "text": "Ja, also wenn ich jetzt einen klassischen Job machen würde und antreten würde wieder, würde mir definitiv einen suchen, der nicht remote ist, also nicht fully remote. Die Flexibilität zu haben ist natürlich schon cool und das schätze ich auch an dem Ganzen. Aber ich bin schon viel lieber mit Leute vor ort und auch ganz viel von meinem Consulting Business ist eigentlich auch mit Leuten vor Ort. Und wenn ich einen Workshop macht, dann versuche den auch vor Ort zu machen. Aus. Es ist nicht anders möglich, weil da eine ganz andere Energie natürlich herrscht. Und ich bin definitiv ein großer Freund von Treffen im echten Leben, weil ich auch wirklich überzeugt bin, dass da mehr entstehen kann. Ich weiß, da haben viele andere Meinungen, aber ich glaube, dass du kreativer und auch produktiver sein kann, wenn du gemeinsam wirklich vor Ort sitzt und nicht nur remote zusammen."
    },
    {
      "end": 4759720,
      "speaker": "B",
      "start": 4711860,
      "text": "Ich muss auch gestehen, vorhin zu diesem Thema mit dem Arbeiten mit Menschen, ich mir auch gedacht, es ist so, also tatsächlich auch beim Studium, man kann ja in Frage stellen, wie gut oder auch bei der Ausbildung, da weiß ich es jetzt halt nicht. Ich habe, weil ich studiert habe, aber man kann die Frage stellen, wie gut tatsächlich die Vorlesungen sind. Aber was es auf jeden Fall ja schafft, diese Zeit, wo man lernt, ist, man trifft auf Menschen, die sich für das Gleiche interessieren und mit denen man da halt irgendwie in den regen Austausch kommt. Und diese Leute, die studieren, die müssen kein Geld damit verdienen. Und ich finde, das merkt man so krass an diesem zwischenmenschlichen, dass das halt wirklich die Leute, wenn man die richtigen findet, das zum Spaß machen und da Bock drauf haben, ohne irgendwelche Hintergedanken, was sie jetzt da rausbekommen. Und das ist einfach eine Sache, dieses einfach miteinander machen und kreativ an Ideen arbeiten, finde ich auch tatsächlich remote sehr, sehr viel schwerer."
    },
    {
      "end": 4791230,
      "speaker": "C",
      "start": 4759720,
      "text": "Also die Kreativität kommt auf jeden Fall durch Interaktion, gar keine Frage. Und die kommt auch im Büro oder Coworking Space und Co. Die Produktivität, wenn man wirklich, ich sag mal, was schaffen muss, bin ich ehrlich, denke ich, ist zu Hause höher. Allein weil im Büro auch immer hey, kannst du mal hier und da und so weiter. Und die haben auch im Büro noise cancelling headphones, auch viele Leute. Also ich glaube, wenn man, wenn man sich allein und wenn man zustimmt, okay, jetzt, dass man wirklich mal was auf die Straße bringen, was schaffen, dann ist man, glaube ich, im Büro im Homeoffice."
    },
    {
      "end": 4821970,
      "speaker": "A",
      "start": 4791710,
      "text": "Ich habe mal auf einem Meetup einen sehr interessanten Vortrag auch gehört noch mal zu dem Thema mit der Kreativität, dass du in Teams, die vor allem auch sehr divers sind, dass du da also sämtliche Leute aus unterschiedlichen Kulturen, sonst was, dass du halt einfach extrem viele Blickwinkel auf ein Problem bekommst, was du als eine Person halt einfach niemals schaffen würdest. Und da kommen einfach Dinge zusammen, die du alleine halt einfach mit einer Perspektive nicht so einfach stemmen kannst oder dir ausdenken kannst."
    },
    {
      "end": 4823930,
      "speaker": "D",
      "start": 4821970,
      "text": "Aber da könntest du ja remote auch machen."
    },
    {
      "end": 4835930,
      "speaker": "A",
      "start": 4823930,
      "text": "Ja, theoretisch schon. Aber ich glaube, dass ja, wenn du, also wenn du die Köpfe richtig zusammenstecken willst, glaube ich, bist du in Präsenz einfach echt noch ein bisschen passiert einfach bisschen mehr."
    },
    {
      "end": 4842090,
      "speaker": "B",
      "start": 4836090,
      "text": "Ich habe das Gefühl, es ist schwieriger, seine Stimme zu erheben, wenn man remote ist, weil es eine höhere Hürde gibt."
    },
    {
      "end": 4871610,
      "speaker": "C",
      "start": 4842250,
      "text": "Und genau das meinte ich mit jeder muss die Energie an den Tisch bringen. Also bei einem Remote Setup und es ist selten der Fall, dass es jeder tut, weil es ist, es fordert von jedem wirklich Anstrengung. Energie an den Tisch zu bringen ist anstrengend. Teilweise habe ich morgens um sieben Uhr die ersten Meetings mit einer Zeitzone. Natürlich bin ich noch müde und dann muss ich mich auch enorm anstrengen, wirklich Energie ins Meeting reinzubringen."
    },
    {
      "end": 4895980,
      "speaker": "D",
      "start": 4871690,
      "text": "Aber das musst du natürlich physikalisch genauso oder physisch vor Ort, weil ein Kollege von mir schon Zeit her, der hatte eine Besprechung mit seinem Betreuer für die Arbeit an der Uni und die sind halt einfach, also sind nicht sie gemeinsam der Betreuer, ist halt einfach eingeschlagen in einem one to one meeting, wo sie über Sachen gesprochen haben. Also es musste mal schaffen. Aber es gibt schon auch. Also nur weil du vor Ort bist."
    },
    {
      "end": 4905180,
      "speaker": "C",
      "start": 4895980,
      "text": "Kannst du trotzdem auch bei Remote ist es einfacher. Du machst einfach dein Mikro auf Mute. Du, wenn da fünf Leute im Meeting sind, Kamera oder machst BR."
    },
    {
      "end": 4907500,
      "speaker": "D",
      "start": 4905740,
      "text": "Du bist abgelenkt auf jeden Fall."
    },
    {
      "end": 4935310,
      "speaker": "B",
      "start": 4907820,
      "text": "Apropos abgelenkt, lass uns noch mal. Ich habe nämlich noch eine Frage zum Podcast. Und zwar wir haben auch gerade schon über Perspektiven, unterschiedliche Perspektiven erzeugen bessere Ergebnisse gesprochen und so. Und zu diesem Podcast Thema würde Thomas und mich natürlich auch noch interessieren. Habt ihr das Gefühl, dass der Podcast, seitdem ihr ihn angefangen habt, euch auch auf eurem Karriereweg weitergebracht hat und euch auch irgendwie besser gemacht hat in eurem Job oder auch eben zu besseren Entwicklern?"
    },
    {
      "end": 4943550,
      "speaker": "D",
      "start": 4935310,
      "text": "Bevor wir das klären, ich muss dringend wissen, wo war jetzt dieser Hund? Weil wenn das andi Hund war, kann ich mein anklicken."
    },
    {
      "end": 4946500,
      "speaker": "B",
      "start": 4944980,
      "text": "Den Hund hat er eigentlich schon erwähnt."
    },
    {
      "end": 4949740,
      "speaker": "A",
      "start": 4946900,
      "text": "Erwähnt hat er ihn, stimmt. Wir hatten kein Bellen im Bingo."
    },
    {
      "end": 4953140,
      "speaker": "D",
      "start": 4949740,
      "text": "Aber wo ich gerade irgendwo einen Hund gehört. Hat sonst jemand einen Hund?"
    },
    {
      "end": 4954740,
      "speaker": "A",
      "start": 4953140,
      "text": "Ja, aber die sind alle gerade nicht hier."
    },
    {
      "end": 4958500,
      "speaker": "C",
      "start": 4954820,
      "text": "Ne, ich habe keinen Hund gehört. Also muss der bei dir irgendwo draußen."
    },
    {
      "end": 4961140,
      "speaker": "D",
      "start": 4960020,
      "text": "Oder es war draußen."
    },
    {
      "end": 4962420,
      "speaker": "B",
      "start": 4961300,
      "text": "Ich habe ihn nicht gehört."
    },
    {
      "end": 4970510,
      "speaker": "D",
      "start": 4962580,
      "text": "Ja, irgendwo war da ein Hund. Egal. Okay, hat uns der Podcast weitergebracht in der Karriere. Andi beantworten mal du zwei Dinge."
    },
    {
      "end": 4975390,
      "speaker": "C",
      "start": 4971390,
      "text": "Er zwingt mich kontinuierlich, mich mit Themen zu beschäftigen, nicht immer auf meiner Agenda."
    },
    {
      "end": 4978190,
      "speaker": "D",
      "start": 4975390,
      "text": "Stehen und also eher der Podcast, nicht ich."
    },
    {
      "end": 4981070,
      "speaker": "C",
      "start": 4979470,
      "text": "Ja gut, du gehörst ja dazu."
    },
    {
      "end": 4982990,
      "speaker": "D",
      "start": 4981390,
      "text": "Möchte da ja keinen Zwang aus."
    },
    {
      "end": 5048960,
      "speaker": "C",
      "start": 4983790,
      "text": "Aber wenn wir ab und zu haben wir auch Gäste natürlich und man kann sich natürlich Themen picken, auf die man gerade Bock hat, die man sich, ich sag mal, wenn ich jetzt sage, das hört sich jetzt so böse an, sich erklären lässt. Das stimmt ja nicht. Wir stellen ja oft fragen, wo wir die Antworten schon kennen. Aber ich sag mal auch ehrlicherweise im Interview im Vorstellungsgespräch wurde ich gefragt Hey, wie hältst du dich denn up to date? Als Engineering Manager habe ich einfach meinen Podcast ausgepackt und dann war die Frage relativ schnell beantwortet. Also in der Hinsicht. Es war jetzt wahrscheinlich jetzt nicht das ausschlaggebende Kriterium, dass ich diesen Job bekommen habe, aber es zählt dann natürlich schon irgendwie dazu. Und man muss auch ehrlicherweise sagen, man lernt eine ganze Menge drumherum. Zeitmanagement sowieso. So eine Podcast Episode haben wir ja schon mal gesagt, stecken wir circa acht Stunden pro Person pro Podcast Episode rein. Also Zeitmanagement. Dann Organisation, dann spricht man natürlich enorm viel mit Leuten, man erweitert sein Netzwerk, was wir dann teilweise auch mal nutzen, bin ich ehrlich. Hat mich der Podcast zu einem besseren Software engineer gemacht? Ne, da muss ich sagen, nicht, weil wir."
    },
    {
      "end": 5050400,
      "speaker": "D",
      "start": 5048960,
      "text": "Moment, das war ja nicht die Frage."
    },
    {
      "end": 5051280,
      "speaker": "C",
      "start": 5050400,
      "text": "Doch, das war die Frage."
    },
    {
      "end": 5052320,
      "speaker": "A",
      "start": 5051280,
      "text": "Doch, war auch mit drin."
    },
    {
      "end": 5056640,
      "speaker": "B",
      "start": 5053840,
      "text": "Die Frage war auch, hat dich der Podcast zu einem besseren Zuhörer gemacht?"
    },
    {
      "end": 5077640,
      "speaker": "C",
      "start": 5058960,
      "text": "Also die Frage ist mit Nein zu beantworten, weil wir natürlich nicht sagen, hier muss ein Semikolon machen und so weiter. Also im Endeffekt, wenn du dich damit wirklich beschäftigen musst und wenn du es wirklich anwenden musst, musst du dich dann schon noch einmal in die Dokumentation reinversetzen und installieren und so weiter. Soll aber Inspiration und Ideen geben, damit du einen Überblick hast, ist das was für mich und so weiter. Soll ihr Lust auf mehr machen?"
    },
    {
      "end": 5080940,
      "speaker": "A",
      "start": 5077640,
      "text": "Episode, das mit dem Semikolon hätte auch auf Bigu stehen können."
    },
    {
      "end": 5127130,
      "speaker": "C",
      "start": 5080940,
      "text": "Ja, das kann sein, aber ich habe auf jeden Fall eine ganze Menge Wissen mitgenommen, wie zum Beispiel die ganze Doom Episode, Schaltsekunden Episoden, also da ist schon sehr viel Wissen, Monotonic Clock und so weiter. Das ist mir schon mehrmals bei der Arbeit über die Füße gefallen. Also in der Hinsicht könnte man schon sagen, okay, an manchen Ecken und Enden hat mich das schon zum besseren Software engineer gemacht, weil ich Konzepte, die ich vorher nicht kannte, da jetzt wirklich parat habe und auch wirklich, ah Moment, ich mache Zeitberechnung, ich ziehe hier eine Zeit ab. Oh ne, ich nutze lieber eine Motoriclock, sowas dann. Und das ist dann natürlich dann in Schaltsekundenzeiten schon, vermeide ich schon Bug. Also ja, das ist auch eine Meinung, wo ich meine Sache, wo ich gerade meine Meinung geändert habe, fällt mir gerade."
    },
    {
      "end": 5130330,
      "speaker": "A",
      "start": 5127130,
      "text": "Ein, um den Bogen zurückzuspannen, worüber hast."
    },
    {
      "end": 5132850,
      "speaker": "B",
      "start": 5130330,
      "text": "Du deine Meinung geäußert? Ob der Podcast was bringt für dich oder?"
    },
    {
      "end": 5139470,
      "speaker": "C",
      "start": 5132850,
      "text": "Naja, ich habe erst die Frage beantwortet, hat der Podcast mich zu einem besseren Software Engine gemacht? Nein. Und dann habe ich mich daran reingeredet, habe ich ja gesagt."
    },
    {
      "end": 5234460,
      "speaker": "D",
      "start": 5143310,
      "text": "Und Wolfgang, also karrieretechnisch ist es schwer natürlich zu tracken, weil es kam niemand auf mich zu und hat gesagt, ich würde dich jetzt gern haben oder deine Leistung aufgrund des Podcasts. Aber was natürlich schon ist, und das hat der Andi ja schon erwähnt, das kommt natürlich gut, wenn man Podcast hat und man kann ja auch zeigen, dass man sich in vielen Bereichen auskennt. Netzwerken ist ein super wichtiges Thema. Also ich habe ganz viele Leute kennengelernt, jetzt nicht nur unter unseren Gästen, sondern auch über die Meetup Ausgründung zum Beispiel oder auch andere Leute, die man so in irgendeiner Form kennenlernt darüber. Und es kommt natürlich bei mir auch ganz viel übers Netzwerk an Aufträge. Insofern dürfte es da schon einen Zusammenhang geben, auch wenn er schwer messbar ist natürlich. Gelernt habe ich sowieso massig natürlich inhaltlich von anderen Leuten, vom Andi, vom ganzen Management, von den Podcasts. Ich kann mittlerweile irgendwelche Equalizer Kurven und so weiter machen. Ich weiß nicht, ob das sehr sinnvoll ist, aber auch solche Sachen lernt man dann beim Schneiden. Und ob ich da bessere Softwareentwickler geworden bin? Ja, garantiert auch, weil man einfach viel mitnimmt. Und zum Beispiel die Episode, die wir hatten über Event Sourcing. Seit dieser Episode bin ich wirklich ein großer Fan von Event Sourcing und versuche Event Sourcing auch einzubauen und habe es auch schon ein, zweimal eingebaut in ein Projekt. Jetzt nicht Hardcore Event Sourcing, aber quasi vom Paradigma. Und es hat mir jetzt schon zweimal eigentlich den Arsch gerettet, dass ich diese Daten hatte über die Historie beim Event Sourcing. Also alleine diese eine Episode hat mich schon zum besseren Entwickler gemacht."
    },
    {
      "end": 5237820,
      "speaker": "A",
      "start": 5234860,
      "text": "Also doch noch nicht alles mit der AI, sondern auch noch mit Wissen aus."
    },
    {
      "end": 5249980,
      "speaker": "D",
      "start": 5237820,
      "text": "Dem Podcast hin und wieder. Die Architektur muss man ja schon irgendwie vorgeben, aber dann dieses stumpfsinnige Coding an sich, das gebe ich dann schon gern irgendeinem LLM oder halt dem Andi tatsächlich."
    },
    {
      "end": 5256310,
      "speaker": "A",
      "start": 5249980,
      "text": "Auch in der Architektur kann man sehr viel, sehr viel damit in Dialog gehen. Aber das ist ein anderes Thema."
    },
    {
      "end": 5266390,
      "speaker": "D",
      "start": 5257030,
      "text": "Das war ja auch, was ihr damals gemacht habt ihr die Architektur ja mit Typescript vorgegeben, was das Ding machen soll, die ganze Verwaltung von Podcast. Und der Andi hat es dann in Go ausprogrammiert."
    },
    {
      "end": 5268310,
      "speaker": "A",
      "start": 5266390,
      "text": "Also der Andi war quasi dann die KI."
    },
    {
      "end": 5272790,
      "speaker": "D",
      "start": 5269910,
      "text": "Genau, die bessere KI natürlich."
    },
    {
      "end": 5307410,
      "speaker": "A",
      "start": 5273030,
      "text": "Jetzt haben wir vorhin schon mal kurz angesprochen, was ihr machen würdet, wenn ihr nicht IT machen würdet. Und vielleicht kann man da auch bisschen die letzte ausschweifende persönliche Frage stellen. Und zwar wo geht es denn bei euch beiden so hin? Also was sind eure Ambitionen im Leben, vielleicht auch in der Karriere? Wollt ihr einfach immer weiter Karriere machen? Wollt ihr euch von der Karriere wegbewegen und bisschen mehr auf das Leben konzentrieren? So Work Life Balance mäßig. Was habt ihr da so ganz grob geplant? Und vor allem auch vielleicht im Zusammenhang mit dem Podcast, was mag da noch kommen? Wolfgang, vielleicht erstmal du."
    },
    {
      "end": 5335040,
      "speaker": "D",
      "start": 5307410,
      "text": "Du hast dir gedacht, eine kleine Frage oder was du im Leben alles erreichen willst. Ich bin ja nicht so dieser Mensch, der sich da immer so harte Ziele und so setzt. Andi, zückt jetzt wahrscheinlich gerade er macht irgendein dokument auf da schaut er sich jetzt seine lebensziele an die er garantiert definiert hat organisiert wie der Andi ist kann auf verschiedene flughöhen kann euch jetzt die ziele sagen für nächste Woche für nächstes Monat nächstes Jahr oder insgesamt fürs nächste Andi grinst die glaube ich stimmt."
    },
    {
      "end": 5344200,
      "speaker": "B",
      "start": 5335040,
      "text": "Kennt ihr das wenn du mit jemandem im Videocall bist und dann siehst du wie das Gesicht heller wird weil er gerade ein Browserfenster oder so aufgemacht hat das habe ich gerade bei Andi gesehen dass er sein Dokument geöffnet hat."
    },
    {
      "end": 5348240,
      "speaker": "D",
      "start": 5347880,
      "text": "Oder."
    },
    {
      "end": 5353160,
      "speaker": "B",
      "start": 5348240,
      "text": "ChatGPT was soll die Antwort wie komme ich hier raus?"
    },
    {
      "end": 5411730,
      "speaker": "D",
      "start": 5355640,
      "text": "Also bei zielen ist es bei mir wirklich schwierig das dem lifestyle und mit mehr freizeit das habe ich schon vollzogen wie selbstständig geworden bin weil das war mein Hauptgrund eigentlich wie damals auch aufgehört habe bei trivago dass ich einfach mehr Zeit habe für andere Dinge und das habe ich mir jetzt schon erfüllt wenn jetzt natürlich vielleicht noch so ein wunsch den ich auf der liste hätte wäre natürlich jetzt noch mehr finanzielle unabhängigkeit dass sie weniger machen müsste um geld zu bekommen weil das ist halt immer schwierig wenn man weniger arbeitet verdient man halt auch weniger und das muss man halt irgendwie alles unternehmen einen hut bringen also wenn wenn jemand mein leben finanzieren wollen würde wäre ich sehr dankbar weil dann kann ich wirklich genau das tun was sie will und sonst muss ich halt hin und wieder doch auch Jobs annehmen wobei die ja auch gerne mach also soll jetzt kein kein bashing sein auf irgendwas was sie was ich so mache sehen ja auch Challenges dabei die man noch nie hatte und darum kann man da ja auch noch viel lernen wenn man Leute berät zum Beispiel schon im."
    },
    {
      "end": 5417080,
      "speaker": "A",
      "start": 5411730,
      "text": "Kontext des Podcasts hast du da persönlich noch irgendwelche Ziele wo du sagst das willst du auf jeden Fall noch machen."
    },
    {
      "end": 5418280,
      "speaker": "B",
      "start": 5417080,
      "text": "Eine Folge allein."
    },
    {
      "end": 5464670,
      "speaker": "D",
      "start": 5422360,
      "text": "Das hatten wir in der Tat schon öfters überlegt und wir waren schon paar mal kurz davor aber es war dann immer wenn man es dann irgendwie darauf geeinigt sollten schon noch beide dabei bleiben also davon ja so ziele klar gäste stehen schon noch einige auf der liste ist immer schwierig weil die deutschsprachig sein müssen und wir wollen keine englischsprachigen leute haben das haben wir einfach so festgelegt sind wir bei dem thema wie wir leute auswählen manche andere podcaster machen das ja aber da bleiben wir einfach stur also da steht noch einiges auf der liste wo wir arbeiten können dran würde ich mal sagen und sonst ja mal vielleicht auf jeden fall die tausendste episode oder so wäre ganz gut jetzt sind wir bei zwei hundert das bekommen wir schon noch hin."
    },
    {
      "end": 5470960,
      "speaker": "A",
      "start": 5464670,
      "text": "OK und Andi, du darfst endlich dein dokument vorlesen, deine liste mit den unterschiedlichen Flughöhen."
    },
    {
      "end": 5479920,
      "speaker": "C",
      "start": 5471040,
      "text": "Ich fange am Ende mal an mit dem Podcast. Also wir haben jetzt die zwei hundert Episode, wir sind dreieinhalb Jahre dran. Wenn er ein tausend machen möchte, machen wir den glaube ich dann fünfzehn Jahre. Ist das korrekt?"
    },
    {
      "end": 5488680,
      "speaker": "B",
      "start": 5480320,
      "text": "Kommt drauf an. Wenn ihr jetzt plötzlich anfangt, so wie letztes Jahr im Dezember, das regelmäßig im Jahr zu machen, irgendwie so einen Monat lang jeden Tag eine Episode, dann könnte."
    },
    {
      "end": 5489440,
      "speaker": "A",
      "start": 5488680,
      "text": "Es vielleicht schneller gehen."
    },
    {
      "end": 5526620,
      "speaker": "C",
      "start": 5489840,
      "text": "Ja moin. Also der Adventskalender war schon echt anstrengend. Da haben wir den Aufwand ein bisschen unterschätzt, gebe ich zu. Ein bisschen sehr stark. Aber ne, wo wollen wir mit dem Podcast noch hin? Keine Ahnung. Also ich bin Ehr, wir haben unsere Höhen und wir haben unsere Tiefen in dem Podcast. Jetzt nicht nur machen wir die Podcast Episode mal alleine oder machen wir die zu zweit, sondern auch hey, pausieren wir mal oder pausieren wir nicht? Ging auch schon durch unsere Köpfe. Ab und zu diskutieren wir mal über irgendwelche Live Aufnahmen auf irgendwelchen Konferenzen oder irgendwelchen Panels oder der Wolfgang hat alles unter einem Arbeitstitel Nacht der Tech Podcasts auch mal laufen, dass wir ein eigenes."
    },
    {
      "end": 5529100,
      "speaker": "D",
      "start": 5526940,
      "text": "Lange lange Nacht der tech podcast."
    },
    {
      "end": 5538870,
      "speaker": "C",
      "start": 5529260,
      "text": "Lange Nacht der tech Podcast. Da ist jetzt hier schon mal die offizielle Einladung, wenn dieses Event mal stattfindet, dass ihr natürlich ebenfalls dabei seid. Lieber Christian, lieber Thomas, das könnt ihr."
    },
    {
      "end": 5543670,
      "speaker": "A",
      "start": 5538870,
      "text": "Schauen wir mal, ob wir dann Zeit haben oder ob ihr Energie da reinstecken wollt."
    },
    {
      "end": 5599790,
      "speaker": "D",
      "start": 5546470,
      "text": "Vielleicht ganz allgemein zu dem Thema Engineering Kiosk ist ja eine Dachmarke oder eigentlich so designt und wir würden schon noch gern einige Produkte unter dieser Dachmarke machen. Es ist halt das Problem, dass wir die Zeit aktuell nicht haben. Also wir haben ja das Meetup in Innsbruck, wir würden halt gerne auch weitere Meetups vielleicht haben oder unter der Dachmarke vielleicht irgendwie allgemeine Education Sachen, Konferenzen, lange nach der Podcast, was es auch immer ist. Also wir würden schon gern mehr eigentlich noch machen. Alles in Richtung Wissensvermittlung, Discord, unser Discord Server ist ja auch in gewisser Weise ein Austausch, wo sich Leute austauschen können, voneinander lernen von den unterschiedlichen Firmen und da setzen wir eigentlich schon an und würden noch gern machen, aber ist halt auch eine Zeitfrage. Aber wenn jemand gute Ideen hat diesbezüglich, gerne mal kontaktieren. Und wir sind ja auch offen, also wenn jemand ein Meetup machen will unter der Engineering Kiosk Brand in irgendeiner Stadt."
    },
    {
      "end": 5608550,
      "speaker": "C",
      "start": 5600030,
      "text": "Wir supporten da auch. Wir hatten auch schon mal überlegt, okay, machen wir irgendwas auch machen wir auf Twitch so Streaming Klamotten und so, aber wir haben es dann aus Zeitgründen, das."
    },
    {
      "end": 5612590,
      "speaker": "D",
      "start": 5608550,
      "text": "Haben nicht wir überlegt, ich bin einfach zu alt für das Twitch."
    },
    {
      "end": 5631110,
      "speaker": "C",
      "start": 5612670,
      "text": "Da überlegen wir auch ab und zu holen wir uns da jemanden rein. Also falls da wirklich wer mal Ambitionen an den Tisch legen möchte und bei uns mitmachen möchte, sprecht uns einfach an, wir sind da immer offen. Aber wo möchte ich hin, ne, ich habe keine fünf Jahres Ziele, ich habe auch keine zwei Monats Ziele und ich habe auch nicht das Dokument aufgemacht, wo die ganzen Ziele drin stehen."
    },
    {
      "end": 5638790,
      "speaker": "D",
      "start": 5632230,
      "text": "Was bist du für Landwirt? Als Landwirt musst du doch fünf Jahresziele haben. Da musst du allein einteilen, welche Felder wann von der EU gefördert werden."
    },
    {
      "end": 5646310,
      "speaker": "C",
      "start": 5638790,
      "text": "Also was jahrelang bei mir mitgeschwungen ist, ob ich auch mal Freelancer werde und mich selbstständig mache. Ich hatte diesen Traum von."
    },
    {
      "end": 5650310,
      "speaker": "D",
      "start": 5646310,
      "text": "Das war übrigens perfekt getroffen in eurer Intro, das war wirklich super."
    },
    {
      "end": 5669450,
      "speaker": "C",
      "start": 5651690,
      "text": "Und ja, weil ich immer den Gedanken habe, oh, da bist du zeitlich flexibel und allem drum und dran und ich kann meinen Tag gestalten, wie ich möchte und blablabla. Und das habe ich jetzt einfach komplett zur Seite gelegt, weil ich habe mir gedacht, ich weiß gar nicht, ob ich das wirklich möchte, weil das ist schon hart. Ihr drei seid ja gerade Freelancer, da muss ich komplett um eigenes."
    },
    {
      "end": 5672490,
      "speaker": "D",
      "start": 5669450,
      "text": "Der Andi will nicht weg von seinem achtstelligen Gehalt. Wollte gerade sagen."
    },
    {
      "end": 5699040,
      "speaker": "C",
      "start": 5672490,
      "text": "Naja, also eins muss man sagen, wenn du Arbeitnehmer bist, dann machen side Pro Projects wie der Podcast einfach deutlich mehr Spaß, weil du halt dich da austoben kannst. Es ist eine komplette Spielwiese und es competet nicht dann mit was anderem, weil ich habe dann einen festen Job, das muss man leider auch sagen und das schätze ich sehr, gebe ich zu in letzter Zeit. Natürlich habe ich jetzt auch einen guten Job und es macht mir sehr viel Spaß und ich lerne auch dazu. Das hat dazu beigetragen, dass ich diese Freelancing Thematik erstmal zur Seite gepackt."
    },
    {
      "end": 5720760,
      "speaker": "B",
      "start": 5699040,
      "text": "OK, dann vielen Dank. Wir würden jetzt zum Ende dieses Podcast kommen, aber bevor wir quasi zu dem Teil kommen, wo wir danke sagen und was weiß ich alles, haben wir noch einfach eine ganz, ganz schnelle Fragerunde. Drei schnelle Fragen, nicht lang diskutieren, könnt ihr natürlich gern machen, euer Podcast ist eigentlich egal, aber wie ist das aus."
    },
    {
      "end": 5723960,
      "speaker": "A",
      "start": 5720760,
      "text": "Dem Assoziativgedächtnis beantwortet oder sowas?"
    },
    {
      "end": 5730160,
      "speaker": "B",
      "start": 5724200,
      "text": "Wäre gut, wenn auch jeder von euch die beantwortet. Frage eins wäre von den drei was?"
    },
    {
      "end": 5734280,
      "speaker": "D",
      "start": 5730160,
      "text": "Wir müssen. Moment mal, wir müssen jede Frage, jeder beantwortet jede Frage."
    },
    {
      "end": 5739810,
      "speaker": "C",
      "start": 5734680,
      "text": "Merkt ihr genau das? Der kann einfach nicht mal machen, der muss sofort eine Gegenfrage stellen."
    },
    {
      "end": 5754450,
      "speaker": "B",
      "start": 5739810,
      "text": "Du kannst auch ganz normal darüber antworten, nur ja, dass man. Andi hat mich gerade daran erinnert, dass ich ja pro Stunde bezahlt werde und dass ich eigentlich was anderes machen müsste hier. Deswegen nur, dass wir hier."
    },
    {
      "end": 5759850,
      "speaker": "D",
      "start": 5754850,
      "text": "Ich verstehe es aber immer noch nicht. Du stellst eine Frage und wir antworten dann beide sofort hintereinander diese Frage."
    },
    {
      "end": 5768100,
      "speaker": "B",
      "start": 5759850,
      "text": "Nein, nein, nacheinander. Nacheinander. Jeder von euch kann antworten. Ich nehme. Ich nehme es zurück. Ich stelle euch einfach noch mal drei Fragen. Vergiss den ganzen Rest. Drei fragen."
    },
    {
      "end": 5776460,
      "speaker": "A",
      "start": 5768100,
      "text": "Ich finde es aber eigentlich tatsächlich gut, wenn sie schnell hintereinander, weil sonst ist die andere Person. Ja, oder wir wechseln halt bei der Antwort durch, sonst hat die andere Person länger zum überlegen."
    },
    {
      "end": 5781820,
      "speaker": "D",
      "start": 5776780,
      "text": "Das schaffen wir schon. Ich orientiere mich an Andi. Höchstens, dass ich das Gegenteil sage."
    },
    {
      "end": 5784460,
      "speaker": "C",
      "start": 5781820,
      "text": "Der Wolfgang startet immer, ich mache immer die zweite Antwort fertig."
    },
    {
      "end": 5785980,
      "speaker": "D",
      "start": 5784460,
      "text": "Danke, Andi. Da ist die Organisation."
    },
    {
      "end": 5786940,
      "speaker": "B",
      "start": 5785980,
      "text": "Also Frage eins."
    },
    {
      "end": 5788300,
      "speaker": "A",
      "start": 5787420,
      "text": "Es sind entweder oder."
    },
    {
      "end": 5790460,
      "speaker": "D",
      "start": 5788380,
      "text": "Sind es nur drei Fragen eigentlich? Oder sind es."
    },
    {
      "end": 5806540,
      "speaker": "B",
      "start": 5791020,
      "text": "Es sind drei. Wir haben fünf vorbereitet, aber wir gucken mal, wie weit wir kommen. Frage eins. Würdest du lieber für den Rest deines Lebens nur in Comic Sans programmieren oder jedes Mal Hallo Welt schreien, wenn dein Code kompiliert?"
    },
    {
      "end": 5808540,
      "speaker": "D",
      "start": 5806540,
      "text": "Comic Sans, hallo Welt."
    },
    {
      "end": 5812940,
      "speaker": "B",
      "start": 5810620,
      "text": "Deine Antwort, Andi, wäre, du würdest hallo Welt schreien."
    },
    {
      "end": 5815980,
      "speaker": "C",
      "start": 5812940,
      "text": "Jedes Mal. Auf jeden Fall. Comic Sans Augenkrebs."
    },
    {
      "end": 5822030,
      "speaker": "B",
      "start": 5817500,
      "text": "Andi würde einfach wirklich die Entscheidung treffen im Homeoffice. Scheißegal."
    },
    {
      "end": 5829270,
      "speaker": "D",
      "start": 5823150,
      "text": "Wir haben übrigens eine Episode zu font Engineering, da haben wir auch drüber gesprochen und dass Comic Sans gar nicht so schlecht ist."
    },
    {
      "end": 5833310,
      "speaker": "C",
      "start": 5829270,
      "text": "Oder ich nehme eine Skriptsprache, die gar nicht kompiliert, nur."
    },
    {
      "end": 5833870,
      "speaker": "D",
      "start": 5833310,
      "text": "Ja, okay."
    },
    {
      "end": 5840910,
      "speaker": "B",
      "start": 5833870,
      "text": "Also systemgedribbelt. Ich muss auch sagen, aber Comic Sans ist eigentlich. So schlimm habe ich es gar nicht in Erinnerung, dass es so schlimm aussieht."
    },
    {
      "end": 5843030,
      "speaker": "C",
      "start": 5841070,
      "text": "Ich bekomme ab und zu Screenshots von anderen Leuten."
    },
    {
      "end": 5843470,
      "speaker": "D",
      "start": 5843030,
      "text": "WhatsApp."
    },
    {
      "end": 5844910,
      "speaker": "C",
      "start": 5843470,
      "text": "Die haben WhatsApp in Comic Sans?"
    },
    {
      "end": 5848750,
      "speaker": "B",
      "start": 5844910,
      "text": "Ja, ich habe das auf Samsung Geräten, habe ich das mal gesehen. Da kann man das irgendwie einstellen."
    },
    {
      "end": 5851670,
      "speaker": "A",
      "start": 5849030,
      "text": "Komplette Systemschrift auf Comic Sans ändern. Das ist halt echt heftig."
    },
    {
      "end": 5863630,
      "speaker": "D",
      "start": 5851670,
      "text": "Es ist unglaublich. Es kommt irgendwie so eine dumme Fontfrage und alle haben sofort irgendeinen Senf, den sie dazugeben können und ewig lang über so eine Schriftart diskutieren. Schnell soll das gehen, meine Herren, bitte, Thomas."
    },
    {
      "end": 5864470,
      "speaker": "B",
      "start": 5863630,
      "text": "Frage Nummer zwei."
    },
    {
      "end": 5874710,
      "speaker": "A",
      "start": 5864470,
      "text": "Frage Nummer zwei. Nie wieder Meetings haben, aber alle Entscheidungen werden ohne dich getroffen. Oder den ganzen Tag nur Meetings, aber du bestimmst alles. Tick tack, schnelle Antwort."
    },
    {
      "end": 5877750,
      "speaker": "D",
      "start": 5875830,
      "text": "Was war das erste?"
    },
    {
      "end": 5887290,
      "speaker": "A",
      "start": 5878070,
      "text": "Das erste nie wieder Meetings. Nie wieder Meetings, aber alle Entscheidungen werden ohne dich getroffen. Und das zweite war, den ganzen Tag nur Meetings, aber du bestimmst alle."
    },
    {
      "end": 5888770,
      "speaker": "D",
      "start": 5887290,
      "text": "Also ja, das erste."
    },
    {
      "end": 5891330,
      "speaker": "A",
      "start": 5889010,
      "text": "Also nie wieder Meetings, aber alles wird ohne dich getroffen."
    },
    {
      "end": 5897410,
      "speaker": "D",
      "start": 5891330,
      "text": "Genau, am liebsten wäre man natürlich Meetings mit mir und trotzdem bestimmen andere. Aber am besten."
    },
    {
      "end": 5900770,
      "speaker": "A",
      "start": 5898690,
      "text": "Also du würdest sogar die Meetings mitnehmen."
    },
    {
      "end": 5902210,
      "speaker": "B",
      "start": 5900850,
      "text": "Damit du nicht arbeiten musst."
    },
    {
      "end": 5915180,
      "speaker": "D",
      "start": 5904850,
      "text": "Das war lange Zeit mein Leben, dass ich immer nur Meetings. Ich bin den ganzen Tag nur in Meetings gesessen, aber trotzdem, trotzdem meistens andere entschieden. Das war halt immer Teamwork. Aber jetzt sind wir schon wieder tief im Thema drin. Andi, eine Antwort."
    },
    {
      "end": 5915940,
      "speaker": "C",
      "start": 5915180,
      "text": "Nie wieder Meetings."
    },
    {
      "end": 5916780,
      "speaker": "B",
      "start": 5915940,
      "text": "Okay, ist interessant."
    },
    {
      "end": 5917660,
      "speaker": "A",
      "start": 5917180,
      "text": "Krass."
    },
    {
      "end": 5929020,
      "speaker": "B",
      "start": 5917660,
      "text": "Ich glaube, man kriegt wahrscheinlich würde man mehr hinkriegen, wenn man einfach in jedem Meeting entscheiden kann, oder? Aber ist natürlich auch eine einsame Geschichte, wenn man immer derjenige ist, der am Ende entscheiden muss, egal was passiert."
    },
    {
      "end": 5934180,
      "speaker": "D",
      "start": 5929340,
      "text": "Ja, vor allem bist du immer der Arsch, der entschieden hat und dann immer alle gegen dich sind und so weiter im Team."
    },
    {
      "end": 5948100,
      "speaker": "C",
      "start": 5934180,
      "text": "Also kannst du ja, also ich gehe auch davon aus, dass nicht in jedem Meeting was entschieden wird, aber dass immer, wenn was entschieden wird, du der Entscheider bist. Und das bedeutet immer noch, du hast diesen kompletten Meeting Waste, hast du trotzdem am Arsch. Und der ist halt echt hoch. Also da kannst du."
    },
    {
      "end": 5950300,
      "speaker": "D",
      "start": 5948100,
      "text": "Wir haben zu praktisch über diese Frage nachgedacht."
    },
    {
      "end": 5966910,
      "speaker": "B",
      "start": 5950300,
      "text": "Ich glaube, die haben jetzt hier noch die letzte Frage und die wäre? Nie wieder copy und paste nutzen können oder alles, was du pastest, wird lang auf Twitter, Blue Sky, auf diesen ganzen Plattformen gepostet. Gilt auch für Passwörter."
    },
    {
      "end": 5969510,
      "speaker": "A",
      "start": 5967710,
      "text": "Eben, das hättest du nicht sagen dürfen."
    },
    {
      "end": 5981150,
      "speaker": "D",
      "start": 5969510,
      "text": "Ja, ich würde sagen, nie wieder copy and paste. Wie ist das im Linux? Da habe ich ja dieses paste automatisch auf der Mittelmaustaste. Copy and paste zählt es auch dazu."
    },
    {
      "end": 5982910,
      "speaker": "A",
      "start": 5981790,
      "text": "Das ist auch ein copy."
    },
    {
      "end": 5987790,
      "speaker": "D",
      "start": 5983710,
      "text": "Alles was Clipboard ist, aber es ist ein eigenes Clipboard. Eindeutig kein Copy."
    },
    {
      "end": 5994140,
      "speaker": "C",
      "start": 5988500,
      "text": "Ja, ich glaube auch nie wieder Copy and paste. Erzähl mal eine Anekdote und zwar aus meiner Ausbildung. Da saß ein Kumpel neben dir, so."
    },
    {
      "end": 5996020,
      "speaker": "D",
      "start": 5994140,
      "text": "Viel zu schnell neben mir und wir."
    },
    {
      "end": 6004580,
      "speaker": "C",
      "start": 5996020,
      "text": "Haben irgendwas programmiert und dann guckt er mir über die Schulter und ich habe ein K kopiert. Hast du gerade einen Buchstaben kopiert? Und ich so, fuck."
    },
    {
      "end": 6008260,
      "speaker": "D",
      "start": 6004580,
      "text": "Ja, das du ja auch oft eigentlich."
    },
    {
      "end": 6027490,
      "speaker": "B",
      "start": 6008340,
      "text": "Ich kenne auch so Leute, ich habe auch so Kollegen, wo ich manchmal sehe, die suchen das dann in anderen. Die suchen es, also sie tippen den Anfang davon, um es in einem anderen Pfeil zu suchen, weil sie wissen, da steht es drin. Und dann kopieren sie das eine Wort, was vier Buchstaben mehr hat, gehen wieder zurück ins andere Pfeil und fügen das da ein. Beim Pair Programming werde ich da auch komplett verrückt."
    },
    {
      "end": 6036210,
      "speaker": "A",
      "start": 6027570,
      "text": "Aber ich finde es interessant, dass ihr beide eher darauf verzichtet, auf das komplette Feature, anstatt zu sagen, ich habe das Feature und ich muss darüber nachdenken, was ich kopiere."
    },
    {
      "end": 6037410,
      "speaker": "D",
      "start": 6036210,
      "text": "Ja, privacy first."
    },
    {
      "end": 6042130,
      "speaker": "C",
      "start": 6037810,
      "text": "Ja, das führt die ganze Sache irgendwie ad absurdum, finde ich, wenn ich darüber nachdenken muss, ob ich das jetzt verwende und nicht."
    },
    {
      "end": 6043080,
      "speaker": "D",
      "start": 6042130,
      "text": "Also das stimmt."
    },
    {
      "end": 6047200,
      "speaker": "B",
      "start": 6043080,
      "text": "Vor allem stell dir mal vor, du machst es halt aus versehen und dann hast du halt dein. Und vergisst es."
    },
    {
      "end": 6055240,
      "speaker": "A",
      "start": 6047200,
      "text": "Ja, und stell dir mal vor, du musst irgendwie, keine Ahnung, eine große Textmenge in ChatGPT werfen für ein Pro, darfst alles abtippen."
    },
    {
      "end": 6059480,
      "speaker": "D",
      "start": 6055800,
      "text": "Ihr habt schon kranke Hirne, dass ihr auf solche Fragen kommt, muss ich sagen."
    },
    {
      "end": 6061320,
      "speaker": "B",
      "start": 6059480,
      "text": "Ja, also ich glaube, war das wir."
    },
    {
      "end": 6062440,
      "speaker": "A",
      "start": 6061320,
      "text": "Oder war das auch die KI?"
    },
    {
      "end": 6064560,
      "speaker": "B",
      "start": 6063640,
      "text": "Es war eine Mischung."
    },
    {
      "end": 6065560,
      "speaker": "A",
      "start": 6064560,
      "text": "War eine Mischung, glaube ich."
    },
    {
      "end": 6091580,
      "speaker": "B",
      "start": 6065720,
      "text": "Man muss dazu sagen, ich bin mir sicher, dass es da draußen ein Problem Projekt gibt, was gewipecodet wurde, was aus versehen das eh schon macht. Irgendein Wipecoder da draußen hat das entwickelt, ganz aus Versehen, alles, was er kopiert. Wie viele AP Keys mittlerweile auf GitHub aufgetaucht sind, seitdem dieses Wipe Coding. Also davor ja auch schon, aber jetzt ist ja komplett durchgedreht. Da bin ich mir sicher, da gibt es auch ein paar von diesen Projekten, aber in diesem Sinne."
    },
    {
      "end": 6094680,
      "speaker": "D",
      "start": 6091580,
      "text": "Wobei du da eh eine Warning bekommst. Jetzt will ich schon die anderen zwei fragen."
    },
    {
      "end": 6102550,
      "speaker": "B",
      "start": 6095390,
      "text": "Wir können auch die anderen. Das eine dabei, da müsst ihr bestimmt auch kurz überlegen. Falls nicht, mache ich mir Sorgen. Aber wir probieren es jetzt ganz schnell."
    },
    {
      "end": 6106950,
      "speaker": "D",
      "start": 6102550,
      "text": "Jetzt sind wir eh schon so lange dran, jetzt ist auch schon egal, falls uns noch irgendwer zuhört."
    },
    {
      "end": 6111870,
      "speaker": "A",
      "start": 6106950,
      "text": "Also bei der müsstet ihr. Wollen wir, wollen wir es mit Kino oder so wie es da steht?"
    },
    {
      "end": 6113030,
      "speaker": "B",
      "start": 6111950,
      "text": "Auf jeden Fall so wie es da steht."
    },
    {
      "end": 6122360,
      "speaker": "A",
      "start": 6113030,
      "text": "So wie es da steht, okay. Wir haben lange diskutiert, ob Kino oder so wie es da steht. Da müsstet ihr wahrscheinlich ein bisschen überlegen, wenn eure Karriere ein Pornofilm wird, wie würde er heißen?"
    },
    {
      "end": 6128200,
      "speaker": "B",
      "start": 6125800,
      "text": "Letztens sind wir richtig still. Ansonsten ist."
    },
    {
      "end": 6132840,
      "speaker": "A",
      "start": 6130360,
      "text": "Im Kopf die Bibliothek der ganzen Pornos durch."
    },
    {
      "end": 6137400,
      "speaker": "B",
      "start": 6133240,
      "text": "Soll's witzig sein, aber dann passt es ja nicht zu meinem Leben."
    },
    {
      "end": 6155760,
      "speaker": "D",
      "start": 6137720,
      "text": "Es ist ja witzig, dass ihr jetzt noch Bono ins Spiel bringt, weil ich wollte es ja zuerst nicht sagen, aber von meinem Anführungszeichen Mentor, wo ich das erste mal gelernt habe, wie man so Webseiten baut mit Frontpage, der hat ja eigentlich so eine Webseite, die Bono CDs verkauft hatte und der die dann so versendet bei Post, weil das Internet damals zu langsam war, dass man das über Internet alles."
    },
    {
      "end": 6161200,
      "speaker": "A",
      "start": 6155840,
      "text": "Also Netflix für so wie Netflix früher, die waren doch, glaube ich, auch erstmal nur ein Video und DVD."
    },
    {
      "end": 6169040,
      "speaker": "C",
      "start": 6163680,
      "text": "Ich muss zugeben, ich habe keine Ahnung, ich müsste jetzt auch googeln, die besten Pornotitel oder so."
    },
    {
      "end": 6175220,
      "speaker": "A",
      "start": 6169280,
      "text": "Oder man lässt sich einfach selbst was einfallen. Irgendeine Redewendung, die sich auf beides münzen lässt."
    },
    {
      "end": 6180740,
      "speaker": "D",
      "start": 6175300,
      "text": "Aber ich würde sagen, klassische österreichische Floskel. Es geht sich aus."
    },
    {
      "end": 6183300,
      "speaker": "C",
      "start": 6181940,
      "text": "Es geht sich aus."
    },
    {
      "end": 6188260,
      "speaker": "D",
      "start": 6186100,
      "text": "Das verstehen jetzt aber nur die Österreicher, glaube ich."
    },
    {
      "end": 6190500,
      "speaker": "C",
      "start": 6188260,
      "text": "Aber ich glaube, das können Ausserstehende besser beantworten."
    },
    {
      "end": 6194780,
      "speaker": "B",
      "start": 6190660,
      "text": "Christian, du kannst sowas gut beim Andi. Nach dieser Episode würde ich sowas sagen."
    },
    {
      "end": 6197620,
      "speaker": "D",
      "start": 6194780,
      "text": "Wie auf dem Trecker geht's rund."
    },
    {
      "end": 6207050,
      "speaker": "B",
      "start": 6197620,
      "text": "Genau, ich würde auch eigentlich sowas sagen, ich wäre lieber auf dem Trecker. Da habe ich jetzt auch dran gedacht, tatsächlich."
    },
    {
      "end": 6208410,
      "speaker": "D",
      "start": 6207210,
      "text": "Landwirtschaftsbauer."
    },
    {
      "end": 6211610,
      "speaker": "B",
      "start": 6209850,
      "text": "Der Bauer packt aus."
    },
    {
      "end": 6216570,
      "speaker": "C",
      "start": 6214890,
      "text": "Mit dem Gehänge durchs Feld."
    },
    {
      "end": 6217770,
      "speaker": "A",
      "start": 6217290,
      "text": "Genau."
    },
    {
      "end": 6221450,
      "speaker": "B",
      "start": 6219290,
      "text": "Und die letzte Frage, also diese Frage."
    },
    {
      "end": 6224010,
      "speaker": "D",
      "start": 6222010,
      "text": "Kann auch nur kommen, wenn vier Männer in."
    },
    {
      "end": 6228350,
      "speaker": "B",
      "start": 6224970,
      "text": "Deswegen hatten wir auch gedacht, muss das wirklich sein? Aber es musste dann doch sein."
    },
    {
      "end": 6229310,
      "speaker": "A",
      "start": 6228510,
      "text": "Ich hatte gesagt."
    },
    {
      "end": 6234190,
      "speaker": "B",
      "start": 6231470,
      "text": "Thomas, möchtest du noch die letzte Frage, die wir vorbereitet hatten?"
    },
    {
      "end": 6243230,
      "speaker": "A",
      "start": 6234190,
      "text": "Ach, die auch noch? Okay, gut, die ist wieder leichter zu beantworten. Nie wieder Git nutzen oder mit jedem Enter automatisch einen Git Commit erzeugen."
    },
    {
      "end": 6248230,
      "speaker": "D",
      "start": 6243230,
      "text": "Mit jedem Enter ein Commit erzeugen würde ich mitgehen. So wie beat the levers oder fast."
    },
    {
      "end": 6253610,
      "speaker": "B",
      "start": 6248230,
      "text": "Bis er macht es mit Command Enter. Ich glaube, bei jedem Enter hast du."
    },
    {
      "end": 6254530,
      "speaker": "A",
      "start": 6253610,
      "text": "Eine ganz schön lange History."
    },
    {
      "end": 6258970,
      "speaker": "B",
      "start": 6254530,
      "text": "Müsst euch mal vorstellen, ihr habt die Kombi, ihr dürft nichts mehr kopieren. Das heißt, ihr könnt Enter auch nicht kopieren."
    },
    {
      "end": 6267930,
      "speaker": "A",
      "start": 6263130,
      "text": "Dann wird es schwierig. Ohne Git ist echt, ich glaube, einfach Genickbruch."
    },
    {
      "end": 6290660,
      "speaker": "B",
      "start": 6268010,
      "text": "Aber in diesem Sinne wollen Thomas und ich jetzt mal ganz herzlich bei euch bedanken, dass ihr so ehrlich die Fragen beantwortet habt. Wir kennen euch ja so auch ein bisschen außerhalb vom Podcast und es war natürlich eine Ehre, euch überhaupt da kennenlernen zu dürfen. Und zum anderen habe ich auch das Gefühl, ich habe noch mehr über euch gelernt. Und wir hoffen, dass wir bei Folge ein Tausend können wir das ja vielleicht wieder machen."
    },
    {
      "end": 6312510,
      "speaker": "A",
      "start": 6290820,
      "text": "Genau, wir hoffen, dass die ganzen persönlichen Fragen und eure ehrlichen Antworten natürlich auch unterhaltsam für eure Zuhörer und Zuhörerinnen waren. Und auch ich sag noch mal danke, dass wir hier Host sein durften für die Folge zwei hundert. Und natürlich schön weiterhin einschalten. Und wenn ihr in Folge zwei hundert das erste mal reinhört, natürlich direkt abonnieren und bei uns könnt ihr gerne auch mal vorbeigucken."
    },
    {
      "end": 6334350,
      "speaker": "D",
      "start": 6312510,
      "text": "Genau. Also vielen Dank auch dafür, dass ihr mal Host wart. Vielen Dank auch für Index out of bounds. Höre ich selber auch immer sehr gerne. Keine Ahnung, ob wir das geschafft haben, was ihr ursprünglich wolltet, euer Ziel, weil ihr hattet ja gemeint, irgendwie, wir sagen nie was. Über Privates und wir werden euch jetzt private Fragen stellen und allen mehr private Details zukommen lassen. Also ich hoffe, wir haben das in irgendeiner Form geschafft."
    },
    {
      "end": 6335150,
      "speaker": "A",
      "start": 6334350,
      "text": "Ich denke schon."
    },
    {
      "end": 6356140,
      "speaker": "C",
      "start": 6335230,
      "text": "Also ich muss auch mal dickes Dankeschön sagen, auch für eure Vorbereitung. A die Fragerunde, b die diese gewipecodete Bingo App. Ganz großes Tennis. Vielen lieben Dank, dass ihr euch auch die Zeit genommen habt und diesen Abend hier mit uns verbringt. Denn der Christian wird nach Stunde bezahlt, wie ich gelernt habe und hätte jetzt auch Geld verdienen können. Also vielen Dank für."
    },
    {
      "end": 6358380,
      "speaker": "D",
      "start": 6356460,
      "text": "Weißt du, ob wir nicht eine Rechnung bekommen?"
    },
    {
      "end": 6397670,
      "speaker": "C",
      "start": 6359500,
      "text": "Also wir nehmen die ganze Thematik hier nicht als selbstverständlich hin. Und ich finde es wirklich, wirklich faszinierend, was dieses Internet aus einem machen kann. Denn ich hatte es ja während der Podcast Episode schon erwähnt, wir kennen uns ja eigentlich gar nicht. Wir haben uns durchs Podcast kennengelernt und jetzt unterhalten wir uns teilweise über Witze und allem drum und dran. So als hätten wir gestern auf dem Schützenfest noch ein Bier getrunken. Also das Internet ist schon total wild. Also an alle Hörerinnen und Hörer vom Engineering kiosk, wenn ihr Fans vom Engineering seid, dann hört doch mal beim Index Out of Bounds Entwickler und developer Podcast rein. Dann kriegt ihr so einen Schwachsinn hier gefühlt alle zwei Wochen. Denn irgendwie immer wenn ich."
    },
    {
      "end": 6407270,
      "speaker": "D",
      "start": 6402230,
      "text": "Die zwei wundervollen. Jetzt hast du so gut angefangen, Andi. Und so stark."
    },
    {
      "end": 6432270,
      "speaker": "C",
      "start": 6407510,
      "text": "Ich bin ehrlich, immer wenn ich eine Episode von denen auf meine Ohren setze, ich muss echt oft stark lachen wegen diesen Flachwitzen, wegen eurer Werbung. Carglass referiert K oder was ihr da habt. Ich muss immer so hart lachen. Also vielen lieben Dank für den Content, den auch ihr erstellt. Vielen lieben Dank, dass ihr die Zeit genommen habt und die Vorbereitung für diese Podcast Episode und uns eine tolle Episode zwei hundert beschert."
    },
    {
      "end": 6436530,
      "speaker": "D",
      "start": 6432270,
      "text": "Und wir haben, glaube ich, auch den Rekord gebracht. Es wird wahrscheinlich die längste Episode, was."
    },
    {
      "end": 6438050,
      "speaker": "C",
      "start": 6436530,
      "text": "Wolfgang Ai draus macht."
    },
    {
      "end": 6444130,
      "speaker": "B",
      "start": 6438610,
      "text": "Ihr habt ja bald eure Ask me anything Folge, dann können die Leute auch Folgefragen stellen, falls da heute was Neues aufgekommen ist."
    },
    {
      "end": 6445410,
      "speaker": "D",
      "start": 6444690,
      "text": "Genau. Genau."
    },
    {
      "end": 6482180,
      "speaker": "C",
      "start": 6445410,
      "text": "Das Ask Me Anything Formular verlinken wir natürlich auch in den Shownotes, sowie auch diese grandiose Bingo App. Und falls ihr noch mehr Fragen habt, falls ihr auch mal Fragen an Christian und Thomas vom Index out of Bounds habt, stellt uns die in unserer Discord Community. Vielleicht kriegen wir die beiden ja irgendwann mal ebenfalls zu einer privaten Folge überredet, wo wir mal einen Rollenwechsel machen, wo Wolfgang und ich die ganze Sache mal vorbereiten. Und dann holen wir natürlich auch die ganz dreckigen Fragen aus der Community mal raus. Aber Thomas, Christian, hat euch die Episode denn auch ein bisschen Spaß gemacht? Habt ihr das geschafft, was ihr euch vorgestellt habt? Das ist ja auch immer so eine Frage. Seid ihr eigentlich zufrieden?"
    },
    {
      "end": 6496430,
      "speaker": "A",
      "start": 6482340,
      "text": "Das stellt sich dann heraus, wenn Wolfgang die Folge geschnitten hat. Ich denke, im Großen und Ganzen konnten wir es so durchziehen, wie wir es."
    },
    {
      "end": 6498510,
      "speaker": "D",
      "start": 6497310,
      "text": "Im Großen und Ganzen."
    },
    {
      "end": 6510230,
      "speaker": "B",
      "start": 6498510,
      "text": "Also ich fand es super, muss ich sagen, weil ich finde, gerade der Andi ist ja jemand, der gerne auch. Ich finde, dich kriegt man gar nicht so leicht ins Reden. Aber ich habe das Gefühl, heute haben wir es geschafft. Und da bin ich schon sehr stolz drauf."
    },
    {
      "end": 6514110,
      "speaker": "A",
      "start": 6510230,
      "text": "Das finde ich eine sehr interessante Aussage, dass du den Andi nicht ins Reden."
    },
    {
      "end": 6516670,
      "speaker": "D",
      "start": 6514190,
      "text": "Du bekommst Andi nicht zum Reden. Hallo."
    },
    {
      "end": 6532820,
      "speaker": "B",
      "start": 6517220,
      "text": "Ich meine so in dieses, dass die Zuhörerinnen werden es verstehen. Ich meine nicht so sachbezogen, sondern auch mal so ein bisschen. Ja, weiß ich nicht. Ich fand es wirklich. Ich fand es einfach interessant, einfach auch mal ein bisschen persönliche Hintergründe zu hören."
    },
    {
      "end": 6541580,
      "speaker": "D",
      "start": 6533140,
      "text": "Du hast es eher geschafft, oder ihr habt es eher geschafft, dass Andi votlos mal war. Das ist die Seltenheit. Wobei die Pausen herausgeschnitten haben."
    },
    {
      "end": 6549230,
      "speaker": "B",
      "start": 6541580,
      "text": "Vielleicht auch das. Aber ich bin absolut zufrieden. Mir hat es mords spaß gemacht. Und ja, zumindest Thomas und mir hat es Spaß gemacht."
    },
    {
      "end": 6550830,
      "speaker": "A",
      "start": 6549870,
      "text": "Wir hatten Spaß."
    },
    {
      "end": 6559470,
      "speaker": "D",
      "start": 6551070,
      "text": "Vielen Dank. Es war echt super cool und hat wirklich viel Spaß gemacht. Ich glaube, es ist nicht nur die längste Episode, sondern auch die Episode, die wir am meisten gelacht habe. Eindeutig."
    },
    {
      "end": 6562910,
      "speaker": "B",
      "start": 6559470,
      "text": "Das freut uns. Dann moderieren wir jetzt ab und sagen Ciao, macht's gut."
    },
    {
      "end": 6563710,
      "speaker": "C",
      "start": 6562910,
      "text": "Danke. Ciao."
    },
    {
      "end": 6564830,
      "speaker": "D",
      "start": 6563710,
      "text": "Bye. Ciao."
    }
  ],
  "webhook_auth": false
}