{
  "acoustic_model": "assemblyai_default",
  "audio_duration": 4419,
  "audio_url": "https://cloud.inlupus.at/s/Ry9k5bRG7dQstjy/download",
  "auto_chapters": false,
  "auto_highlights": false,
  "auto_highlights_result": {},
  "confidence": 0.959599,
  "content_safety": false,
  "content_safety_labels": {
    "status": "unavailable"
  },
  "custom_topics": false,
  "disfluencies": false,
  "dual_channel": false,
  "entity_detection": true,
  "filter_profanity": false,
  "format_text": false,
  "iab_categories": true,
  "iab_categories_result": {},
  "id": "310cc120-20a0-4759-b6bf-e00f08c3c642",
  "language_code": "de",
  "language_detection": false,
  "language_model": "assemblyai_default",
  "punctuate": true,
  "redact_pii": false,
  "redact_pii_audio": false,
  "sentiment_analysis": false,
  "speaker_labels": true,
  "speakers_expected": 3,
  "speed_boost": false,
  "status": "completed",
  "summarization": false,
  "throttled": false,
  "utterances": [
    {
      "end": 221350,
      "speaker": "A",
      "start": 3040,
      "text": "Die Fähigkeit zu programmieren ist ja schon so eine Art Superpower. Du kannst dem Computer sagen, was er zu tun haben soll. Du kannst dir jede App schreiben, die du möchtest, für egal welches Problem du auch immer hast. Wenn man das Ganze weiterdenkt, komme ich oft zu dem wäre es nicht richtig cool, wenn ich selbst etwas entwickle, dies durch ein Software as a Service Model vertreibe und damit so viel Einkommen generiere, dass ich dies in meiner Vollzeitbeschäftigung machen kann? Dass ich also täglich genau an dem arbeite, was mich wirklich motiviert und begeistert. Und wäre es nicht super cool, wenn ich dies aus eigenen Mitteln ohne externe Finanzierung schaffe? Sowas nennt man Indie Bootstrapping bzw. Indie App Development. Und wenn man diese Reise dann auch noch mit der Außenwelt teilt, kommt noch der Begriff built in public dazu. Wenn man die Reise beginnt, merkt man aber recht schnell, dass dies leichter gesagt als getan ist. Das ist super hart. Sebastian Röhl hingegen hat es geschafft. Insgesamt hat er drei mobile Apps entwickelt, woraus sich eine als Erfolgsfaktor herauskristallisiert hat. Mit einer App, um neue Gewohnheiten zu tracken, hat er den soeben beschriebenen Traum wahr gemacht. Wir haben mit Sebastian über seine persönliche Story gesprochen, über seine Up and Downs, wie er seinen Software Dev Job gekündigt hat, es versucht hat, mit seiner Idee selbstständig zu werden, später aber wieder in eine Anstellung musste, wie er auf seine App Ideen kommt, wie er neue Kunden und Benutzer akquiriert, warum App Store Optimization sein Weg zum Marketing ist, über monatliches versus Lifetime Pricing, aber auch, warum er built in public lebt und seine Reise mit der Außenwelt teilt, jedoch seine aktuellen monatlichen Umsätze nicht mehr preisgibt. Eine Geschichte, wie sie persönlicher nicht sein kann. Viel Spaß bei diesem Interview. Los geht's. Vor kurzem hat der Wolfgang eine Episode gepitcht, und zwar war das Episode ein hundert neun und neunzig. Da ging es um seinen side Projects und da kam er mit der großen Aussage Coden ist leicht, Sales ist schwer, Business ist der Endgegner. Und diese ganze Episode hat darüber gehandelt, dass Wolfgang Seitenprojekte aufgezogen hat und immer gegen die Wand gefahren ist bzw. Versucht, den Traum jeder Entwicklerin und jedes Entwicklers zu leben, nämlich mit einem SaaS Business oder mit einem Seitenbusiness passives Einkommen zu generieren bzw. Zeit für Einkommen zu entkoppeln. Und da hat er ziemlich viel über seine Learnings gesprochen, teilweise wie er von einer Selbstständigen aus ihrem Laden vertrieben wurde, weil er da etwas verkaufen wollte. Sozusagen der, ich würde mal sagen, cold call in der Realität. Naja, war eine lustige Folge. Auf jeden Fall habe ich mir dann mal gedacht, hey, jetzt habe ich diese eine Meinung gehört vom Wolfgang. Und wer Wolfgang kennt, der weiß, nimmt man die Meinung ernst oder nicht, man weiß es nicht. Schauen wir mal. Aber jetzt habe ich mir gedacht, dann machen wir daraus mal so eine kleine Serie und holen uns mal eine andere Meinung. Da habe ich mich dann an einen Podcast vom Oktober zwei tausend drei und zwanzig erinnert. Und zwar habe ich damals eine Folge im Happy Bootstrapping Podcast gehört. Grüße gehen raus an die leer, wo jemand von null auf fünf tausend Dollar gestiegen ist. Monthly Recovery Revenue. Also jemand, der mit einem Seitenbusiness es wirklich geschafft hat, Geld zu verdienen. Und das alles mit einer Habit Tracking App. Und dann habe ich mir gedacht, Hä, wie geht denn das denn? Für mich ist irgendwie so Habit Tracking App so die neue to Do App, so nach dem Motto in jedem To Do. Die habe ich mir dann angehört und ich war so geflasht, da habe ich gedacht, mit ihm muss ich mal sprechen. Und ihm in diesem Falle ist Sebastian Röhl. Und ich bin sehr, sehr froh, dass Sebastian heute bei uns im Podcast ist. Hallo Sebastian."
    },
    {
      "end": 224510,
      "speaker": "B",
      "start": 221350,
      "text": "Hi. Ja, danke für die Einladung. Freue mich auf jeden Fall hier zu sein."
    },
    {
      "end": 265090,
      "speaker": "A",
      "start": 224510,
      "text": "Ich habe dich ja gerade schon eingeleitet, dass du das wahrgemacht hast, wovon viele träumen. Ich träume zumindest auch davon. Zugegeben habe ich da noch nie wirklich super viel Arbeit reingesteckt, aber das ist natürlich, man denkt sich immer so, okay, ich bin jetzt Softwareentwickler und ich kann ja programmieren und das ist ja, worauf alle Leute warten. Deswegen programmiere ich mal kurz an einem Wochenende was schießt das online, kriege ganz viel Kunden, entkoppel dann Zeit von Geld und du hast es geschafft. Jetzt lobe ich dich so in den Himmel hier, deswegen stellen wir dich mal ganz kurz vor. Kommen wir mal zurück zu den Tatsachen. Sebastian Röhl, du wohnst im schönen Moers am Niederrhein. Am unteren Niederrhein, habe ich jetzt gelernt. Ich wusste, dass."
    },
    {
      "end": 270500,
      "speaker": "C",
      "start": 265090,
      "text": "Moment, das ist jetzt kein Ruhrgebiet, oder? Das ist außerhalb von Bo. Es ist eine schöne Gegend, direkt daneben."
    },
    {
      "end": 282420,
      "speaker": "A",
      "start": 270820,
      "text": "Genau, das ist außerhalb vom Pott. Moers ist noch so nah am Pott. Mich würde nicht wundern, wenn die noch schön die Stahlindustrie noch mitbekommen, so nach dem Motto. Zumindest die Abdämpfe und Co. Deswegen, also so nah ist das schon."
    },
    {
      "end": 284340,
      "speaker": "C",
      "start": 282420,
      "text": "Aber das ist gleich neben Wesel, oder?"
    },
    {
      "end": 287660,
      "speaker": "B",
      "start": 284900,
      "text": "Ja, Unterwesel, wenn ich mich recht erinnere."
    },
    {
      "end": 294180,
      "speaker": "C",
      "start": 287660,
      "text": "Genau, ist eine schöne Gegend. Da wird der Zug immer abgekoppelt, wenn man nach Holland fährt. Also da habe ich viel Zeit verbracht."
    },
    {
      "end": 296780,
      "speaker": "B",
      "start": 294180,
      "text": "Also Wesel ist auf jeden Fall schöner als Moers, würde ich sagen."
    },
    {
      "end": 305020,
      "speaker": "A",
      "start": 296780,
      "text": "Aber und was mich jetzt besonders freut, du hast einen Master of Science in Computer Software Engineering an der Uni Duisburg Essen. Hast du dann in Duisburg oder in Essen studiert?"
    },
    {
      "end": 309700,
      "speaker": "B",
      "start": 305100,
      "text": "Ich habe in Essen studiert, am Campus Essen. Also in Duisburg war ich nie verflixt."
    },
    {
      "end": 362260,
      "speaker": "A",
      "start": 309700,
      "text": "Naja, schade. Sonst hätte ich gesagt wunderschön. Naja, du warst vier Jahre als Software Engineer angestellt, bist inzwischen als unabhängiger App Developer unterwegs in total. Laut meinen Recherchen hattest du drei Apps oder hast noch drei Apps, da werden wir gleich mal drüber sprechen. Win Diary, the coolest way to track your wins and achieve achievements. Dann live ein Workout Tracker und die Haupt App Habit Kit, ein Habit Tracker, ein Gewohnheits Tracker. Du bist aktives Mitglied der Built in Public Community. Was das ist, klären wir im Laufe des Podcast auch noch. Und du blogst sehr viel bzw. Hast einen Newsletter. Also du blogst auf der newsletter Plattform Substack unter anderem mit deinem Weekly Indolog schon seit sieben und sechzig Wochen, soweit ich das gesehen habe. Und das ist natürlich eine Hausnummer. Habe ich was vergessen und ist das alles korrekt?"
    },
    {
      "end": 363540,
      "speaker": "B",
      "start": 362580,
      "text": "Das war alles korrekt."
    },
    {
      "end": 398880,
      "speaker": "C",
      "start": 363860,
      "text": "Du hast ja vier Jahre als Developer gearbeitet, quasi in so einer On Off Beziehung. Da werden wir gleich noch vielleicht drauf eingehen. Aber meine Frage wäre initial, wie du dir überlegt hast, okay, du hörst jetzt einfach ein Jahr arbeiten auf und startest eine App. Was war denn da der Hauptgrund? Es gibt sicher viele Gründe und man überlegt sich das ja gut, aber was war denn so der Haupttrigger, der dich dazu gebracht hat, irgendwie dann den Schritt zu machen, die größte Motivation bei dir gebracht hat, kündige jetzt wirklich und steig einfach in so einen komplette neue Welt ein. Es war ja so zu Corona, ich weiß nicht, ob es Corona war oder ob da ein anderer Grund mitgespielt hat."
    },
    {
      "end": 445710,
      "speaker": "B",
      "start": 399040,
      "text": "Das hatte zwei Gründe. Hauptsächlich erstmal der grundlegende Gedanke, mich irgendwann mal selbstständig zu machen. Der ist mir schon zum Ende hin meines Studiums gekommen. Da bin ich nämlich auf die Indie Hacker Community gestoßen. Also früher gab es oder gibt es wahrscheinlich immer noch eine Webseite namens indiehackers com. Die hatten auch einen relativ bekannten und populären Podcast und darauf bin ich gestoßen. Und bei dem Podcast waren dann auch immer Gäste, also relativ bekannte Indie Hacker, die halt erzählt haben, wie die ihr eigenes Business aufgebaut haben, alleine im stillen Kämmerlein und davon leben konnten. Und das fand ich schon damals zum Ende hin meines Studiums super interessant und es hat mich echt fasziniert."
    },
    {
      "end": 455410,
      "speaker": "C",
      "start": 446270,
      "text": "Aber was hat dich da fasziniert? Dass sie Geld verdienen, dass sie selbstständig sind, dass sie irgendwas cooles machen, was Leute verwenden. Dann, was hat dich da am meisten getriggert?"
    },
    {
      "end": 542950,
      "speaker": "B",
      "start": 515730,
      "text": "Diese Kombination aus kompletter kreativer Freiheit, dass die sich einfach ein eigenes Produkt ausdenken und das dann alleine entwickeln. Niemand redet denen rein, gibt denen irgendwelche Deadlines. Die haben die volle kreative Kontrolle über den Scope des Projekts und wie die das gestalten wollen. Also diese und halt, dass sie davon leben können. Also diese super coole Freiheit einfach. Das hat mich am meisten fasziniert daran."
    },
    {
      "end": 544710,
      "speaker": "A",
      "start": 543110,
      "text": "Ist das denn in der Realität so?"
    },
    {
      "end": 564710,
      "speaker": "B",
      "start": 545110,
      "text": "Mit Sicherheit nicht für jeden Indie Hacker, aber bei mir ist es zum Beispiel so, also ich kann mir komplett aussuchen, was ich mache. Also ich arbeite nur an den Features, auf die ich Lust habe, an den Projekten, die mir gerade Spaß machen. Also bei mir ist es tatsächlich wirklich so, aber manche Leute haben es bestimmt auch schwerer oder strugglen mehr in dem Bereich."
    },
    {
      "end": 579760,
      "speaker": "A",
      "start": 565120,
      "text": "Kannst du, kannst du mir mal einen Dreisatz Pitch geben, wie du Indie Hacking definieren würdest? Ich meine, du hast gerade gesagt, wie sich das auslebt in der Realität, aber was ist in die Hacking? Warum brauchen wir dafür einen Term und was verbirgt sich dahinter?"
    },
    {
      "end": 605110,
      "speaker": "B",
      "start": 579760,
      "text": "Also ich weiß nicht, ob man wirklich diesen Term dafür braucht, aber auf jeden Fall stelle ich mir unter Indie Hacking einfach ein kleines Business vor. Also im besten Fall ist der Founder da dann alleine, hat keine Angestellten, er hat kein externes Funding, also sondern finanziert quasi das alles selbst. Das ist ja auch quasi der Begriff des Bootstrappings. Genau, so würde ich es halt definieren."
    },
    {
      "end": 621030,
      "speaker": "A",
      "start": 605270,
      "text": "Führ uns doch mal bitte ganz kurz durch deinen Werdegang. Ich hatte gerade gesagt, du hast einen Master gemacht und danach hast du eine Stelle als angestellter Softwareentwickler angenommen. Ist das korrekt? Und von da aus, wie ging es dann weiter?"
    },
    {
      "end": 758100,
      "speaker": "B",
      "start": 621350,
      "text": "Genau, ich habe ja gerade schon gesagt, zum Ende meines Studiums habe ich halt diese Community gesehen und das hat mich auch alles fasziniert. Aber ich hatte dann nicht wirklich den Mut zu sagen okay, ich weiche jetzt von dem normen Fall der Gesellschaft ab und versuche mal mich sofort nach dem Studium irgendwie selbstständig zu machen, sondern ich suche mir jetzt erst mal einen ganz normalen Job als Software Engineer. Ich hatte halt einfach nicht den Mut dazu, das zu machen. Deswegen habe ich mir den Job gesucht. Da habe ich dann auch drei Jahre lang voll gearbeitet, also von zwei tausend neunzehn bis zwei tausend zwei und zwanzig. Habe da auch super viel gelernt. Ich habe da relativ viel auch im Backend gemacht, Cloud Umgebung mit Microsoft Azure und ASP Net und sowas. Ich habe da auch super viel gelernt. Das war echt ein cooler Job. Die Leute waren alle cool. Ich bin auch immer noch befreundet mit einigen von denen. Ja, aber die kompletten drei Jahre war ich dort nur in einem Projekt. Wir haben da Auftragsarbeit gemacht für Kunden. Also generell bei Auftragsarbeit für Kunden, da hat man ja häufig wirklich sehr wenig kreative Kontrolle darüber, was genau man macht oder wie sich das Produkt, was man entwickelt, gestaltet. Und bei so langlebigen Projekten ist es ja auch häufig so, dass es dann nach einer Zeit halt langweilig wird. Also wenn man die technischen Grundlagen dann einmal geschaffen hat für den Anfang, dann ist es halt in den meisten Fällen nur noch Business Logik irgendwie durchimplementieren. Und ja, es wurde ein bisschen langweilig und ich hatte irgendwie die ganze Zeit noch diesen diesen Gedanken im Hinterkopf, mich irgendwann mal selbstständig zu machen. Ja, zu dem Zeitpunkt, genau, das war zwei tausend, zwei und zwanzig. Das war quasi so die letzten Ausläufer der Corona Pandemie. Alle waren irgendwie so ein bisschen burnt out und die ganze Zeit im Homeoffice und alles sei irgendwie langweilig. Und ich habe mir die ganze Zeit gedacht, so, ich würde gerne das mal probieren mit der Selbstständigkeit. Gerade weil ich auch zu dem Zeitpunkt oder ich bin immer noch relativ jung war. Ich hatte keine finanziellen Verpflichtungen, keine familiären Verpflichtungen. Ich musste jetzt irgendwie nicht einen Hauskredit abbezahlen oder ich hatte keine Kinder, um die ich mich kümmern muss oder die ich finanzieren muss. Das war halt einfach so der perfekte Zeitpunkt für mich, um diesen diesen Wunsch quasi noch mal in die Realität umzusetzen. Deswegen habe ich es dann einfach probiert."
    },
    {
      "end": 771220,
      "speaker": "C",
      "start": 758340,
      "text": "Weil du gesagt hast, es war so Ende Corona mit Homeoffice. Hast du Homeoffice gut gefunden oder nicht? Weil als Indie Hacker bist du dann sowieso eigentlich quasi immer im Homeoffice üblicherweise. Also war das für dich eine gute oder eine schlechte Zeit?"
    },
    {
      "end": 798810,
      "speaker": "B",
      "start": 771220,
      "text": "Ja, also am Anfang war es natürlich dann cool. Es war ja auch irgendwie ein bisschen was Neues. Dann war mal die ganze Zeit zu Hause und war auch cool. Aber nach ein paar Monaten oder Jahren vermisst man dann ja auch schon irgendwie mal irgendwie so die Mensch zu Mensch Interaktion mit seinen Kollegen. Und das Gleiche, so geht es mir jetzt auch. Also ich habe jetzt keine Kollegen mehr und die vermisse ich halt natürlich auch. Ein zweischneidiges Schwert."
    },
    {
      "end": 808010,
      "speaker": "C",
      "start": 798810,
      "text": "Okay, das wäre jetzt gleich meine nächste Frage gewesen, weil jetzt bist du als Indie Hacker genauso alleine. Okay, also du brauchst schon auch eine menschliche Connection irgendwo."
    },
    {
      "end": 809170,
      "speaker": "B",
      "start": 808010,
      "text": "Ja, ja, klar."
    },
    {
      "end": 824070,
      "speaker": "C",
      "start": 809170,
      "text": "Holst du dir die irgendwie anders jetzt, also von, hast du irgendwie, also der Tech Seite, ich schätze mal, du hast einen Freundeskreis, aber jetzt rein, wenn du von der Tech Seite mit irgendwem sprechen willst, hast du da irgendwie, gehst du mehr auf Meetups oder hast du irgendwie eine Community, um das auszugleichen?"
    },
    {
      "end": 840070,
      "speaker": "B",
      "start": 824230,
      "text": "Ne, das, also auf Meetups oder so gehe ich gar nicht. Also wenn ich irgendwelche technischen Fragen habe, dann chatte ich vielleicht irgendwie mit anderen Indie Hackern auf Ex oder sowas. Aber ne, also da fehlt mir auch wirklich ein bisschen der technische Austausch mit anderen Leuten."
    },
    {
      "end": 844280,
      "speaker": "C",
      "start": 841440,
      "text": "Also du gehst in Podcast, damit du mit Leuten sprechen kannst."
    },
    {
      "end": 844960,
      "speaker": "B",
      "start": 844280,
      "text": "Ja, genau."
    },
    {
      "end": 878380,
      "speaker": "A",
      "start": 845280,
      "text": "Ich wollte gerade auch sagen, also für die nächste Stunde können wir gerne deine sozialen Kontakte hier und Kollegen sein. Wir bieten es an. Jetzt hast du gerade gesagt Indie Hacking, Bootstrapping, das hört sich so an, okay, side Project, ich mache etwas neben meinem Angestelltenverhältnis. Wie ist da die ganze Sache entstanden mit deiner ersten App? Welche war das? Wann hast du die gestartet? Im Angestelltenverhältnis oder bis du sagst, okay, man geht jetzt aus dem Angestelltenverhältnis raus und dann starte ich erst ganz sequenziell die neue App. Wie ist das, wie hat das sich entwickelt?"
    },
    {
      "end": 952340,
      "speaker": "B",
      "start": 879100,
      "text": "Ich habe das schon häufiger, bevor ich gekündigt habe, ausprobiert in meiner Freizeit dann nach dem, nach der Arbeit, wenn ich acht Stunden programmiert habe, noch mal mich abends hinzusetzen und an eigenen Projekten rumzuprogrammieren. Das hat allerdings nie so ganz für mich funktioniert. Also ich habe da, ich hatte da irgendwie nicht den drive oder die Motivation, mich da durchzuquälen. Vielleicht lag das auch daran, dass ich bei meinem alten Job auch wirklich acht Stunden lang nur durch programmiert habe. Also da war wirklich auch nicht viel andere Tätigkeit in dem Bereich. Deswegen, also das hat mir, das fand ich super schwer, mich dazu dann abends dahin zu setzen und zu zwingen, noch an meinen eigenen Produkten zu arbeiten. Und deswegen habe ich dann den Entschluss gefasst, dass ich meinen Job komplett kündige und mir quasi selber eine Deadline setze von zwölf Monaten, wo ich quasi nur an meinen eigenen Projekten arbeiten möchte. Deswegen, also ich habe da nichts nebenbei gemacht. Ich habe das nicht als Zeitprojekt gestartet. Also ich habe meinen Job gekündigt. Im April zwei tausend zwei und zwanzig hat dann meine Selbstständigkeit begonnen und im Mai zwei tausend zwei und zwanzig ist dann meine erste App erschienen."
    },
    {
      "end": 961040,
      "speaker": "A",
      "start": 952340,
      "text": "Du hast gerade das Wort durchgequält erwähnt. Das bedeutet, du hattest dann nach der Arbeit, als du an deinen side Projects gearbeitet hast, auch wirklich keinen Spaß dran gehabt."
    },
    {
      "end": 1001260,
      "speaker": "B",
      "start": 961440,
      "text": "Ne, da hatte ich wirklich auch keinen Spaß ich bin generell eine Person, die. Also die Programmiertätigkeit selber bereitet mir persönlich keinen Spaß. Also was mir Spaß macht, ist mir eigene Produkte auszudenken, darüber zu sinieren, was eine coole UX sein könnte, was ein cooles UI sein könnte. Aber das Programmieren an sich selber macht mir keinen Spaß. Das ist dann quasi nur Mittel zum Zweck. Und ja, also der Anfang ist ja auch immer super programmierlastig. Man muss ja erstmal die erste Version quasi rausbringen. Und genau, ich musste mich da echt durchquälen am Anfang."
    },
    {
      "end": 1011180,
      "speaker": "A",
      "start": 1001340,
      "text": "Bedeutet das auch, dass dein Job dir eigentlich gar nicht so viel Spaß gemacht hat, wenn die technische Herausforderung der Programmierung da nicht dein Energietreiber ist?"
    },
    {
      "end": 1039799,
      "speaker": "B",
      "start": 1011340,
      "text": "Ja, könnte man so sagen. Also so richtig viel Spaß hatte ich nicht. Also es war natürlich cool, dann zusammen in einem Team zu arbeiten. Und es gab auch wieder immer mal Momente, wo man dann sich zusammen zusammengesetzt hat und irgendwelche spannenden Probleme gelöst hat, irgendwelche UI UX Probleme, sich eine neue Komponente für irgendwelche Auswahlmöglichkeiten oder so ausgedacht hat. Das hat mir natürlich immer Spaß gemacht, aber wenn es wirklich nur um das Programmieren ging, dann. Ne, so richtig Spaß kommt da bei mir nicht auf."
    },
    {
      "end": 1067260,
      "speaker": "C",
      "start": 1039800,
      "text": "Du hast ja zuerst kurz erwähnt, dass du schon was gelernt hast bei deinem Job. Und du hast ja auch erklärt, dass du dir so nach dem Studium gedacht hast, könnte eigentlich direkt damit anfangen. Du hast dich aber nicht getraut. Wenn du jetzt zurückblickst auf diese Zeit, war das sinnvoll? Würdest du es jetzt anders machen? Würdest du deinem ich von damals empfehlen, mach sofort die Apps, steig sofort ein? Oder würdest du sagen, diese Zeit hat dir auch irgendwas beigebracht, damit du dann die Apps besser entwickeln kannst?"
    },
    {
      "end": 1120040,
      "speaker": "B",
      "start": 1067500,
      "text": "Also technisches Know how für meine Apps habe ich tatsächlich in dem Job nicht so richtig gekriegt, weil wie gesagt, wir haben da wirklich nur so backend und Cloud Sachen gemacht oder im Web halt frontend Sachen. Aber ich habe ja mobile Apps geschrieben, da haben wir halt gar nichts gemacht dann in meinem alten Job. Aber ich würde, glaube ich, rückblickend würde ich trotzdem halt diesen Job noch mal anfangen, weil auch schon alleine das war halt einfach eine Erfahrung wert, zusammen in einem Team an einem Projekt zu arbeiten. Ich habe das erste Mal die Schnittstelle mit UI Designern und UX Spezialisten erfahren und da habe ich schon viel gelernt in der UI UX Geschichte, aber genau das technische Know how leider nicht. Aber ich würde es trotzdem machen, gerade weil ich da halt auch viele Freunde gefunden habe in dem Job."
    },
    {
      "end": 1126760,
      "speaker": "A",
      "start": 1120040,
      "text": "Jetzt hattest du erwähnt, du hast dir zwölf, Monate Zeit gegeben. Du hast gekündigt, zwölf Monate Zeit, all in. Was ist daraus geworden?"
    },
    {
      "end": 1183960,
      "speaker": "B",
      "start": 1126760,
      "text": "Ja genau, ich bin dann all in gegangen und habe dann mit Hochdruck an meiner ersten App gearbeitet und die habe ich dann auch relativ schnell in meinem freien Jahr rausgebracht in den App Store. Das war meine erste App Liftbear. Das ist quasi ein Workout Tracker, wo die Leute dann quasi ihre Gewichte und ihre Wiederholungen und ihre Exercises und Workouts verwalten können. Das war meine erste App und da habe ich dann auch ungefähr ein halbes Jahr lang dran gearbeitet. Also die erste Version relativ schnell rausgehauen, schon im Mai zwei tausend zwei und zwanzig, wenn ich mich recht erinnere, aber dann trotzdem noch, ich glaube fünf Monate weiter daran rum entwickelt, weil wenn man eine App einfach so ohne irgendwas, ohne irgendwie vorher eine Audience aufgebaut zu haben auf x oder sonst was, wenn man eine App dann released, dann ist es relativ unwahrscheinlich, dass die sofort erfolgreich wird. Und genauso war es."
    },
    {
      "end": 1190480,
      "speaker": "C",
      "start": 1183960,
      "text": "Haben doch alle Leute schon darauf gewartet oder reißen dir das dann aus den Händen. Genau, ja, zumindest denkt man immer so."
    },
    {
      "end": 1273930,
      "speaker": "B",
      "start": 1190640,
      "text": "So denkt man, aber so ist es halt wirklich nicht. Genau und dann war ich natürlich auch ein bisschen ein bisschen down und hab natürlich auch viel Selbstzweifel gehabt, ob es die richtige Entscheidung war, jetzt diese zwölf Monate hier meinen Job zu kündigen und sowas. Und ja, ich habe noch weiter an der App gebaut, habe versucht die irgendwie zu verbessern, so dass die vielleicht doch noch mal erfolgreich wird, aber das ist leider irgendwie nie so der Fall gewesen und deswegen habe ich mich dann im Herbst zwei tausend zwei und zwanzig dann quasi dazu entschieden, noch mal eine weitere App zu programmieren. Ich hatte halt schon immer diese Idee von dem Habit Tracker mit der Visualisierung von dem GitHub Contribution Graph mit dieser Heatmap, diesem Kalender quasi, die deine Anzahl der Contributions an einem Tag anzeigt und genau das wollte ich halt als Habit Tracker und dann habe ich Habit Kit relativ zügig auch implementiert und released. Die App war auf jeden Fall deutlich erfolgreicher direkt vom Anfang an. Ich glaube ich habe die im November zwei tausend zwei und zwanzig dann released und ich hatte direkt von Anfang an auch Leute, die die App gekauft haben und direkt Input geliefert haben, was die an neuen Features haben wollen und so. Also ich wusste da sofort, die App könnte erfolgreich werden. Es war natürlich jetzt kein Overnight Success, also ist jetzt nicht so, als wäre ich dann sofort reich geworden davon, aber man konnte wenigstens einen langsamen Grove sehen."
    },
    {
      "end": 1289950,
      "speaker": "A",
      "start": 1274090,
      "text": "Aber woran lag das? Hattest du in der Zeit dann dir eine Audienz auf Social Media aufgebaut? Oder liegt es daran, dass Leute vielleicht, dass das Gewohnheiten ein größeres Topic ist als Leute, die ins Fitnessstudio gehen? Oder woran lag das?"
    },
    {
      "end": 1361930,
      "speaker": "B",
      "start": 1290110,
      "text": "Mit Sicherheit eine Mischung. War auch bestimmt ein bisschen Glück. Also ich habe halt während ich liftbar entwickelt habe, auch danach immer wieder meine Reise quasi auf x oder früher Twitter quasi geteilt und dieses Bild in public quasi gemacht, sodass ich halt den aktuellen Entwicklungsstand immer gezeigt habe und was ich heute versucht habe, was ich heute gebaut habe und wie erfolgreich das war oder wie nicht erfolgreich. Das war auch, das habe ich die ganze Zeit gemacht und das habe ich dann natürlich auch bei der Entwicklung von Habit Kit weitergeführt. Als ich den ersten Screenshot von dem Habitkit UI gepostet habe, während ich es noch gerade entwickelt habe, da habe ich direkt gemerkt, da besteht ein größeres Interesse, weil dieser Post war für meine Verhältnisse damals super erfolgreich auf Twitter. Also ich habe da direkt irgendwie acht hundert Likes für gekriegt. Und vielleicht war es auch Glück, dass der twitter Algorithmus quasi diesen Post erwählt hat, um ihn irgendwie noch mehr Leuten in die Timeline zu spülen. Vielleicht war es halt auch einfach meine Konsistenz beim Teilen meiner Reise. Aber da wusste ich dann sofort, da gibt es ein größeres Interesse an der App."
    },
    {
      "end": 1364860,
      "speaker": "A",
      "start": 1362010,
      "text": "Wie viel, wie viel follower hattest du zu der Zeit circa?"
    },
    {
      "end": 1368260,
      "speaker": "B",
      "start": 1364860,
      "text": "Ich glaube, das müssten so um die acht hundert gewesen sein."
    },
    {
      "end": 1383540,
      "speaker": "A",
      "start": 1368980,
      "text": "Das ist aber noch gar nicht mal so viel. Also ist ja schon, was man schaffen kann. Okay, dann hattest du acht hundert Likes auf dem ersten Screenshot, dann hast du die App released und danach bist du an die Copacobana gefahren und hast dir einen Cocktail gekauft."
    },
    {
      "end": 1436450,
      "speaker": "B",
      "start": 1383860,
      "text": "Ja, ne, genau so war es leider nicht. War ja dann November, zwei tausend, zwei und zwanzig. Und das neigte sich dann schon dem Ende meines freien Jahres, nenne ich das ja ja immer zu. Also es war ein langsamer Growth da in Sachen Downloads und Umsatz. Aber davon konnte ich natürlich noch gar nicht leben. Also das waren dann irgendwie am Anfang, weiß nicht, der Launch Tag, der war noch mal besonders. Das waren dann irgendwie drei hundert Dollar Umsatz und dann ist es halt immer ein bisschen weiter gewachsen und dann war ich irgendwie vielleicht bei monthly recurring revenue. Ich habe die Zahlen gar nicht mehr so genau im Kopf, aber wie gesagt, davon kann man ja nicht leben, zumindest nicht in Deutschland. Und dann war meine zwölf Monate um und dann habe ich mich dazu entschieden, wieder zurück zu meinem alten Arbeitgeber zu gehen und da wieder zu arbeiten."
    },
    {
      "end": 1454290,
      "speaker": "C",
      "start": 1436770,
      "text": "Jetzt gerade zur Erklärung, wenn wir von Revenue sprechen, dann sprichst du wirklich von den Einnahmen in den App Stores, die dort angezeigt werden. Also da gehen noch mal dann die fünfzehn Prozent weg für die App Stores und dann ist es brutto, dann musst du Steuern zahlen, Versicherung und so weiter."
    },
    {
      "end": 1476310,
      "speaker": "B",
      "start": 1454290,
      "text": "Also genau, Apple und Google ziehen da ja fünfzehn Prozent erstmal ab davon und dann ziehen die auch noch die Umsatzsteuer ab, die die da ja in jedem einzelnen Land abführen müssen für die Verkäufe. Und dann kriegt man das Geld von denen überwiesen. Das ist dann natürlich brutto. Da muss man dann natürlich auch Einkommenssteuer drauf bezahlen und Gewerbesteuer, wenn man da die Beträge erreicht."
    },
    {
      "end": 1482880,
      "speaker": "A",
      "start": 1477270,
      "text": "Das bedeutet, wie viel kommen wirklich im Endeffekt bei den ein tausend Euro rum? Jetzt wirklich nicht so viel. Sechs hundert?"
    },
    {
      "end": 1485920,
      "speaker": "B",
      "start": 1482960,
      "text": "Ja, sowas um den Dreh. Sechs hundert, ja."
    },
    {
      "end": 1488480,
      "speaker": "C",
      "start": 1486160,
      "text": "Aber sechs hundert ist der Bruttobetrag."
    },
    {
      "end": 1489720,
      "speaker": "B",
      "start": 1488480,
      "text": "Sechs hundert brutto, genau."
    },
    {
      "end": 1495920,
      "speaker": "C",
      "start": 1489720,
      "text": "Genau, da kommen dann deine, was du noch Einkommensteuer zahlen musst und Versicherungen und so weiter und alles noch weg."
    },
    {
      "end": 1496560,
      "speaker": "B",
      "start": 1496000,
      "text": "Genau."
    },
    {
      "end": 1512510,
      "speaker": "A",
      "start": 1497600,
      "text": "Die beiden Apps Habitkit und Liftbeer, waren das Apps, die deine Probleme gelöst haben? Also bist du damals ins Fitnessstudio gegangen und hattest das Problem des Gewichtetrackings und hattest du das Problem, eine neue Gewohnheit einzubauen in dein Leben?"
    },
    {
      "end": 1624570,
      "speaker": "B",
      "start": 1512900,
      "text": "Genau, also die beiden Apps, die kamen wirklich aus meinem persönlichen Leben. Also alle meine Apps kommen irgendwie aus eigenen Needs, die ich erfahren habe in meinem Leben. Ich würde jetzt niemals irgendwie irgendein business to business SaaS bauen, wovon ich eigentlich, wo ich gar nicht in der Materie drinstecke oder in der Domäne. Also das wäre nicht so meins. Ich bin da mehr so der BC Entwickler, der seine eigenen Ideen oder seine eigenen Apps, die ja selber haben will, implementiert. Als ich mich dazu entschlossen hatte, meinen Job zu kündigen und was eigenes zu starten, da hatte ich noch gar keine coole Idee oder so, was ich eigentlich machen will. Also gar keine konkrete App Idee. Ich habe mir einfach gedacht, ich fange jetzt das erstbeste an zu implementieren, was mir so in den Sinn kommt und danach kommen schon irgendwelche Ideen oder danach mal gucken, was passiert. Genau, dann habe ich halt den Blick in mein Privatleben gewagt und mal geschaut, was sind so meine Hobbys. Und zu dem Zeitpunkt war ich auch relativ engaged, so mit Weightlifting und Fitness. Und dann habe ich gedacht, ich baue meinen eigenen Workout Tracker. Die Apps, die ich mir bisher so im App Store gedownloadet habe, die haben alle jetzt nicht so all meine Anforderungen erfüllt und deswegen baue ich einfach mal meine eigene Version davon. So ist Liftbär entstanden. Und bei Habit Kit ist auch eine ähnliche Story. Und zwar interessiere ich mich schon lange für Self Improvement und ich lese auch relativ viele Bücher, die sich mit Produktivität und Self Improvement beschäftigen. Und genau da wollte ich dann auch einfach mal meinen eigenen Habit Tracker implementieren, der dann diese explizit diese Visualisierung verwendet, die ich schon immer haben wollte für ein Habit Tracking. So sind die Ideen entstanden."
    },
    {
      "end": 1632970,
      "speaker": "C",
      "start": 1624650,
      "text": "Also das Klassische, was Entwickler innen immer haben, es passt einem nichts, was sonst im App Store so rumfliegt und man will es eigentlich selber besser machen."
    },
    {
      "end": 1651020,
      "speaker": "B",
      "start": 1633370,
      "text": "Genau, ich wollte auch gar nicht das Rad neu erfinden oder so. Also man muss ja auch nicht immer, also ist ja wirklich nicht originell, wie ein Workout Tracker und einen Habit Tracker zu basteln, aber muss es auch nicht. Also man kann auch mit den alten Sachen erfolgreich sein oder seinen eigenen Spin da noch mal einbauen."
    },
    {
      "end": 1687420,
      "speaker": "C",
      "start": 1651810,
      "text": "Jetzt klingt es schon so, als wärst du sehr strukturiert. Es geht immer um irgendwelche Tracker oder Optimierungen. Du hast auch erklärt, du hast dir das Ziel gesetzt, genau nur ein Jahr an den Apps zu arbeiten und hast es dann scheinbar auch so durchgezogen. War das wirklich so ein finanzieller Druck, dass du gesagt hast, okay, funktioniert nicht, es ist zu wenig revenue, ich muss jetzt wieder arbeiten beginnen. Oder war das einfach ich habe mir das Ziel gesetzt, habe es nicht geschafft, jetzt fange ich wieder arbeiten an, weil du hättest ja vielleicht auch noch zwei, drei Monate dranhängen können vermutlich mal. Also so viel Flexibilität hättest du ja vielleicht noch gehabt."
    },
    {
      "end": 1751180,
      "speaker": "B",
      "start": 1687420,
      "text": "Ja, das war auf jeden Fall kein finanzieller Need, jetzt nach den zwölf Monaten sofort wieder anzufangen zu arbeiten. Also ein paar Monate oder ein halbes Jahr bis Jahr hätte ich auf jeden Fall noch mit meinen mit meinen Ersparnissen quasi durchgehalten. Aber da war auch ein bisschen gesellschaftlicher Druck dahinter, finde ich. Also gerade zumindest in meinem Umfeld. Ich kenne jetzt in meinem persönlichen, aus meinem persönlichen Umfeld nicht so viele Unternehmer oder Selbstständige. Alle Leute, die ich kenne, sind eigentlich Angestellte. Die runzeln dann natürlich erstmal die Stirn, wenn man ich kündige jetzt einfach meinen Job und bastel mal zwölf Monate an eigenen Apps rum oder dann vielleicht finden die das ja sogar cool, aber man selber denkt sich immer, die finden das alle total dumm und schrecklich. Und genau das ist dann vielleicht so ein bisschen gesellschaftlicher Druck und halt auch Selbstzweifel natürlich. Deswegen wollte ich halt dieses Safety Net haben von diesen zwölf Monaten, dass ich dann einfach sage, ich versuche es jetzt einfach. Und wenn es nicht klappt, dann gehe ich wieder zurück."
    },
    {
      "end": 1767940,
      "speaker": "C",
      "start": 1751420,
      "text": "Wie war das im familiären Umfeld? Hast du irgendwie in der Familie Leute, die auch selbstständig sind? Weil gefühlt hat man da dann immer mehr Verständnis, aber wenn Leute das nie selber erlebt haben, ist die Selbstständigkeit immer ein tiefes schwarzes Loch, wo sich die Leute reinstürzen. Habe ich auch so oft das Gefühl."
    },
    {
      "end": 1775490,
      "speaker": "B",
      "start": 1768330,
      "text": "Ne, genau. Also in meiner Familie oder bei meinen Freunden habe ich glaube ich gar keine Unternehmer Selbstständige."
    },
    {
      "end": 1779450,
      "speaker": "C",
      "start": 1775490,
      "text": "Das heißt, da war auch nicht viel Support demnach von der Seite."
    },
    {
      "end": 1804260,
      "speaker": "B",
      "start": 1779690,
      "text": "Also emotionaler Support war natürlich schon da. Also meine Familie und meine Freundin, die haben mich die ganze Zeit immer in meinem Vorhaben unterstützt und ja, versuch das einfach. Ist ja jetzt gerade auch die beste Zeit für dich gerade, weil ich halt keine Verpflichtung habe. Das haben die alles schon verstanden, aber ja, und die haben mich auch emotional supported, aber ich könnte mir vorstellen, dass die schon innerlich die Stirn gerunzelt haben."
    },
    {
      "end": 1811540,
      "speaker": "A",
      "start": 1804500,
      "text": "Jetzt bist du ja nach deinen zwölf Monaten wieder zurück ins Angestelltenverhältnis gegangen. Wie hart war das, sich das einzugestehen?"
    },
    {
      "end": 1868870,
      "speaker": "B",
      "start": 1812340,
      "text": "Das ging eigentlich. Also hätte ich jetzt nur Liftbär gehabt und gar keine Downloads, gar keinen Umsatz oder sonst was, dann wäre es deutlich härter gewesen. Aber dadurch, dass ich zum Ende hin meines meines freien Jahres noch mal diesen Erfolg hatte mit Habit Kit, dass ich wirklich was in den App Store gebracht habe, was die Leute cool finden und auch teilweise oder viele Leute dann im Endeffekt auch gekauft haben, das fühlte sich schon wie ein Success an. Also ich habe mich nicht wie ein kompletter Versager gefühlt. Ich habe auch das Gefühl gehabt, dann viel gelernt zu haben in dem Jahr. Ich habe ja auch quasi eine komplett neue Kompetenz aufgebaut. Also zusätzlich zu meinen backend und Webfähigkeiten, die ich vorher aus dem Job gelernt hatte, habe ich mir komplett noch mal diesen technologischen Sektor der mobilen Apps quasi angeeignet. Das war ganz cool. Deswegen war meine Rückkehr gar nicht so schlimm."
    },
    {
      "end": 1894090,
      "speaker": "C",
      "start": 1869590,
      "text": "Wie war die Rückkehr von den Kollegen und Kolleginnen? Wie waren da die Rückmeldungen? War das positiv? Weil man hat ja auch oft so diese Angst, dass man jetzt in die Firma wieder zurückkommt als Loser oder überhaupt dieses Wechseln. Ganz viele Leute glauben mir immer, wenn ihr das einmal macht, diese Selbstständigkeit oder sowas ausprobieren kann nie wieder zurück irgendwie in die Arbeitswelt und es will mich dann ja niemand. Also wie war der Schritt an sich?"
    },
    {
      "end": 1922910,
      "speaker": "B",
      "start": 1894170,
      "text": "Ne, also das war gar kein Problem. Also die Leute fanden das alle, zumindest haben sie es gesagt, cool, haben das auch bewundert, dass man mal was gewagt hat und dieses Wagnis quasi eingegangen ist. Also da gab es eigentlich nur positives Feedback. Da kann ich mich nicht beklagen. Also ich hatte auch wirklich Kollegen, die haben mich extrem dafür abgefeiert, dass ich das versucht habe. Besonders ein Kollege, der feiert mich immer noch total ab und dem bin ich auch super dankbar für seinen Support."
    },
    {
      "end": 1925870,
      "speaker": "C",
      "start": 1923550,
      "text": "Hast du dann eigentlich mehr verdient oder weniger?"
    },
    {
      "end": 1938230,
      "speaker": "B",
      "start": 1926190,
      "text": "Ich bin dann zurückgekommen und habe auch mehr verdient. Also wahrscheinlich die Gehaltserhöhung hätte ich wahrscheinlich auch so in dem wäre ich dageblieben, wahrscheinlich gar nicht gekriegt. Also gut, dafür bist du natürlich aber."
    },
    {
      "end": 1965560,
      "speaker": "A",
      "start": 1938230,
      "text": "Auch ein Risiko eingegangen zu kündigen und keiner wusste, ob du die Stelle dann wirklich wieder bekommt. Genau, aber ich ziehe auch meinen Hut vor deinen Mut. Ich habe mich nie getraut zu kündigen, dann diesen Schritt zu gehen. Deswegen Hut ab. Ich glaube, das ist nicht selbstverständlich, aber wenn ich jetzt dein Profil auf LinkedIn aufrufe, dann steht da Independent App Developer. Das bedeutet, du bist natürlich nicht in dem Angestelltenverhältnis geblieben. Was ist passiert, dass du wieder gekündigt hast?"
    },
    {
      "end": 2075110,
      "speaker": "B",
      "start": 1966520,
      "text": "Ja, genau. Also ich hatte ja Habit Kit auf den Markt geworfen und das hatte auch stetigen, aber langsamen Fortschritt gemacht in Sachen Downloads und Umsatz. Das war auch relativ langsam dieser Growth. Aber ich glaube, es war im Mai zwei tausend drei und zwanzig, da war ich gerade wieder anderthalb Monate zurück in meinem alten Job. Ich kann mich noch ganz genau erinnern, das war an einem Wochenende und wir waren auf der Hochzeit von einem befreundeten Pärchen und auf einmal hat dann die ganze Zeit mein Handy angefangen rumzuvibrieren und ich habe auf einmal die ganze Zeit super viele Notifications gekriegt. Und dann habe ich drauf geguckt und es waren halt alles Sales Notifications. Irgendwas ist da passiert. Ich habe es nicht sofort rausgekriegt, was der Grund quasi dafür war, aber es hat auch nicht mehr aufgehört. Und nach ein paar Tagen habe ich dann herausgefunden, dass meine App auf einmal angefangen hat, für wichtige Keywords im App Store und auf Google Play zu ranken. Also wenn du im App Store jetzt zum Beispiel mal nach Habit Tracker suchst, dann kriegst du ja die Suchvorschläge und da gibt es dann natürlich auch ein Ranking. Also je höher man quasi oben auftaucht, desto besser ist das natürlich für deine App. Und lange Zeit ist da Habit Kit gar nicht für das Keyword Habit Tracker zum Beispiel aufgetaucht. Und ab dem Zeitpunkt dann schon relativ früh. Also ich glaube, das war dann direkt top fünf in vielen Ländern. Das war echt wichtiger Turning. Point in meiner Story, weil das hat so viele Downloads und Umsatz generiert. Tut es natürlich auch bis heute, weil ich immer noch so weit oben ranke. Jedes Mal, wenn jemand Habit Tracker sucht, dann stößt er halt auf meine App. Und das ist halt total wichtig gewesen."
    },
    {
      "end": 2083910,
      "speaker": "C",
      "start": 2075350,
      "text": "Hast du eine Vermutung, warum das Ganze passiert ist? Weil so wie das klingt, hast du ja nicht die ganze Description eine Woche davor geändert, sondern das ist einfach plötzlich passiert."
    },
    {
      "end": 2121890,
      "speaker": "B",
      "start": 2084230,
      "text": "Genau, ich habe da wirklich gar nicht viel geändert. Das ist halt so eine Mischung aus Dauer, die man im App Store schon da ist. Also ich habe das Gefühl, Apps, die schon länger drin sind, haben dann nach einer gewissen Zeit halt auch einen Vorteil gegenüber neuen Apps. Dann habe ich natürlich auch die ganze Zeit kontinuierlich neue Leute zu meiner App gelockt durch meine Build in Public Strategie. Also ich habe ja immer weiterhin meine Reise geteilt und dadurch sind natürlich auch immer wieder neue Leute auf meine App aufmerksam geworden. Also irgendwie war das so eine Mischung aus Zeit, Effort und Glück, würde ich sagen."
    },
    {
      "end": 2140690,
      "speaker": "A",
      "start": 2121970,
      "text": "Ich habe gerade mal nachgeschaut im deutschen Apple Store, wenn ich Habit Tracker eingebe, bist du auf Platz drei bei mir. Erst kommt so was gesponsertes und dann die organischen Ergebnisse, da bist du auf Platz drei. Und ich frage mich immer noch, was ist der Erfolg von diesem Habit Tracker? Ist es wirklich dieser Visualisation Graph, den du von GitHub geliehen hast?"
    },
    {
      "end": 2151499,
      "speaker": "C",
      "start": 2141170,
      "text": "Oder Moment, da muss ich jetzt gleich einhaken, weil ich habe damals mit Code Prince das selber gehört gemacht mit diese. Also eine Heatmap hat jetzt nicht GitHub erfunden, die grüne Heatmap."
    },
    {
      "end": 2175520,
      "speaker": "A",
      "start": 2151499,
      "text": "Okay, aber ich meine, wie gesagt, ich habe es ja schon im Intro gesagt, dass ein Habit Tracker ja eigentlich wie so eine to Do App ist. In jedem React und Vue JS Tutorial und so weiter baue ich erst mal eine to Do App. Ich lehne mich jetzt aus dem Fenster. Ich habe noch nie einen Haptracker gebaut, bin ich ehrlich. Aber ich bin auch nicht dieser to Do App Kollege. Deswegen, was denkst du, heute machen wir Habit Kit so erfolgreich? Ist es wirklich die Visualisierung?"
    },
    {
      "end": 2226820,
      "speaker": "B",
      "start": 2175840,
      "text": "Es ist zum einen die Visualisierung, die super beliebt ist, gerade unter Entwicklern. Dann wurde mir häufig gesagt, dass ich anscheinend ein Händchen oder ein Auge für Design habe. Also ich persönlich sehe mich halt gar nicht als Designer oder begabt in dem Feld. Aber die Leute finden das Design von Habitkit schon ziemlich cool und sagen, dass es teilweise sogar irgendwie die beste Habit Tracking App ist vom Design her. Und von der UX auch von der Handhabung. Also es ist halt irgendwie diese Mischung aus coolem Design, Minimalismus, also bietet hier jetzt auch nicht so viele krasse Funktionen, aber die wichtigsten sind halt da und gut umgesetzt, würde ich sagen. Und dann halt auch noch vielleicht zu einem gewissen Teil halt die Authentizität meiner Reise. Also vielleicht mein persönlicher Progress quasi, den die Leute irgendwie interessant finden."
    },
    {
      "end": 2231000,
      "speaker": "A",
      "start": 2226820,
      "text": "Du hattest gerade schon Bild in public erwähnt. Was ist das und was bedeutet das?"
    },
    {
      "end": 2278050,
      "speaker": "B",
      "start": 2231000,
      "text": "Ich bin da auch relativ früh drauf gestoßen. Das machen Indie Hacker ganz gerne. Build in public bedeutet quasi einfach nur so viel, dass man transparent auf Social Media oder auf irgendwelchen Blogs oder wie auch immer man das teilen will, ist auch egal, seine Reise quasi in seinem Unternehmertum teilt. Also bei mir sieht das zum Beispiel so aus, dass ich häufig irgendwelche Screenshots oder Videos aus meinem aktuellen Entwicklungsstand teile und da dann schreibe, was aktuell der Plan ist, wieder der Progress ist, wann ich das fertigstelle und was danach geplant ist. Früher habe ich zum Beispiel auch noch meine Umsatzzahlen immer geteilt. Das sehen auch viele Leute als Teil von Build in Public."
    },
    {
      "end": 2279810,
      "speaker": "C",
      "start": 2278290,
      "text": "Warum machst du das jetzt nicht mehr?"
    },
    {
      "end": 2327100,
      "speaker": "B",
      "start": 2279890,
      "text": "Zum Ende des Jahres, letzten Jahres hin, habe ich das noch gemacht, aber dann habe ich mich dazu entschieden, das nicht erstmal nicht mehr zu machen, weil es hatte auch ein paar Nachteile. Und zwar gerade, weil meine App ja auch relativ minimalistisch ist, habe ich häufig gesehen, dass viele Leute versuchen, meine App einfach unverschämt zu kopieren und quasi die zu kopieren und selber in den App Store zu bringen und dann irgendwie versuchen, von dem Erfolg auch irgendwie was abzuhaben. Und ich habe das Gefühl, durch meine Build in Public Journey richte ich dann quasi da so einen Scheinwerfer drauf. Und gerade durch diese Umsatzzahlen habe ich das Gefühl, motiviert, dass diese Leute, Copycats nennt man die dann auch häufig, dass man die motiviert, das zu machen."
    },
    {
      "end": 2346280,
      "speaker": "A",
      "start": 2327260,
      "text": "Aber im Endeffekt dieses Build in public, sagst du ja auch, hat dich ja erst dahin gebracht, oder? Also ich meine, die Leute zu motivieren und so weiter. Und wenn man besonders in dieser Indie Hacker Bubble unterwegs ist, wie du ja auch schon sagtest, dass die Visualis zum Beispiel ziemlich viele Entwickler und Entwicklerinnen anzieht. Also das ist ja dann schon so ein Kreislauf."
    },
    {
      "end": 2387970,
      "speaker": "B",
      "start": 2346360,
      "text": "Ja, gerade für den Anfang war es auch total wichtig. Ich würde es immer wieder so machen, dass ich am Anfang quasi auch noch alles super transparent teile, aber irgendwann überwiegen die Nachteile die Vorteile, weil am Anfang haben die Leute meine App nur durch dieses Build in public gefunden und dann später, wenn ich, als ich dann die entsprechenden Rankings in dem App Store und Google Play hatte, war ich auf diese Leute, die durch x auf meine App gestoßen sind, da war ich gar nicht mehr drauf angewiesen. Also die meisten Leute kommen halt direkt über den App Store oder Google Play. Und dadurch hatte ich dann quasi jetzt nur noch die Nachteile von dem Teilen der Umsatzzahlen und keine richtigen Vorteile mehr."
    },
    {
      "end": 2394710,
      "speaker": "A",
      "start": 2388050,
      "text": "Die Umsatzzahlen, sind das, sind das die einzigen Informationen, die du jetzt nicht mehr teilst, die du vorher geteilt hast, oder hast du noch was im Build in Public Style geändert?"
    },
    {
      "end": 2415260,
      "speaker": "B",
      "start": 2395020,
      "text": "Ne, genau. Ich glaube, das sind nur die Umsatzzahlen, die ich nicht mehr teile. Also so Downloadzahlen habe ich, glaube ich, noch nie so richtig geteilt. Finde ich auch irgendwie uninteressant. Also viele Leute finden das bestimmt total interessant, aber ich gucke gar nicht so viel irgendwie auf Downloadzahlen und sowas. Deswegen habe ich das auch noch nie so richtig geteilt. Das einzige, was ich geändert habe, ist das mit dem Umsatz."
    },
    {
      "end": 2438720,
      "speaker": "C",
      "start": 2415260,
      "text": "Man kann ja Download zahlen und sowas, kann man ja auch leicht nachschauen, ist ja gar kein Problem. Also Google plays über Downloads, dann kann man sich das ja auch ausrechnen im Endeffekt. Hast du eigentlich auch irgendwie so Hate Messages diesbezüglich bekommen, dass Leute dann irgendwie geschrieben haben, ja, du machst da diese simple App und dann verlangst du auch noch fünfzig Dollar irgendwie für die Lifetime Subscription?"
    },
    {
      "end": 2449460,
      "speaker": "B",
      "start": 2439360,
      "text": "Hate Nachrichten jetzt nicht, aber gerade auf Google Play sind die Leute relativ, also sind viele Leute preissensitiver als bei iOS."
    },
    {
      "end": 2455300,
      "speaker": "C",
      "start": 2450100,
      "text": "Das hast du jetzt schön ausgedrückt. Preissensitiv. Also sie schreiben böse Reviews dann, oder?"
    },
    {
      "end": 2466500,
      "speaker": "B",
      "start": 2455380,
      "text": "Genau, die App ist so teuer. Ja, die schreiben dann böse Bewertungen und also viele Leute geben dann halt auch einfach einen Stern und hey, ich muss was für diese App bezahlen, will ich nicht. Ein Stern."
    },
    {
      "end": 2478300,
      "speaker": "C",
      "start": 2466580,
      "text": "Wobei man muss sagen, also nachdem ich die Webseite gerade offen habe, vier Komma neun Bewertungen bei Reviews ist schon auch eine sehr gute, hohe Zahl. Also da kannst du zufrieden sein."
    },
    {
      "end": 2518090,
      "speaker": "B",
      "start": 2478460,
      "text": "Ich kann mich nicht beklagen. Genau, aber es gibt diese Leute, die das schreiben, aber hält sich vollkommen in Grenzen und ist vollkommen okay. Ich würde auch von mir selber behaupten, dass mein Pricing jetzt nicht unverschämt ist oder so. Es gibt ja auch wirklich viele Scam Apps im App Store und Google Play wahrscheinlich noch mehr, die dir dann für total basic Funktionalitäten irgendwie eine Subscription, eine wöchentliche Subscription für zehn Dollar oder so abluchsen wollen, dass man da, wenn man da nicht aufpasst, nicht genau hinguckt, dass man dann auf einmal super viel Geld verliert. Also sowas mache ich natürlich nicht. Und deswegen kann ich das dann nie so richtig verstehen, dass die Leute so böse Reviews schreiben. Aber hält sich in Grenzen."
    },
    {
      "end": 2521210,
      "speaker": "C",
      "start": 2518330,
      "text": "Wie ist deine Pricing Strategie und hat sich da was geändert?"
    },
    {
      "end": 2579920,
      "speaker": "B",
      "start": 2522010,
      "text": "Ja, also als ich mit Liftbear angefangen habe, da habe ich nur Subscriptions gehabt, quasi monatlich und jährlich. Also ich glaube, liftbar im Monat kostet, glaube ich, drei Dollar und jährlich kann ich euch gar nicht sagen, gerade habe ich schon ewig nicht mehr drauf geguckt. Irgendwas um die zwanzig Dollar. Genau. Und da habe ich dann auch wirklich viele, viele Nachrichten immer gekriegt, von wegen, wir haben schon für alles, für jeden möglichen Pups haben wir eine Subscription. Willst du nicht mal irgendwie auch irgendwie so einen einmal kauf anbieten? Der kann auch von mir aus etwas höher sein, aber ich habe keine Lust für ein tausend Apps ein tausend Subscription zu haben. Und das Feedback habe ich mir dann zu Herzen genommen. Und für Habit Kit habe ich dann quasi beides angeboten. Also einmal die Subscription monatlich und jährlich. Und zusätzlich gibt es dann halt noch den Lifetime Kauf, also den einmal Kauf."
    },
    {
      "end": 2587280,
      "speaker": "C",
      "start": 2579920,
      "text": "Und wie ist da so der Prozentsatz? Wie Viele Leute entscheiden sich für Lifetime und wie viele eher auf der monatlichen Seite?"
    },
    {
      "end": 2603460,
      "speaker": "B",
      "start": 2587440,
      "text": "Letzten Monat haben meine, haben die Lifetime war der. Also ich kann es euch nur im Umsatz sagen, aber der Umsatz von Lifetime hat quasi ungefähr vierzig Prozent meines Umsatzes ausgemacht. Die anderen sechzig Prozent kamen von den Subscriptions."
    },
    {
      "end": 2613140,
      "speaker": "A",
      "start": 2603700,
      "text": "Immer wenn ich Lifetime höre, frage ich mich, ob das nicht so ein bisschen sich selbst schieden ist, weil ich meine, das Subscription Modell hat."
    },
    {
      "end": 2617810,
      "speaker": "C",
      "start": 2613140,
      "text": "Auf welcher Seite Meinst du an die Cheat auf der Entwicklerseite oder der User Seite?"
    },
    {
      "end": 2629330,
      "speaker": "A",
      "start": 2617810,
      "text": "Oh, für den User ist es, glaube ich, ein super Gain und ich glaube, es ist eher so eine Art, wie soll ich das sagen, Heroinschuss, nennen wir es so."
    },
    {
      "end": 2630610,
      "speaker": "C",
      "start": 2629490,
      "text": "Jetzt wird es interessant."
    },
    {
      "end": 2648980,
      "speaker": "A",
      "start": 2630610,
      "text": "Ja, ja, du, sorry, ich lebe nicht in Frankfurt, deswegen Duisburg. Gut, anderes Thema. Für mich ist es so, du bietest einen Lifetime Preis an. Weiß ich nicht, wenn du sagst, okay, fünf im Monat und dein Lifetime ist, wie sind denn die aktuellen Preise? Was, was kostet Habit Kit im Monat und was kostet habit Lifetime?"
    },
    {
      "end": 2658740,
      "speaker": "B",
      "start": 2648980,
      "text": "Bei Apple ist es zwei Dollar im Monat, zwölf Dollar im Jahr und ich glaube zwei und dreiig Dollar. Also für den Lifetime Kauf."
    },
    {
      "end": 2663260,
      "speaker": "A",
      "start": 2658740,
      "text": "Ja, okay. Also ich lehne mich mal aus dem Fenster. Jeder, der ein iPhone hat, unglaublich günstig."
    },
    {
      "end": 2674370,
      "speaker": "C",
      "start": 2663580,
      "text": "Von daher ist für mich, bekomme da dann Updates aber auch. Ja, also es ist wirklich echte Lifetime. Ich bin nicht gepinnt auf diese Version, sondern bekomme auch zusätzlich Features noch."
    },
    {
      "end": 2751840,
      "speaker": "A",
      "start": 2675890,
      "text": "Und genau warum meine ich, dass das jetzt ein Heroin Schuss ist? Du guckst natürlich auf dein monthly recurrent revenue, was kommt jeden Monat rein und jetzt announced du den Lifetime Deal und für das nächste Quartal hast du natürlich einen unglaublichen, vielleicht sogar Hockeystick Growth. Und das Problem ist ja, die Leute kommen dann ja nicht mehr wieder mit ihrem Revenue, weil die haben ja den Lifetime Deal. Und du hast aber natürlich Mainz Kosten. Jetzt weiß ich nicht, ob die App Habit Kit komplett lokal läuft oder du noch ein backend irgendwo hast, wo du weiß ich nicht, was du maintainen musst und so. Das ist dann mit Serverkosten und so weiter. Aber auch wenn es nur lokal ist, bedeutet das ja trotzdem, du hast Wartungskosten. Jetzt kommt das neue Apple Design auf iOS mit diesem Liquid Glass oder wie das da heißt. So das bedeutet, das Design muss irgendwie angepasst werden, zumindest mal das App Icon. Es muss für die neue Version kompiliert werden. Mit hoher Wahrscheinlichkeit wächst die App auch irgendwann mit den Hardwareanforderungen, weil das Swift UI Kit untendrunter bei Apple irgendwie neue Sachen hat und so weiter und so fort. Vielleicht muss der Sebastian irgendwann mal sein Laptop upgraden oder bei Apple die Developer License für ein hundert Dollar oder ein hundert zwanzig Dollar jedes Jahr neu kaufen und so weiter und so. Und da frage ich mich halt, ist das nachhaltig?"
    },
    {
      "end": 2881370,
      "speaker": "B",
      "start": 2752160,
      "text": "Gute Frage, frage ich mich auch sehr häufig. Aber die Hoffnung ist ja, dass immer wieder neue Leute zur App kommen. Die Leute, die Lifetime kaufen, die werden die App ja auch nicht für immer benutzen. Also ich habe keine Zahlen, ich tracke auch nicht viele Zahlen in meiner App. Ich bin gar kein Freund von Analytics und alles. Aber meine Vermutung ist, dass die meisten Leute, die Lifetime gekauft haben, spätestens wahrscheinlich nach zwei, drei Jahren Chören. Also wie es so halt ist im Leben. Also wer schafft es schon unendlich lange seine Habits zu tracken? Und also es kommen immer wieder neue Leute zur App und alte Leute verlassen das. Aber es wirklich ein guter Punkt. Ich habe da auch viel, als ich angefangen habe drüber nachgedacht, gerade mit den Maintenance Kosten. Als ich zum Beispiel Liftbär entwickelt habe, habe da habe ich quasi ein backend dahinter gehabt, also Firebase habe ich damals genutzt und das produziert ja auch monatliche Kosten bzw. Kosten sogar pro Nutzung. Also man bezahlt ja quasi für Datenbank lesen und schreiben. Und da habe ich mir auch die ganze Zeit den Kopf darüber zerbrochen und sorgen gehabt, oh Gott, was passiert, wenn mein, wenn mein Code schlecht optimiert ist und ich zu viele Lesoperationen mache und sich das dann nicht mehr lohnt oder wenn ich aus Versehen loop in mein Code einbaue, ich eine Rechnung von tausenden von Dollars kriegt, ist alles natürlich nicht passiert. Aber das waren halt meine Sorgen. Bei Habit Kit habe ich mich dazu entschlossen, die App erstmal offline only zu machen. Also die ganzen Daten und so sind lokal gespeichert nur und man kann das halt exportieren und importieren und deswegen fühlte sich das auch richtig an mit der Lifetime Version. Jetzt gerade baue ich das aber sogar ein bisschen auch um. Also zumindest baue ich gerade ein optionales Backend mit ein, weil viele Leute wünschen sich auch, dass ihre Daten halt auf alle Geräte synchronisiert werden und wünschen sich mehrere Plattformen und pipapo. Deswegen bin ich da gerade hinterher und das ist dann wirklich eine spannende Frage, was ich mache mit meinem Lifetime Deal, wenn das der Fall ist."
    },
    {
      "end": 2922270,
      "speaker": "A",
      "start": 2881530,
      "text": "Es gibt ja manche Firmen, die machen das so eine Art Anti Pattern, die sagen okay, wenn eine neue Major Version rauskommt, dann resetten die den Lifetime Deal. Ob das jetzt richtig ist oder nicht, kann ich nicht beurteilen. Aber du sagtest auch gerade, dass deine Annahme ist, dass Leute nach zwei, drei Jahren churnen, weil sie nicht die Ausdauer haben. Das Habit Trackings. Ich würde mal sagen, ist das nicht genau der Punkt vom Habit tracking, dass du versuchst mit dem Habit Tracking eine neue Gewohnheit in dein Leben zu implementieren, die du dann später ja nicht mehr tracken musst, weil das ist Teil deines Lebens und du machst es automatisch. Also es ist ja dann schon irgendwie einen Produkterfolg, weil die Leute dann geschafft haben, Oder? Also so sehe ich das jetzt gerade."
    },
    {
      "end": 2944170,
      "speaker": "B",
      "start": 2922350,
      "text": "Ja, genauso ist es. Ja, also ich habe auch super lange gewisse. Also ich tausche häufig meine Habits, die ich tracker auch aus, weil ich dann neue Sachen quasi wieder neu anfangen möchte. Aber stimmt tatsächlich. Also gerade bei so Sachen, wo man dann erfolgreich die Habit aufgebaut hat, dann braucht man die App halt irgendwann nicht mehr. Also die App schafft sich quasi selber ab."
    },
    {
      "end": 2965200,
      "speaker": "C",
      "start": 2944720,
      "text": "Und war das irgendwie eine random Zahl diese. Also es entspricht dir ungefähr drei Jahre von der Jahreslizenz, die Lifetime Lizenz. War das irgendwie eine strategische Überlegung? Bist du da dran gegangen? Okay, drei Jahre wird so der Durchschnitt sein. Mache ich Lifetime auf drei Jahre oder war das einfach so, was bezahlen die Leute und klingt nach einem sinnvollen Wert?"
    },
    {
      "end": 2996460,
      "speaker": "B",
      "start": 2965200,
      "text": "Also erstmal mein erstes Pricing war ein bisschen günstiger noch. Das habe ich auch einfach nur so gewählt. Ich ich habe glaube ich ein paar andere Habit Apps oder generell Produktivitäts Apps ausgecheckt und mal geguckt, was die für ein Pricing haben. Und dann habe ich, glaube ich, irgendwie den Mittelwert von allen genommen, geguckt, was da irgendwie am besten zu Habit Kit passt. Und dann später habe ich auch noch ein paar Experimente mit Preisen gemacht und halt zum Beispiel so auch festgestellt, dass man bei iOS auch mehr quasi verlangen kann als bei Google."
    },
    {
      "end": 3044460,
      "speaker": "C",
      "start": 2997330,
      "text": "Ich glaube sowieso, dass wenn ich das jetzt so einschätzen müsste, drei Jahre wahrscheinlich sogar sehr hoch sind im Durchschnitt für die App Verwendung. Und sogar wenn man jetzt irgendwie einen User hat, der das länger verwendet, der ist ja dafür ein super Multiplikator üblicherweise, weil wenn der allen Freunden und Freundinnen erzählt, wie cool die App ist und so günstig. Lifetime Value auch noch. Es ist ja eh das Beste eigentlich, was man so haben kann. Und rein wirtschaftlich gesehen, um jetzt Andi was noch dagegen zu sagen, ich glaube, gerade wenn man Bootstrapping betreibt, ist es ja auch wichtig, möglichst früh Geld zu bekommen. Wenn man das so klassisch im Gegenzug zu wie sie Geld oder so sieht, dann bekommst du ja frühzeitig Geld, was du investieren kannst und du hast wirklich liquide Mittel sofort. Also macht Lifetime absolut Sinn, meiner Meinung nach."
    },
    {
      "end": 3062640,
      "speaker": "B",
      "start": 3044540,
      "text": "Ein cleverer Entwickler wird dann ja natürlich, oder ein cleverer Unternehmer wird natürlich dann Analytics in seine Entwicklung Apps einbauen und dann natürlich mal die Nutzungsdauer tracken und dann statistische Analysen darauf fahren und gucken, was da der beste Preispunkt ist. Aber das habe ich noch nie gemacht, weil ich vielleicht nicht so clever bin."
    },
    {
      "end": 3093290,
      "speaker": "A",
      "start": 3063040,
      "text": "Es geht gar nicht mit clever. Natürlich stelle ich mir schon die welche Zahl trackst du, um die Frage zu verbesserst du dich vielleicht? Vielleicht Revenue, vielleicht monthly recovery revenue, was auch immer deine Metrik ist. Aber man kann auch sagen, und jetzt kommt die Flip Zeit, dass du the good guy bist und DSGVO konform. Also ich meine, das ist ja auch so eine Art, ich habe jetzt keine Ahnung, ob du damit wirbst, aber so nach dem Motto meine Habits gehen nicht in die amerikanische Cloud."
    },
    {
      "end": 3107780,
      "speaker": "B",
      "start": 3093290,
      "text": "Genau so ist es. Aber richtig werben tue ich damit nicht. Also die meisten Habit Kit User kommen ja auch aus USA und ich glaube, die interessiert es einfach nicht. Deswegen brauche ich damit auch, glaube ich, nicht groß werben."
    },
    {
      "end": 3171110,
      "speaker": "A",
      "start": 3107940,
      "text": "Ich habe noch eine Frage zu Marketing. Und zwar, wenn ich das jetzt richtig verstanden habe, hast du ja eigentlich zwei Marketing Kanäle. Der eine ist built in public und der andere ist ja auf Basis meiner Recherchen nennst du das AsO, App Store Optimization. Bevor wir zur App Store Optimis, App Store Optimization kommen und was das genau ist und so noch eine Frage zu bilden. Public ist das nicht eine Distraction? Weil ich meine, jeder redet immer nur, jeder Unternehmer redet von Fokus und schnell shippen und allem drum und dran und nebenbei musst du jetzt noch schöne Screenshots erstellen und bloggen und twittern und auf die Antworten reagieren und so weiter und so fort. Und ich selbst weiß durch dieses Projekt, durch dieses Podcast Projekt hier, das Social Media, weiß ich nicht, ein Fass ohne Boden ist und auch gute Blogposts zu erstellen und auch Screenshots zu erstellen und auch Value damit zu bringen und deine Weekly Logs, ich meine, du trackst ja schon irgendwie mit, was du machst und allem drum und dran. Also ist das nicht eine komplette Distraction?"
    },
    {
      "end": 3240770,
      "speaker": "B",
      "start": 3171350,
      "text": "Es ist auf jeden Fall ein Zeitfresser. Es ist manchmal auch echt mühselig, sich wieder zu überlegen, was poste ich heute? Oder es gibt ja auch manchmal Phasen, da hat man dann vielleicht auch gar nicht so viel gearbeitet, wenn man gerade irgendwie aus dem Sommerurlaub kommt oder so, dann hat man vielleicht auch gerade gar nicht so viel zu posten über sein Business. Deswegen, das ist manchmal anstrengend und frisst auch Zeit. Aber ein wichtiger Faktor für mich zumindest persönlich ist, dass mir das so ein bisschen Accountability gibt. Also ich weiß, jede Woche will ich eigentlich diesen Blogpost schreiben, wo ich quasi darüber schreibe, was ich die Woche gemacht habe für mein Business. Gerade weil ich ja selbstständig bin und keiner macht mir irgendwelche Vorgaben, woran ich zu arbeiten habe oder was ich zu arbeiten habe, hilft mir das so ein bisschen quasi den Fokus zu bewahren. Und ich weiß die ganze Woche über, du musst jetzt an deinen Apps arbeiten, an deinem Business arbeiten, weil du musst ja am Wochenende deinen Blogpost schreiben und schreiben, was du gemacht hast. Wäre ja irgendwie peinlich, wenn da keiner kommt oder so. Also es passiert auch manchmal, aber ich versuche es zu vermeiden und genau deswegen hilft mir das eigentlich sogar."
    },
    {
      "end": 3255580,
      "speaker": "A",
      "start": 3240930,
      "text": "Aber hast du Leute, die dich pingen? Weil die wissen, jeden Mittwochnachmittag schreibt der Sebastian Blogpost und wenn der am Mittwochabend nicht da ist, weil das deren Bedtime Routine ist und hey Sebastian, wo ist dein Weekly Log? Also hast du Leute, die dich accountable halten?"
    },
    {
      "end": 3276980,
      "speaker": "B",
      "start": 3255820,
      "text": "Also so große Fans habe ich da noch nicht bei meinem Blog und so, aber die Leute schreiben manchmal, wie gesagt, der ist nicht so populär, der Blog, aber manchmal kriege ich Nachrichten und die Leute schreiben hey, ich finde ihn wirklich toll und deine deine Blogposts haben mich motiviert, auch irgendwie was eigenes zu starten und ja, deswegen mache ich es eigentlich auch."
    },
    {
      "end": 3290020,
      "speaker": "A",
      "start": 3277300,
      "text": "Ich hatte gerade von einem zweiten Marketing Kanal gesprochen, App Store Optimierung. Kannst du mir ganz kurz erklären, was das ist? Der Name sagt das schon eine ganze Menge, aber was ist das, worum geht es da und wieso ist das so erfolgreich?"
    },
    {
      "end": 3341230,
      "speaker": "B",
      "start": 3290020,
      "text": "Ja, also ich habe ja gerade schon gesagt, als ich auf einmal, als ich auf dieser Hochzeit war und die ganze Zeit diese Notifications gekriegt habe, war quasi der Grund, dass ich auf einmal angefangen habe, relativ weit oben im App Store zu stehen. Wenn man nach Habit Tracker sucht zum Beispiel, dazu gibt es quasi ganzen Themenbereich, das nennt man App Store Optimierung. Der befasst sich quasi damit, wie man es schafft, möglichst weit oben in diesen Suchergebnissen zu stehen. Also das Pendant im Web ist ja dann quasi Search Engine Optimization. Das machen ja auch viele Leute, die beschäftigen sich dann damit, wie man es schafft, ganz weit oben bei Google zu ranken. Und das gleiche Thema gibt es halt auch für den App Store. Da gibt es dann ganz unterschiedliche Theorien und Techniken, wie man es schafft, da relativ weit oben für irgendwelche Keywords zu ranken."
    },
    {
      "end": 3347430,
      "speaker": "A",
      "start": 3341310,
      "text": "Das bedeutet, mit diesen ganzen Paid Ads und die ganze Suchmaschinenwerbung Thematik, da hältst du dich von fern."
    },
    {
      "end": 3389760,
      "speaker": "B",
      "start": 3347430,
      "text": "Genau, Suchmaschinenoptimisierung mache ich eigentlich gar nicht. Also ich habe super wenig Content im Web für Habit Kit, aber bei Apple gibt es ja auch im App Store Apple Search Ads. Das heißt, du kannst quasi für deine Apps Werbung schalten im App Store direkt, dass man da quasi auf diesem ganz oben dann ist, da bezahlt man dann halt ein bisschen Geld für. Das mache ich aber nur so halbherzig. Also ich habe mir sagen lassen, dass wenn man da Werbung schaltet, dass Apple dich dann ein bisschen favorisiert, auch bei den anderen Rankings quasi. Und deswegen schalte ich da so ein bisschen Werbung, ich glaube für ein hundert Dollar im Monat, aber es ist wirklich total vernachlässigbar."
    },
    {
      "end": 3407320,
      "speaker": "A",
      "start": 3389920,
      "text": "Jetzt ist es so, wir nennen uns, wir, der Engineering Kiosk nennt sich deutschsprachiger Software Engineering Podcast und wir sind jetzt schon circa fünfzig Minuten dran und wir haben noch gar nicht über deinen tech Stack gesprochen. Das ist jetzt eigentlich so eine Sache, die müssen wir machen."
    },
    {
      "end": 3418040,
      "speaker": "C",
      "start": 3407800,
      "text": "Ich glaube, der eigentliche Grund, warum der Andi das machen will, ist nur, weil du Flutter verwendest und er auch mal Flutter verwendet hat und er will jetzt endlich jemand anderen finden, der auch Flutter verwendet und der das gut findet."
    },
    {
      "end": 3443180,
      "speaker": "A",
      "start": 3418200,
      "text": "Nein, nein, nein. Führe jetzt mal ganz kurz durch. Du hast gerade gesagt, du hast ein Händchen für UI UX. Da frage ich mich natürlich, nutzt du dann zum Beispiel das Google Material Design oder baust du alle Elemente selbst, folgst du den Apple Guidelines bei UX? Wie gut schätzt du die Cross Plattform Funktionalität von Flutter ein? Weil der Wolfgang hat es ja schon gespoilert und so weiter und so fort. Führ uns noch mal ganz kurz durch, wie die ganze Sache eigentlich aufgebaut ist."
    },
    {
      "end": 3527840,
      "speaker": "B",
      "start": 3443260,
      "text": "Richtig, ich benutze Flutter für meine Apps. Für alle drei habe ich Flutter benutzt. Ich habe schon Ende meines Studiums, habe ich schon so einen kleinen Flutter Online Kurs gemacht, wo ich quasi die Basics gelernt habe von dem Framework. Das hat sich für mich total flüssig und rund angefühlt, wie man quasi mit dem Framework UIs baut. Gerade als Webentwickler oder so fühlt sich das ganz, ganz gut an, finde ich, mit Flutter UIs zu bauen. Also so viel, wenn man schon mal irgendwie mit Angular oder so gearbeitet hat, dann fühlt man sich jetzt relativ heimisch, würde ich sagen, bei Flutter. Ja, also ich bin total zufrieden eigentlich mit dem Framework, habe das halt auch gewählt, weil ich halt alleine bin und ich wollte jetzt keinen. Ich wollte meine Apps für beide Plattformen rausbringen, also iOS und Android, und wollte dafür jetzt nicht zwei komplette Codebasen quasi maintaine, also mit Swift und Kotlin oder so. Und deswegen habe ich mich dann halt für dieses Plattform Framework entschieden und bin bisher damit auch super gefahren. Es gab mal ein paar Momente, da habe ich das natürlich verflucht. Gerade am Anfang gab es auch noch so ein paar Performance Probleme, gerade auf iOS, die waren auch bekannt, aber da hat das Flutter Team echt dran gearbeitet und da das verbessert."
    },
    {
      "end": 3532160,
      "speaker": "C",
      "start": 3527920,
      "text": "Und wie weit passt du die UI dann wirklich an die jeweiligen Systeme?"
    },
    {
      "end": 3557080,
      "speaker": "B",
      "start": 3532160,
      "text": "Apple und Android, die passe ich gar nicht an. Also die haben beide komplett die gleiche UI, finde ich irgendwie. Also ich habe halt, ich benutze halt nicht. Ich benutze die Material Design Komponenten von Google. Die stellen die ja quasi als Flutter Komponenten Library zur Verfügung. Aber ich habe die quasi angepasst mit meinem eigenen Look and Feel, wie ich es cool finde."
    },
    {
      "end": 3567800,
      "speaker": "C",
      "start": 3557720,
      "text": "Und die iOS User beschweren sich da nicht, dass da keine Steve Jobs sich im Grab umdrehen würde, wenn da jemand mit so Material Design um die Ecke kommt und so das gute iOS Design nicht würdigt."
    },
    {
      "end": 3598550,
      "speaker": "B",
      "start": 3568359,
      "text": "Also wie gesagt, also so richtig erkennen kann man es nicht mehr, dass da halt Material Design hinter steckt, weil ich das halt wirklich customized habe auch. Aber ich finde dieses custom Design, das passt halt gut auf beide Plattformen und das ist irgendwie so unabhängig und da hat sich noch niemand groß beschwert. Klar, es gibt manchmal Apple Fanboys, die sagen, hier, was soll das? Aber diese User, die schreiben mir wahrscheinlich auch gar nicht. Die deinstallieren sofort die App und nehmen irgendwas Natives."
    },
    {
      "end": 3600790,
      "speaker": "C",
      "start": 3598550,
      "text": "Was verwendest du selber persönlich eigentlich?"
    },
    {
      "end": 3601590,
      "speaker": "B",
      "start": 3601110,
      "text": "IOS."
    },
    {
      "end": 3603770,
      "speaker": "C",
      "start": 3602230,
      "text": "Ah OK. Sogar iOS User."
    },
    {
      "end": 3614000,
      "speaker": "A",
      "start": 3604480,
      "text": "Bei Flutter gibt es so ein paar Sachen, du siehst relativ schnell, ob eine App mit Flutter gebaut wurde oder nicht, weil so ein paar native Gesten siehst."
    },
    {
      "end": 3622160,
      "speaker": "C",
      "start": 3614000,
      "text": "Du, du hast jetzt so einen Fanboy, der jetzt wieder sich beschwert, dass irgendwie, wenn du mit achtzehn Finger da irgendwie einen Kreis drehst oder so, dass dann irgendwas nicht funktioniert."
    },
    {
      "end": 3651290,
      "speaker": "A",
      "start": 3622320,
      "text": "Ja, genau so. Genau, genau um sowas geht's. Und da gibt es dann die Hardcore Leute natürlich. Aber du hast gerade gesagt, dass das Flutterteam gute Arbeit gemacht hat. Und verfolgst du auch so ein bisschen die News? Weil knapp vor genau einem Jahr wurde gefühlt die Hälfte oder zwei Drittel des flutter Teams bei Google einfach entlassen. Und da war so ein bisschen die okay, was passiert mit der Zukunft jetzt mit Flutter? Lässt Google das jetzt sterben und so weiter. Hast du die News verfolgt und hat dich das irgendwie zum Nachdenken gebracht oder sagst och nö, das funktioniert einfach super und not my business?"
    },
    {
      "end": 3684220,
      "speaker": "B",
      "start": 3651610,
      "text": "Ja, also ich bin da relativ schmerzfrei. Wenn Google irgendwann sagen würde, wir supporten Fliegen nicht mehr, dann, weiß nicht, würde ich wahrscheinlich einfach sogar anfangen, irgendwie React Native oder so zu benutzen und die App neu zu bauen. Also ich bin jetzt auch jetzt nicht super Passionate, was das Framework angeht. Also ich will halt einfach irgendwas benutzen, was funktioniert, was gut maintained ist. Aber wenn es irgendwann nicht mehr so der Fall sein sollte, dann nehme ich halt was anderes. Also ist nicht schlimm."
    },
    {
      "end": 3704270,
      "speaker": "A",
      "start": 3684380,
      "text": "Ich meine, die Keyfrage für diesen Podcast war ja unter anderem, wie schwer ist es als Software Engineer ein Produkt zu bauen, wofür Leute Geld zahlen? Und du hast jetzt schon zweimal gesagt, dass der Akt des Programmierens eigentlich nicht eine Herzensaktivität ist, sondern eher Produkte bauen und so weiter. Und dass du keine des Programmierens."
    },
    {
      "end": 3710270,
      "speaker": "C",
      "start": 3704270,
      "text": "Also Andi enthalt mich meinem Kommentar so."
    },
    {
      "end": 3750970,
      "speaker": "A",
      "start": 3710270,
      "text": "Ich weiß nicht, was du jetzt schon wieder denkst oder was in deinem Kopf abgeht. Es ist der Akt des programmierens, es ist Kunst, es ist Kreativität ausleben. Wolfgang und dann sagst du jetzt gerade, du bist nicht passionate about, du bist nicht passionate über das Framework. Ich frage mich gerade, ob das nicht irgendwie die Key Vorteile deiner Person sind, Sebastian, weil ich bin nämlich ganz anders. Der Akt des Programmierens macht mir unglaublich viel Spaß. Bin ich passionate über ein Framework? Ja, natürlich auch. Weil besonders, wenn ich mich da schnell drin bewegen kann und die Möglichkeiten. Versuchst du das natürlich auch in die Grenzen zu pushen und das verführt mich natürlich dann in diese Featuritis, oh, das kann ich noch refactoren und so weiter. Und das scheinst du ja alles gar nicht zu haben."
    },
    {
      "end": 3755050,
      "speaker": "C",
      "start": 3750970,
      "text": "Aber das ist der Unterschied. Deine Flutter App ist nicht mehr im App Store. Sebastian schon."
    },
    {
      "end": 3756010,
      "speaker": "B",
      "start": 3755210,
      "text": "Das ist korrekt."
    },
    {
      "end": 3758050,
      "speaker": "A",
      "start": 3756010,
      "text": "Deswegen, also ich sage ja, ich ziehe meinen Hut."
    },
    {
      "end": 3807940,
      "speaker": "B",
      "start": 3758050,
      "text": "Also Kudos, also das Problem ist ja, dass die Nutzer, die sehen deinen Code ja nicht. Also denen ist das eigentlich komplett egal. Also die denken sich einfach, okay, das muss halt funktionieren. Aber egal, ob du da jetzt ein tausend Design Patterns reingehauen hast und alles super krass cool, abstrakt und wiederverwertbar ist, das sehen die ja nicht und interessiert die in den meisten Fällen auch nicht. Klar, man muss halt zu einem gewissen Punkt seine Standards haben und Qualitätsansprüche, damit man die App natürlich auch maintainen kann und erweitern kann. Aber ja, das ist wahrscheinlich wirklich ein Vorteil von mir, dass ich da relativ schmerzfrei bin oder leidenschaftslos, was den Code angeht. Also ich würde meinen Code jetzt auch nicht als schlecht bezeichnen, aber wie gesagt, ich bin halt, ich brenne jetzt nicht dafür, den schönsten Code zu schreiben."
    },
    {
      "end": 3820900,
      "speaker": "A",
      "start": 3808340,
      "text": "Sag doch sowas nicht, du brichst gerade mein Herz. Der User interessiert den schönen Code. Ich trete einen Schritt zurück vom Mikrofon und lasse jetzt Wolfgang wieder das Mikrofon, sonst fange ich noch an zu weinen."
    },
    {
      "end": 3827530,
      "speaker": "C",
      "start": 3821300,
      "text": "Als wenn du einen schönen Code schreiben würdest. Ganz abgesehen davon, du hackst ja auch nur, das ist möglichst schnell online, ist."
    },
    {
      "end": 3835690,
      "speaker": "A",
      "start": 3827530,
      "text": "Von dem her schön, ist subjektiv und ich tue mein Bestes. Ich würde dich bitten, meine Arbeit trotzdem anzuerkennen, nur weil ich es nicht besser weiß."
    },
    {
      "end": 3845610,
      "speaker": "C",
      "start": 3836330,
      "text": "Wobei man muss ja auch sagen, wenn ich es richtig verstanden habe, du arbeitest ja komplett alleine, oder? Also du hast kein Team, du hast auch keine Freelancer, die für dich in irgendeiner Form tätig sind."
    },
    {
      "end": 3856110,
      "speaker": "B",
      "start": 3845610,
      "text": "Genau, ne, ich mache das eigentlich alles komplett alleine. Also die App Icons, die habe ich designen lassen von einem Designer auf Pfeifen, aber den Rest habe ich komplett alleine."
    },
    {
      "end": 3882550,
      "speaker": "C",
      "start": 3856110,
      "text": "Gemacht, weil dann ist natürlich auch leichter, wenn man die Code Reviews mit sich selber hat und nur mit sich selber streiten muss, dann gibt es halt auch keine Diskussionen, wenn es um Code geht, um eine Programmiersprache oder sonst irgendwas oder wie man etwas umsetzt. Das ist natürlich einfacher, aber das ist auch etwas, was du weiterhin zu machen willst. Also du hast auch keine Ambitionen, jetzt irgendwie eine Firma zu machen und irgendwas auszulagern, sondern du willst in dem Setting und diesem Setup bleiben."
    },
    {
      "end": 3893590,
      "speaker": "B",
      "start": 3882790,
      "text": "Auf jeden Fall. Also ich habe gar keine Ambition, eine Firma zu gründen und Leute einzustellen und Angestellte zu managen."
    },
    {
      "end": 3904550,
      "speaker": "C",
      "start": 3893670,
      "text": "Und das war aber auch von Anfang an so. Also du hattest gar nie den Wunsch, irgendwie so groß zu werden. Du wolltest zwar dein Gehalt finanzieren, aber nie irgendwie mehr als das, wenn ich das richtig verstehe."
    },
    {
      "end": 3929270,
      "speaker": "B",
      "start": 3904550,
      "text": "Ja, genau. Also ich sage immer zu meiner Freundin aktuell, ich habe aktuell den besten Job der Welt. Also ich habe die maximale kreative Kontrolle über alles, was ich mache. Ich kann arbeiten, wann ich will und wie ich will. Und ich will, also wenn ich das bis zum Ende meines Renteneintrittsalters oder Ruhestands quasi machen könnte, wäre das perfekt für mich. Also ich würde nichts ändern."
    },
    {
      "end": 3951340,
      "speaker": "C",
      "start": 3929270,
      "text": "Gerade jetzt, wenn man alleine ist, ist es ja oft sehr schwer, sich zu motivieren. Du hast es zwar die weltbeste Habit App, die dir dabei hilft natürlich, aber wie schaffst du das, motiviert zu bleiben? Und du hast ja auch am Anfang erwähnt, irgendwie, du vermisst so ein bisschen den Kontakt auch mit anderen vielleicht. Also wie schaffst du das, motiviert zu bleiben? Hast du da irgendeine Taktik?"
    },
    {
      "end": 3995510,
      "speaker": "B",
      "start": 3951420,
      "text": "Also ich habe unterschiedliche Strategien, die ich da verfolge. Und zwar, also es ist halt super wichtig, dass man, dass man versucht, irgendwie einen geregelten Tagesablauf zu behalten. Also wenn man seinen Job kündigt und dann auf einmal in dieser Selbstständigkeit sich wieder fühlt, dann ist es ja super reizvoll, einfach irgendwie abzudriften und nur noch nachts zu arbeiten oder sonst was. Deswegen habe ich von vornherein einfach gesagt zu meiner Freundin, die ist Ärztin und arbeitet im Krankenhaus. Ich habe gesagt, jedes Mal, wenn du zur Arbeit gehst, setze ich mich einfach an den Schreibtisch und arbeite genauso lange, wie du weg bist, so dass ich quasi meinen geregelten Tagesablauf komplett behalten habe, so wie vorher auch. Und das ist dann quasi aktuell dann einfach so wie mein ganz normaler Job, nur dass ich halt für mich selber arbeite."
    },
    {
      "end": 4016070,
      "speaker": "A",
      "start": 3995990,
      "text": "Ganz kurze schießt du dir damit nicht selbst ins Knie? Weil ich meine, wenn deine Lebenspartnerin Ärztin ist, ich weiß, in Krankenhäusern kann es ab und zu mal drunter drüber gehen, wenn es irgendwo größeren Unfall gibt oder jetzt speziell, wenn es Richtung Sommer geht, steigt die Unfallgefahr von Motorradfahrern und so weiter und so fort. Also arbeitest du dann nicht länger?"
    },
    {
      "end": 4042460,
      "speaker": "B",
      "start": 4016150,
      "text": "Ja, teilweise, aber die hat auch früher immer vier und zwanzig Stunden Dienste gehabt. Da habe ich dann natürlich nicht vier und zwanzig Stunden gearbeitet, sondern ganz, ganz normal. Und dann hatte die am nächsten Tag auch frei. Und dann hatte ich natürlich dann auch die Freiheit zu sagen, ach, ich mache heute auch einfach dann frei. Ja, also klar, manchmal arbeite ich auch mehr als ein normaler Arbeitnehmer, aber in vielen Fällen arbeite ich auch einfach weniger. Also es gleicht sich schon so aus, hat sich bisher noch nicht gerecht."
    },
    {
      "end": 4049820,
      "speaker": "C",
      "start": 4042860,
      "text": "Hilft dir eigentlich Build in Public irgendwas diesbezüglich, weil du da dann Kontakt mit anderen hast, das irgendwie motivierend wirkt?"
    },
    {
      "end": 4071100,
      "speaker": "B",
      "start": 4049820,
      "text": "Ja, ich habe ja gerade schon gesagt, also es ist so ein bisschen auch Accountability, weil wenn ich nicht arbeite, dann habe ich auch nichts zum Posten. Und deswegen hält mich das halt so ein bisschen bei der Stange, regelmäßig dann quasi weiter meine eigenen Projekte zu verfolgen. Das hilft. Der Austausch mit anderen Leuten ist da jetzt nicht so der motivierende Faktor."
    },
    {
      "end": 4079340,
      "speaker": "C",
      "start": 4071660,
      "text": "Okay, also ich sehe schon, ich wollte es positiv formulieren, motivierend. Du sagst, Accountability muss einfach jemand da sein, der Druck macht. Okay."
    },
    {
      "end": 4100190,
      "speaker": "B",
      "start": 4081310,
      "text": "Was man halt als selbstständig, also man muss halt einfach selber irgendwie auch den Drive haben. Also wenn man gar nicht irgendwie selbstständig sein will, dann kann man sich auch nicht dazu zwingen. Also man muss schon irgendwie so ein bisschen der Typ dafür sein. Die Motivation muss auch von innen herauskommen zum großen Teil."
    },
    {
      "end": 4121440,
      "speaker": "C",
      "start": 4100270,
      "text": "Ich denke mir nur immer, also bin auch der Meinung, dass man zu zweit zum Beispiel genau eben jemanden hat, der einen Accountable haltet, wo man irgendwie dann hin und wieder auch einen Druck bekommt bekommt. Darum ist es halt für mich immer interessant, wie schafft man das, wenn man alleine ist, irgendwie das zu kompensieren? Und das hast du eigentlich ganz gut beantwortet. Und da ist vielleicht ein Build in public auch eine gute Möglichkeit."
    },
    {
      "end": 4158730,
      "speaker": "A",
      "start": 4122640,
      "text": "Aber das mit dem zwingen kann ich ganz, kann ich ein hundert Prozent verstehen. Ich finde, das beste Beispiel, was ich jemals gehört habe, ist, wenn du anfangen möchtest mit Sport oder anfangen möchtest mit Laufen und du einfach nicht eine lange Strecke laufen möchtest, lauf einfach fünf Kilometer in eine Richtung, jetzt keine Runde oder so in eine Richtung und nimm kein Geld mit und kein Handy. Das Problem ist, du musst dann die fünf Kilometer wieder zurück und so zwingst du dich dann halt und hast du zehn Kilometer Ruhe. Und das klingt so simpel, das ist so brutal, aber finde ich unglaublich schön, die Analogie."
    },
    {
      "end": 4160490,
      "speaker": "B",
      "start": 4159050,
      "text": "Ja, das ist wirklich sehr passend."
    },
    {
      "end": 4183630,
      "speaker": "C",
      "start": 4160730,
      "text": "Jetzt hast du eh schon gesagt, du bist super glücklich und das ist eigentlich der beste Job, den du haben kannst. Daher erledigen sich meine zwei nächsten Fragen, aber ich frage sie trotzdem noch. Du kannst dir gar nicht vorstellen, wahrscheinlich in eine Anstellung zurückzugehen und so was wie einen Exit, dass du einfach Habit Kit verkaufst, kommt für dich demnach auch nicht in Frage? Oder sind es beides Optionen, wo du sagst, okay, kann schon in den nächsten Jahren passieren."
    },
    {
      "end": 4223670,
      "speaker": "B",
      "start": 4183630,
      "text": "Ich kann mir vorstellen, auch wieder zurück zu einem Arbeitgeber zu gehen. Als Arbeitnehmer kann ich mir irgendwie auch vorstellen, wahrscheinlich dann nicht mehr in der Rolle eines Entwicklers, sondern wahrscheinlich würde ich mich dann mehr so im Product owner Bereich oder Strategiebereich sehen. Im besten Fall. Das kann ich mir durchaus vorstellen. Sollte irgendwie Habit Kit irgendwann mal abrutschen in den App Store Rankings und sich das dann nicht mehr lohnen oder so. Das kann ich mir durchaus vorstellen. Und auch ein Exit kann ich mir auf jeden Fall vorstellen. Ich meine, selbst wenn ich Habit Kit verkaufe, dann heißt es ja nicht, dass ich andere Projekte weiterverfolgen kann. Also ich habe ja noch tausend andere App Ideen, die ich dann auch einfach irgendwie umsetzen kann."
    },
    {
      "end": 4233350,
      "speaker": "C",
      "start": 4223830,
      "text": "Also alle, die jetzt Kaufinteresse haben, können sich bei dir melden. Theoretisch sechs, siebenstelliger Betrag, dann geht es vielleicht mindestens."
    },
    {
      "end": 4258410,
      "speaker": "A",
      "start": 4233750,
      "text": "Viel Glück damit. Also gönne ich wirklich super, super Ding. Kommen wir zum Ende. Meine Frage welchen Tipp würdest du da tippen? Würdest du unseren Entwickler innen geben, die ernsthaft mal eine ähnliche Route wie du einschlagen wollen, die ernsthaft vielleicht mal eine Indie App bauen wollen? Und was ist der kleinste nächste Schritt, um mal richtig loszulegen? Was würdest du den Leuten raten?"
    },
    {
      "end": 4355570,
      "speaker": "B",
      "start": 4259209,
      "text": "Ich gebe da immer einen Tipp, den die meisten Indie Hacker wahrscheinlich nicht geben würden. Und zwar würde ich sagen, wenn ihr in meiner Situation seid vor drei, vier Jahren und ihr seid noch relativ jung oder hab keinerlei Verpflichtungen, hab vielleicht ein bisschen was gespart, irgendwie so ein kleines finanzielles Polster, dann versucht das einfach mal, sich so eine Deadline zu setzen und zu sagen, ich konzentriere mich jetzt nur auf meine eigenen Projekte. Gerade als Entwickler. Zumindest war es noch vor ein paar Jahren so. Ich weiß nicht, wie es aktuell ist. Gerade als Entwickler ist es ja auch super einfach, wieder was Neues zu finden. So richtig verlieren tut man halt eigentlich nichts und man kann eigentlich nur gewinnen. Im schlimmsten Fall halt jede Menge Lebenserfahrung. Also für mich war es die beste Entscheidung meines Lebens, einfach mal diesen Job zu kündigen und meinen eigenen Kram zu probieren. Also das würde ich jedem raten. Und als weiteren Tipp, den ich auch immer gebe, wenn ihr keine Ideen habt, was ihr bauen sollt. Also ich war ja am Anfang auch so, ich hatte gar keine coole Business Idee oder so. Baut einfach irgendwas, guckt in euer Privatleben, schaut, was ihr für Hobbys habt. Habt, wenn ihr gerne laufen geht oder so, dann baut einfach die nächste Lauf App und vielleicht mit einem eigenen Spin oder so. Vielleicht wird sehr erfolgreich. Aber während ihr das baut, kann ich euch versichern, ihr kriegt ein tausend neue Ideen, weil gerade allein dieser Akt, irgendwie ein neues Produkt quasi zu entwickeln, bringt dir, lässt irgendwie die kreativen Säfte fließen und gibt dir tausend neue Ideen wieder."
    },
    {
      "end": 4400670,
      "speaker": "A",
      "start": 4355890,
      "text": "Vielen lieben Dank, Sebastian. Ich fand es super inspirierend, deine persönliche Story zu hören. Und ich fand es auch mal schön, eine Story zu hören, wo es nicht auf den ersten Blick oder auf den ersten Zeitraum geklappt hat, sondern dass du auch wieder zurückgegangen bist in die Angestelltenverhältnis. Also es tut mir leid, dass du den Schritt tun musstest, aber es ist auch schön zu hören, dass man mal eine Story erzählt bekommt, die halt nicht nach dem Bilderbuch geschrieben ist. Und deswegen hat mich sehr inspiriert. Wie gesagt, ich habe Habit Kit, hatten wir im Vorgespräch schon mal kurz erwähnt, selbst mal genutzt. Und ja, mich hat die Visualisierung auch angesprochen, bin ich ehrlich. Ich habe es leider nie zu dem Element geschafft, wo es wirklich bunt war, aber das lag an mir und nicht an der App."
    },
    {
      "end": 4429130,
      "speaker": "C",
      "start": 4400910,
      "text": "Ich glaube ja überhaupt, dass diese Visualisierung schon key ist. Du hast ja auch angesprochen, aber ich glaube, das trifft einfach einen Nerv. Und gerade in der Entwickler Community und Build in public sind ja auch viele Entwickler innen. Also das ganze Zusammenspiel, das ganze performt auf Twitter, exgood. Also ich glaube, das klingt zwar so einfach, aber ich glaube schon, dass dessen großer Grund war eigentlich, dass es alles funktioniert. Und ich finde es auch sehr sexy, muss ich sagen, wenn man sowas sieht als Entwickler."
    },
    {
      "end": 4433650,
      "speaker": "B",
      "start": 4429130,
      "text": "Ja, dankeschön. Ja, war auf jeden Fall mit Sicherheit ein großer Faktor für den Erfolg."
    },
    {
      "end": 4458470,
      "speaker": "A",
      "start": 4434290,
      "text": "An alle Hörerinnen und Hörer, falls ihr die Apps von Sebastian mal ausprobieren wollt, die links findet ihr in den Show Notes, genauso wie sein Substack Account und sein LinkedIn Profil. Also falls ihr Sebastians Reise begleiten wollt, schaut doch mal rein. Ich kann die Weekly Logs empfehlen. Sehr inspirierend, was dieser Mensch so pro Woche alles runterrockt. Immer wieder schnell zu lesen, immer wieder sehr inspirierend. Da fühlt man sich ab und zu ein bisschen schlecht, muss ich zugeben."
    },
    {
      "end": 4462590,
      "speaker": "C",
      "start": 4458470,
      "text": "Ja, aber nur damit der Graf grün wird. Das ist ja der einzige Grund eigentlich, oder?"
    },
    {
      "end": 4469720,
      "speaker": "A",
      "start": 4462670,
      "text": "Das hast du gesagt, nicht ich. Von daher, Sebastian. Sebastian, nochmal vielen lieben Dank für deine Zeit und wünsche dir noch Einen schönen Tag. Bis später. Tschüss."
    },
    {
      "end": 4471080,
      "speaker": "B",
      "start": 4469720,
      "text": "Danke für das nette Gespräch."
    },
    {
      "end": 4471640,
      "speaker": "C",
      "start": 4471080,
      "text": "Ciao."
    }
  ],
  "webhook_auth": false
}