{
  "acoustic_model": "assemblyai_default",
  "audio_duration": 4439,
  "audio_url": "https://cloud.inlupus.at/s/E8ZaQTRBPEc9GMm/download",
  "auto_chapters": false,
  "auto_highlights": false,
  "auto_highlights_result": {},
  "confidence": 0.96202296,
  "content_safety": false,
  "content_safety_labels": {
    "status": "unavailable"
  },
  "custom_topics": false,
  "disfluencies": false,
  "dual_channel": false,
  "entity_detection": true,
  "filter_profanity": false,
  "format_text": false,
  "iab_categories": true,
  "iab_categories_result": {},
  "id": "5fee83ea-4613-4bc9-9d29-8f7cb9ef4c0f",
  "language_code": "de",
  "language_detection": false,
  "language_model": "assemblyai_default",
  "punctuate": true,
  "redact_pii": false,
  "redact_pii_audio": false,
  "sentiment_analysis": false,
  "speaker_labels": true,
  "speakers_expected": 3,
  "speed_boost": false,
  "status": "completed",
  "summarization": false,
  "throttled": false,
  "utterances": [
    {
      "end": 84530,
      "speaker": "A",
      "start": 3280,
      "text": "Herzlich willkommen zu einer neuen Podcast Episode vom Engineering Kiosk. Unsere Episode ein und fünfzig Was ist das Staff Engineer Level ist eine unserer erfolgreichsten Evergreen Episoden. Auch sonst bekommen wir recht viel Feedback und Fragen zu dem Thema Karriere als Individual Contributor und ob Management der einzige Ausweg ist. Grund genug, mal eine Episode zu dem Thema Karrierepfade für Softwareentwickler innen zu machen. Mit Hilfe von Lena Reinhardt klären wir, woher Karrierepfade eigentlich kommen, wie man diese designt und worauf es dabei ankommt, wie ein Karrierepfad in einer Firma eingeführt werden kann und ob bzw. Wie solche Karrierepfade in der Praxis missbraucht werden, aber auch, warum die Kommunikation von Erwartungen für Menschen eigentlich so schwierig ist. Wir springen rein, los geht's. Wer uns schon öfter zuhört, der weiß, dass wir hier und da mal über Karrierepläne, Karriereleiter, Senior Engineering und Staff Engineering sprechen. Immer in diesem Kontext erwähnen wir eine Karriereleiter, eine Matrix, die zumindest mich sehr geprägt hat. Und die wurde damals von Circlec veröffentlicht. Ich glaube im Jahre zwei tausend fünfzehn wenn ich das richtig im Sinn habe, zwei tausend achtzehn sogar. Auf jeden Fall habe ich diese auch mal mit ein paar anderen Engineering Manager Kollegen versucht bei Trivago einzuführen. Wir waren nicht ganz so erfolgreich, ich."
    },
    {
      "end": 85970,
      "speaker": "B",
      "start": 84530,
      "text": "Kann mich noch dunkel daran erinnern."
    },
    {
      "end": 209880,
      "speaker": "A",
      "start": 86760,
      "text": "Wir haben uns gedacht, okay, da schwirren jetzt inzwischen so viele Karriereleiter für Individual Contributor im Internet herum, aber warum sind die alle unterschiedlich und wieso muss jeder seine eigene haben und so weiter und so fort. Umso mehr darüber ich nachgedacht habe, umso mehr Fragen hatte ich. Deswegen bin ich sehr, sehr stolz, dass wir heute eine Schlüsselfigur dieser Circlec Matrix, dieser oft geteilten Circlec Matrix im Podcast haben. Und deswegen bin ich sehr stolz, Lena Reinhardt zu begrüßen. Hallo. Hallo Lena. Für die Leute, die dich nicht kennen, weil wenn ich nämlich diese Circlec Karriereleiter, Karrierematrix aufmache, dann steht da oben nicht dein Name. Deswegen wird er vielleicht vielen Leuten nicht sagen. Aber du warst mal Vice President of Engineering bei Circlec und auch bei Travis, bevor sie, glaube ich, dem ganzen Open Source Bereich den Rücken gekehrt haben. Du bist seit ein paar Jahren selbstständig unterwegs und wenn man dein LinkedIn Profil öffnet, dann finde ich deinen Eröffnungs Pitch sehr schön, weil der resoniert sehr viel mit diesem Podcast, auch bei fünf und neunzig Prozent der Probleme von Technologieunternehmen geht es nicht um Technologie. Ich helfe ihnen, die Herausforderungen an der Schnittstelle von Geschäft, Technik und Mensch zu lösen. Das ist ja mehr oder weniger unser Credo hier auch. Du bist aktuell als Engineering Executive Leadership Coach und Mentor Facilitator, aber auch Keynote Speakerin unterwegs. Und da natürlich alles mit einem Fokus auf Coaching und Mentoring von Managern, von technischen Leadern. Du berätst Firmen auch im Bereich Produktivity und Effizienz und trainierst natürlich auch Teams mit einem Fokus auf Szenarien mit hohem Wachstum und starkem Wandel. Also Quote unquote. Ich glaube, Startup Environment und Co. Du stehst öfters mal auf den Bühnen dieser Welt. Ich habe Talks gefunden von der Lead Dev, eine sehr tolle Konferenz, die ich auch nur Senior und Staff Engineering Leuten ans Herz legen kann, aber auch bei der Velocity Konferenz. Du bist selbst Podcasterin. Leadership Confidential heißt dein Podcast, verlinken wir auch in den Shownotes. Aber jetzt kann man sagen, wow, was ein Profil, aber jedes Profil braucht ja einen Start. Und das hat mir ein Grinsen insgesamt sich gezaubert. Du hast angefangen bei der Kreissparkasse Heilbronn als Bankerin."
    },
    {
      "end": 217200,
      "speaker": "C",
      "start": 212040,
      "text": "Das ist erblast, sage ich immer. Ja, das ist tatsächlich wahr, das ist."
    },
    {
      "end": 222360,
      "speaker": "A",
      "start": 217200,
      "text": "Bodenankernd, das ist wunderschön, aber habe ich irgendwas vergessen? Stimmt das alles?"
    },
    {
      "end": 251290,
      "speaker": "C",
      "start": 223160,
      "text": "Das ist wahnsinnig schön so. Ich glaube, wenn ich mich in Zukunft irgendwo vorstellen muss, dann nehme ich einfach dich mit oder lese das vor, was du gerade so schön vorgetragen hast. War hervorragend. Danke. Ich hatte auch zwei tausend vierzehn dann meine eigene Firma noch gegründet. Wir haben im couchdb Bereich auch einiges gearbeitet. Neighborhood gmbh, Shoutout. Die gibt es auch heute noch. Also es fehlen einige Stationen. Ich habe auch mal Autojournalismus gemacht. Das steht nicht auf LinkedIn, aber das ist auch noch mal eine andere Kiste. Also hervorragend zusammengefasst. Vielen Dank."
    },
    {
      "end": 255370,
      "speaker": "B",
      "start": 251290,
      "text": "Und dann bist du im Engineering Leadership glücklich geworden nach diesen ganzen Stationen."
    },
    {
      "end": 268390,
      "speaker": "C",
      "start": 255450,
      "text": "Glücklich geworden ist ein Begriff dafür. Also ich mag die Arbeit sehr gerne. Ich bin da aber auch sehr, teilweise durch sehr schwierige Situationen auch sehr gewachse. Ich glaube, das mit dem glücklich kam dann nach einiger Zeit. Spaß gemacht hat es mir auf eine Art immer sehr."
    },
    {
      "end": 361300,
      "speaker": "B",
      "start": 328470,
      "text": "Jetzt hat Andi schon erwähnt, dass Circlec diese Matrix ja irgendwie so eine Vorbildwirkung hatte. Und ich kann mich erinnern, damals, wo wir diskutiert haben und auch im Internet so geschaut haben, wo können wir irgendwie Vorbilder nehmen, war circleci wirklich so dieser Leitstern. Und bis heute ist es eigentlich so ein Leitstern geblieben. Wir erwähnen den ja auch sehr oft. Jetzt meine Frage wäre, warum ist diese Matrix so bekannt? Ist es, weil ihr das damals einfach öffentlich gemacht habt als eine der ersten Firmen oder weil sie so gut ist oder weil du mitgewirkt hast? Was ist deine Einschätzung?"
    },
    {
      "end": 447580,
      "speaker": "C",
      "start": 361540,
      "text": "Es ist natürlich nur, weil ich dabei war sowieso, das war klar. Es war glaube ich so eine Mischung von Faktoren. Ich glaube eines war, dass wir relativ früh dran waren als Scale Up, also als ich bei Circle reinkam, das war Anfang zwei tausend achtzehn, da war Engineering so zwei vierzig ish Leute und wir waren da aber gerade davor eben in Scale Mode zu gehen, was halt auch hieß, dass wir eben dieses Tool dann benutzt haben, diese Matrix, um uns darauf so ein bisschen vorzubereiten. Und wir waren aber eines der frühesten Scale Ups meiner Erinnerung nach, die das gemacht haben. Und wir hatten halt auch relativ früh dann schon beschlossen, dass wir es eben Open Source haben wollen. Also ich komme ja auch so ein bisschen aus dem Open Source Bereich, die Philosophie dahinter war mir immer wichtig und gerade halt auch bei sowas. Und wir hatten dann, ich kannte glaube ich über eine Konferenz die Leute von Progression FYI, wir hatten uns irgendwie mal ausgetauscht und ich habe mich bei denen halt gemeldet und gesagt, hey, wir haben das Ding jetzt fertig, habt ihr Interesse, das bei euch auf die Seite zu packen? Und die wurden dann um dieselbe Zeit relativ schnell bekannt und so hat das, glaube ich, so ein bisschen so seinen Lauf angenommen. Ich glaube, ein Faktor war schon auch, dass es relativ strukturiert ist und relativ ausführlich war. Also da ging auch sehr viel Arbeit von einem sehr tollen Team rein und von sehr intelligenten Menschen. Ich glaube, die Kombination war es so ein bisschen plus einfach auch, dass das ja auch dann die Zeit war, als so richtig die Hypergrowth und Hiring Kultur wirklich zugenommen hat, gerade auch im Silicon Valley. Ich meine, Circus CI war und ist auch immer noch eine verteilte Organisation global. Ich habe ja auch von Berlin aus."
    },
    {
      "end": 457179,
      "speaker": "B",
      "start": 447580,
      "text": "Da gearbeitet, Da sieht man wieder mal, dass Open Source durchaus funktionieren kann und dass man auch wieder was zurückbekommt. Am Ende wahrscheinlich. Es hat doch viel Visibility auf jeden Fall gebracht."
    },
    {
      "end": 484230,
      "speaker": "C",
      "start": 457260,
      "text": "Ja, und das ist tatsächlich, also weil ihr das jetzt auch erwähnt habt, also ich kriege immer noch auch Nachrichten von Leuten, die sich einfach dafür bedanken oder die mal auf einer Konferenz auf mich zukommen. Mich ehrt das wahnsinnig großer Teil ist einfach auch, wie gesagt, da hing Team hintendran. Ich war halt dann nur diejenige, die einen der beiden Blogposts dazu veröffentlicht hat und das Projekt damals geleitet hat. Aber ja, also für mich ist das auch wahnsinnig schön, weil das schon was ist, wenn man sowas in die Welt rausschickt, wo man nie so genau weiß, was damit jetzt passiert und das so zurückkam."
    },
    {
      "end": 541780,
      "speaker": "A",
      "start": 484230,
      "text": "Also du wirst lachen, ihr habt die Matrix ja damals auf Google Sheets veröffentlicht und bei Google Sheets sieht man ja immer, wie viele Leute in dem Dokument sind und immer wenn sich, wenn ich diese aufmache, auch heute noch, turnen da Leute in diesem Dokument rum. Also es hat halt immer noch so sieben Jahre nach der Veröffentlichung. Und für die Leute, die Progression FYI nicht kennen, das ist eine Webseite, die eigentlich Karrierepfade für verschiedene Jobs, also ist nicht nur für Softwareentwickler und Softwareentwicklerinnen, sondern auch für Designer und so weiter veröffentlicht. Ich sag mal so ein Listing von Firmen, die ihre Karrierepfade veröffentlicht haben, verlinken wir auch in den Shownotes mal ganz interessant, wenn man abend rumsurfen möchte. Jetzt ist es aber so, wir springen jetzt hier in das Thema direkt rein, als wüssten wir schon oder als sagen wir, okay, das ist ein etablierter Begriff, Career Letter, Karrierepfade für ICS, für Individual Contributor. Lass uns die Leute mal ganz vorne abholen. Was versteht man konkret unter einer Karriereleiter oder einen Karrierepfad oder vielleicht sogar auch für individuelle Contributor?"
    },
    {
      "end": 611080,
      "speaker": "C",
      "start": 541780,
      "text": "Ich würde es super generalisieren auf, es ist de facto eine Beschreibung von Erwartungen an Leute auf einem bestimmten Job, auf einem bestimmten Senioritätserfahrungslevel und das in dieser Leiterform dargestellt im Sinne von, dass eben dadurch auch klar wird, was muss ich tun, um befördert zu werden, um aufs nächste Level zu kommen oder was wird von mir erwartet, wenn ich den Job wechseln will. Da gibt es ja auch die ganze Thematik mit. Gibt es parallel zum Beispiel zu dieser Leiter für Individual Contributors auch eine für Manager innen? Also das ist es eigentlich in a nutshell. Ich muss mir auch schon für wahrscheinlich viele Anglizismen entschuldigen, ich arbeite zu viel auf Englisch und Genau deswegen ist es eigentlich hauptsächlich Neujahr gewesen durchs Format. Also diese Leiterformate sind so richtig populär geworden in Text in den frühen er Jahren. Aber dieses Ding, du hast vorhin meinen Sparkassenhintergrund erwähnt, also auch ich hatte damals eine Jobbeschreibung, eine Rollenbeschreibung. Sparkassen waren ja historisch auf meinem TVD drin. Das heißt da gab es auch schon eine Progression drin. Da war dann immer klar, wenn jetzt mein Job in die nächste Rolle wechselt, was steckt da mit drin und so weiter. Also das Konzept ist nicht neu, aber das so in diese Leitern und auch wirklich dediziert mit so sieht Progression aus zu verpacken, war so ein bisschen die Neuerung."
    },
    {
      "end": 627540,
      "speaker": "B",
      "start": 611160,
      "text": "Und wann ist es ungefähr gekommen, dass das in der IC Welt wirklich Anklang findet oder dass, dass es IC Leitern gegeben hat, weil früher gab es ja irgendwie so maximal Senior und irgendwie war eh jeder Senior so nach einem halben Jahr gefühlt und dann war irgendwie Schluss und man hat nie irgendwie weiter gedacht."
    },
    {
      "end": 779630,
      "speaker": "C",
      "start": 627620,
      "text": "Meiner Wahrnehmung nach war das auch wirklich so um zwei tausend zwölf bis vierzehn rum, dass das so langsam angefangen hat. Zwei tausend fünfzehn dann die prominenteren Leitern, Foursquare hatte eine Rent the Runway hatte eine andere. Man muss das glaube ich auch in dem Kontext sehen, dass das halt auch die Zeit war, als der Personalmarkt super eng wurde und als viele, viele Fachkräfte im IT Bereich gebraucht wurden, ganz viele, viele Firmen in diese Hyperscale Mode gegangen sind. Geld war günstig, Venture Kapital wurde halt überall hingeschmissen, wo es nur ging und diese ganzen Firmen brauchten halt dringend Fachkräfte. Das heißt ein ganz großer Grund, wieso das so wichtig war, diese Leiter schon auch noch ist, war einfach als Tool für Motivation, um halt Leuten auch zu sagen, okay Mensch, wenn ihr bei uns arbeitet, gibt es eine Perspektive, wir haben uns da was ausgedacht, wir sind auch wir als Firma zeigen damit, dass wir gut drin sind, Erwartungen zu kommunizieren. Du weißt, wie Erfolg bei uns aussieht, was du dir unter dem Job vorstellen kannst und so weiter. Also diese quasi größeren Faktoren um einzelne Firmen rum sind da glaube ich super wichtig und dieses, dass eben dann gerade gutes Personal im Engineering so umkämpft war, war da ein Riesending. Ich glaube das Zweite, was auch noch wichtig ist, ist, dass das auch die Zeit war so auch so sagen zwei tausend zwölf onward war zumindest ab dann habe ich das so mehr mitgeschnitten, als das ganze Thema people centric Management dann wirklich ganz ganz groß wurde über die Zeit, wo auch gerade so Themen, die eigentlich in der Forschung, wir reden ja hier eigentlich viel über Personalmanagement, Personalführung, die Forschung hat das schon länger, gerade Themen wie auch Transformational Leadership, die dann viel viel prominenter wurden durch einige größere Veröffentlichungen. Das heißt die ganze Thematik ich als Manager in muss den Leuten, mit denen ich arbeite, den Leuten in meinen Teams irgendwie eine Perspektive bieten können, muss denen sinnvoll Feedback geben können denen helfen, sich weiterzuentwickeln. Und das ist halt nicht nur ein Job, sondern es ist auch was, was Teil deiner Karriere ist. So dieses Denken war da dann noch etwas neuer, weil wir da auch aus einer Zeit rauskamen, also zwanzig ich glaube zwei tausend zwei war das noch, als Google diese legendäre Studie gemacht hat mit irgendwie hey, wir brauchen gar keine Manager innen mehr bei uns diese ganzen Rollen abgeschafft hat und das halt gnadenlos nach hinten losgegangen ist und wo halt dann zu dem Zeitpunkt zwei tausend zehn ist dieses Bewusstsein mit okay, es sollte nicht jede Engineer Manager in werden müssen, weil das einfach ein anderer Job ist, ein Job, der auch andere Fähigkeiten erfordert. Für Engineering muss es eben auch eine dedizierte Entwicklungsmöglichkeit geben, die über jetzt werd halt mal Manager hinausgeht. Also ich glaube diese ganzen Faktoren spielen da auch alle so zeitlich mit rein und sind da super wichtig."
    },
    {
      "end": 838780,
      "speaker": "A",
      "start": 780030,
      "text": "Früher hieß es ja, wenn ich Karriere machen möchte, muss ich ins Management gehen. Diese erleichtern, so wie ich dich jetzt verstehe, reduzieren diesen Bedarf eher. Also du musst nicht ins Management gehen, um Karrieren zu machen. Ich frage mich aber dennoch, weil du sagtest, das hatte so zwei tausend zehn zwei tausend zwei tausend zwölf angefangen. Natürlich das war so eine Zeit, wo sehr sehr viele Länder auch online kamen und mehr und mehr Leute online kamen und Facebook und allem drum und dran populär wurde so weiter. Auf der anderen Seite muss man natürlich sagen, warum erst zwei tausend zehn zwei tausend zwölf denn Softwareentwicklung gibt es ja schon etwas länger. Er hatten wir die Dotcom Bubble, also da gab es ja schon einen Hype, einen Internet Hype, einen Computer Hype, Personal Computer wurden wurden günstiger und so weiter. Hast du selbst eine Theorie, warum das erst zehn, zwölf Jahre später kam, denn im Endeffekt, da waren ja auch Leute, die hatten schon zwanzig Jahre Berufserfahrung und ich hoffe oder denke, dass sie auch Karriereambitionen hatten und vielleicht nicht ins Management gehen wollen. Also warum erst zehn oder zwölf Jahre später?"
    },
    {
      "end": 919220,
      "speaker": "C",
      "start": 838780,
      "text": "Ich glaube, das Skalierungsthema ist da einfach der Riesenfaktor. Also es war gerade so um zwei tausend rum, dass auch das ganze Thema agile Softwareentwicklung wirklich noch mal groß wurde. Die ganzen Konzepte dahinter sind ja auch schon deutlich älter, aber dass das wirklich in Teams viel mehr angewendet wurde auch. Das heißt, du hattest dann als Grundlage das um zwei tausend zehn rum fing auch das ganze Thema DevOps Culture an, wo es halt auch noch mal viel, viel mehr ging um selbstorganisierte Teams, die ihre Expertise wirklich auch nutzen und einbringen, wo dann eben das ganze Thema, wie motiviert man diese Leute, was bringt man da mit, wie kommuniziert man Vision und Strategie und sowas, wo das alles plötzlich ein viel, viel größerer Faktor wurde, wo dann auch damit viel mehr ein Bewusstsein noch mal kam, es braucht da Leute, die sich auch drum kümmern, die dafür Interesse haben, die die Fähigkeiten haben. Plus wir kamen halt aus in der Zeit auch gerade aus der Finanzkrise raus. Also klar, Dotcom Bubble war schon Anfang der er geplatzt, aber dann war halt auch erstmal nicht wirklich viel Geld da, auch nicht für den Tech Bereich, gerade dann, als die Finanzkrise noch mal war, dass die halt auch gerade in den USA wirklich heftig getroffen hat, auch viele Unternehmen dort. Das heißt, ab zwei tausend zehn fing das, dann war so glaube ich die Erholungsphase etwas stärker und dann gingen wir eben relativ schnell auch in den Modus mit Hypergrowth und jetzt muss alles so groß wie möglich und so schnell wie möglich werden, was dann halt auch eine Komplexität mit sich bringt, die organisiert werden muss. Oder wenn man es halt ganz einfach sagen will, irgendjemand musste halt Interviews führen, um die ganzen Leute einzustellen."
    },
    {
      "end": 951550,
      "speaker": "A",
      "start": 919540,
      "text": "Wenn man solche Karriereleitern mal anschaut, dann fängt es irgendwie an bei Junior Software Engineer und dann gibt es den Software Engineer, ich würde mal sagen Mittel Software Engineer und dann den Senior, oder dann gibt es Staff Principal Distinguish teilweise, dann gibt es dann noch Senior Principal und Senior Distinguish, also da gibt es ja Ausarbeitungen noch und nöcher, wie viele Levels man hat. Ist das überhaupt alles notwendig mit diesen Custom Levels oder kann man auch einfach sagen Level eins bis Level zehn, so wie in einem Videospiel. Also wie siehst du das?"
    },
    {
      "end": 955950,
      "speaker": "C",
      "start": 952430,
      "text": "CTO ist der Endboss in manchen Fällen."
    },
    {
      "end": 960030,
      "speaker": "B",
      "start": 957630,
      "text": "Im wahrsten Sinne des Wortes der Boss."
    },
    {
      "end": 1116170,
      "speaker": "C",
      "start": 961230,
      "text": "Stimmt, guter Punkt. Also ich habe da verschiedene Meinungen zu. Ich versuche es mal kurz zu halten. Also ein Faktor, den ich da schon sehe, ist, das werde ich wahrscheinlich noch ein paar Mal betonen, diese Karriereleitern sind halt ein Tool. Wie gesagt, bei meiner Sparkasse war das halt eine Jobbeschreibung. Das Konzept dahinter gibt es schon lange. Ursprünglich kam das alles mal aus dem Militär, wo es ja wirklich ganz, ganz klar abgegrenzte Hierarchien und so weiter gibt. Leitern sind da halt eine Implementierungsform von, die aber für sich alleine stehend auch nur bedingt funktionieren, glaube ich später auch noch ausführlicher drauf. Das heißt aber auch, dass die Frage halt ist, wieso brauche ich so ein Ding oder brauche ich so ein Ding überhaupt? Und ich würde es mal so sehen, dass ein Teil ist einfach, ich finde es super wichtig, dass Leute bei einer Firma mit einem Titel arbeiten und da rauskommen, der ihnen dann auch erlaubt, relativ selbst für sich sprechend zu erklären, was sie für einen Job hatten, wenn sie sich bei einer anderen Firma bewerben oder bei einer anderen Firma arbeiten wollen. Also es gab ja auch eine Zeit lang, also ich glaube so Mitte der Er gab es irgendwann mal diesen Trend zu diesen Fantasietiteln mit irgendwie, was weiß ich, Chief Reindeer oder was auch immer oder ja, also die Idee Ebene, wir machen das jetzt ganz anders und so. Ich kann den Charme davon auch nachvollziehen. Ich bin gar nicht mehr so spießig, wie meine Bankausbildung vielleicht suggeriert, Aber die Titel haben halt einfach eine Funktion darin, dass sie Leuten erlauben, über sich und ihre Arbeit zu sprechen auf eine Art, die andere Leute zumindest mal grundsätzlich verstehen. Das ist alles nicht standardisiert. So richtungsmässig ist man sich da, glaube ich zumindest so langsam etwas einiger, dass so was wie zum Beispiel Senior dann auch das Karrierelevel sein kann. Also dass man von da aus quasi nicht mehr weiter wachsen kann, in Anführungszeichen muss. So das ist eine Funktion, die ich glaube ich super wichtig finde, wo es einfach darum geht, was für Weichen stellst du dafür, dass deine Mitarbeitenden irgendwann auch woanders arbeiten können. Und da ist halt so was wie Level eins bis sechs schwierig, das andere ist schon auch, das geht in dieselbe Richtung, aber wenn zum Beispiel Recruiter auf LinkedIn gucken oder sowas, dann suchen die halt in der Regel auch nach Leuten mit einem bestimmten Titel, weil der Titel halt wiederum eine Bedeutung hat. Insofern finde ich es wichtig, da was zu haben, was aussagekräftig und was zumindest so dem Industriestandard ist ein wirklich großes Wort, aber was zumindest mal so der Richtung entspricht, in die andere Firmen gehen. Alles andere sind dann auch ganz schnell wirklich Details, die super schwierig werden. Ich meine, du hattest schon eine Leiter erwähnt, jetzt mit irgendwie dann, wo es dann Senior, so Engineer eins bis vier gibt und dann gibt es irgendwann Senior und was noch? Die Differenzierungen, die es da teilweise gibt, finde ich oft super schwierig, weil die in der Praxis auch nicht unbedingt handbar sind. Aber ja. Hat das deine Frage beantwortet?"
    },
    {
      "end": 1188720,
      "speaker": "A",
      "start": 1116330,
      "text": "Der andere Fall war jedoch bei Netflix eine ganze Zeit lang. Netflix hat bis Mitte zwei tausend zwei und zwanzig eigentlich nicht eine solche Leiter gehabt bzw. Keine öffentliche Leiter bzw. Keine öffentlich kommunizierte Leiter. Sie hatten jedoch nur Senior Software Engineers, wo natürlich dann auch die Gehaltsspanne, ich glaube mal variabel war. Mitte zwei und zwanzig sind sie aber davon weggerückt und haben gesagt, okay, jetzt führen wir auch Level ein und auch andere Titel. Eine der Begründungen war unter anderem, damit man vielleicht auch Junior Engineers heirn kann, die man so nicht hören hätte können, weil dann hätte man nämlich jemanden mit relativ wenig Erfahrung sofort als Senior eingestuft und dann hat man da Leute, die seit zwanzig Jahren Performance Optimierung machen, ganz tief im Linux Kernel oder wo auch immer und die sagen, ja, der ist ja den gleichen Titel wie ich. Also dann so Titel sind ja auch ein bisschen. Ja, ich würde sagen, ein Vergleich zu anderen. Wie siehst du diesen Netflix Fall? Ich bin mir bewusst, dass du wahrscheinlich den damals mitbekommen hast, von keine Titel zu jetzt Titel und was sagt das eigentlich aus über die Kultur von Netflix oder generell oder warum haben sie es denn gemacht? Wie ist deine Meinung dazu?"
    },
    {
      "end": 1206730,
      "speaker": "C",
      "start": 1189040,
      "text": "Ich glaube, über die Kultur bei Netflix könnte man alleine so eine Halbtagesfolge machen, Selbst als jemand, den noch nie da gearbeitet hat, wollte nur bei einem Punkt kurz nachhaken, weil meines Verständnisses nach war das Ganze, die könnten dann auch Juniors hiren, war eigentlich nur Spekulation, also ich weiß dazu nichts Konkretes, aber ja, ich wollte nur mal kurz nachfragen."
    },
    {
      "end": 1220250,
      "speaker": "A",
      "start": 1207210,
      "text": "Ja, also ich glaube, um den ganzen Fall wurde sehr viel spekuliert, weil der offizielle Blogpost, der war ein bisschen sehr mau, sagen wir mal so. Also auf Hacker News hat man es ab und zu mal so gelesen, das."
    },
    {
      "end": 1222410,
      "speaker": "C",
      "start": 1220250,
      "text": "Ist so meine, ja, fair enough."
    },
    {
      "end": 1231060,
      "speaker": "A",
      "start": 1222410,
      "text": "Also ich nehme Gutes an, sagen wir es mal so. Und ich hoffe, Netflix öffnet sich für Junior Engineers und deswegen hoffe ich, das war ein Grund, deswegen nehme ich das anders."
    },
    {
      "end": 1236660,
      "speaker": "B",
      "start": 1231060,
      "text": "Was wäre denn die Alternative, wenn es nicht so ein Grund gewesen wäre? Hättest du da irgendwie Ideen?"
    },
    {
      "end": 1343550,
      "speaker": "C",
      "start": 1236660,
      "text": "Ich muss sagen, meine Interpretation damals war eine andere und ist auch immer noch, das waren halt auch die Jahre, in denen Netflix plötzlich nicht mehr gewachsen ist, also in denen plötzlich die Subscriberzahlen ziemlich einfach eingebrochen sind und dieser krasse Wachstumstrend, den sie bis dahin sehr, sehr lange hatten, nicht mehr weiter angestiegen ist. Also es muss entweder kurz, ich glaube kurz danach gewesen sein, dass diese Zahlen dann erstmals publik wurden in Earnings Calls. Ich muss auch sagen, ich habe das damals eher so ein bisschen mit einem Augenrollen wegignoriert, nichts gegen Netflix, aber die haben sich ja auch mit dem berühmten Culture Deck von zwei tausend neun schon relativ stark positioniert im Sinne von so sind wir, so wollen wir arbeiten. Und ein wichtiger Teil davon, ich habe es euch auch hier reingeworfen, falls ihr es in die Show Notes packen wollt, ein wichtiger Teil davon war ja immer auch, dass sie einfach sehr, sehr, sehr, sehr, sehr hohe Erwartungen an alle Leute hatten. Das heißt, klar, alle waren irgendwie auf einem Level, aber es war halt auch an alle die Erwartung, dass sie entsprechend performen. Und man kann eine Firma so führen, ob ich das jetzt persönlich so machen würde oder nicht, ist eine andere Sache, ist auch nicht relevant jetzt in dem Kontext, aber das hieß einfach auch, dass da war jetzt nicht großartig, wie es halt bei anderen Firmen ist, von wegen, okay, wir haben jetzt hier Leute, die Senior sind und wenn die jetzt halt mal gerade irgendwie einen schlechten Monat oder ein paar schlechte Monate hatten, dann supporten wir die und gucken halt, kann man denen da wieder raushelfen, Sondern es war halt schon auch relativ schnell so, okay, wenn du jetzt nicht auf dem Level lieferst, dann gibt es da ein hundert andere Leute, die deinen Job haben wollen. Das heißt auch, also ich fand es interessantes, interessantes Signal, aber dadurch, dass eben die Kultur da immer schon sehr speziell war und man sich da schon zumindest aus meiner Wahrnehmung, auch durchaus was drauf eingebildet hat, also war schon sehr dediziert, auch sehr kulturgetrieben in der Hinsicht, habe ich da sonst jetzt nicht besonders viel Wichtiges irgendwie rausgelesen. Ich fand es irgendwie amüsant, aber also."
    },
    {
      "end": 1381710,
      "speaker": "B",
      "start": 1343550,
      "text": "Die waren ja auch immer sehr klar mit den Zielen, würde ich mal sagen, oder mit den Erwartungen, weil sie haben ja wirklich gesagt, wir hiren nur die Besten und wir haben nur die Besten und wer nicht die beste Person in dem jeweiligen Bereich ist, die Person fliegt. Und ich glaube, das war ja dann auch, dass die verantwortliche Sea Level dann irgendwie selbst gegangen wurde, die das eingeführt hatte oder so in diese Richtung. Aber gehen wir mal weg von Netflix. Wie würdest du denn jetzt, oder du hast ja eine Career Matrix designt auch oder mit designt. Was sind denn für dich so die Kernelemente, die so eine Career Ladder eigentlich haben muss und worauf muss man eigentlich achten?"
    },
    {
      "end": 1472860,
      "speaker": "C",
      "start": 1382350,
      "text": "Ich habe das tatsächlich auch danach noch mit einigen Firmen gemacht und habe dann noch bei einigen weiteren so ein bisschen beratend zur Seite gestanden. Ich muss sagen, eine Kernfrage ist immer, wofür soll diese Leiter eigentlich verwendet werden? Weil zum Beispiel, wenn es was ist, wo es darum geht, okay, wir haben jetzt schon eine relativ große Organisation, wir müssen jetzt mal so ein bisschen Standards einführen, dahingehend, was für uns eigentlich Performance heißt, auf welchem Level oder wir wollen Leute einstellen und viel mehr wachsen. Je nachdem, was da genau das Kernproblem ist, was gelöst werden soll, sehen die Implementierungen auch so ein bisschen anders aus. Also wenn es darum geht, Standards zu definieren, dann fängt man halt in der Regel einfach mal an mit den Levels, die jetzt schon da sind und guckt dann, wie weit kommt man da. Versus wenn es darum geht einzustellen, dann ist es ja häufig auch so, dass quasi Levels besetzt werden sollen, die es so noch nicht gibt, was schon mal eine andere Thematik ist. Ich glaube, die Systeme nenne ich es jetzt mal nicht alles. Manche sind dann Matrizen, andere sind irgendwie im Framework Style. Die, die ich am nützlichsten finde, haben aus meiner Sicht die Levels drin. Levels auch mit Titeln. Es gibt eine Kurzbeschreibung zu jedem Level. Also manche der Sachen, die ich jetzt sage, gibt es auch in der circleci Matrix nicht. Das sind dann Dinge, die ich immer hinterher auch gelernt habe, die helfen können. Der dritte Punkt sind Beispiele für Verhalten. Das kann auch super hilfreich sein. Und dann gibt es eben noch eine Kurzbeschreibung davon, was jetzt genau die Fähigkeit beinhaltet. Das sind eigentlich die Grundanforderungen und ich würde auch sagen, je simpler man das halten kann, umso besser, weil so ein Ding halt sehr schnell wahnsinnig komplex wird."
    },
    {
      "end": 1494360,
      "speaker": "B",
      "start": 1473260,
      "text": "Jetzt hast du schon erwähnt, bei der Bank war das nur so eine Job Description oder so eine Beschreibung. Wo unterscheidet sich jetzt eine Career Ladder zu der reinen Jobbeschreibung? Und vielleicht noch gleich, ist die Hierarchie in irgendeiner Form auch in so einer Ladder definiert oder ist es für dich dann klar auf einer anderen Ebene oder in einem anderen System, falls es überhaupt Hierarchie gibt?"
    },
    {
      "end": 1518340,
      "speaker": "C",
      "start": 1494360,
      "text": "Auch immer gute Frage. Ich glaube, Hierarchie gibt es so oder so. Die Frage ist immer nur, ob man die sichtbar macht oder nicht oder wie explizit man damit ist. Also ich würde sagen, wenn es eine Hierarchie gibt in irgendeiner Form, dann solltet ihr in der Leiter drin sein. Deswegen ist es guter Punkt, dass du es ansprichst und sei es halt nur darin, dass es irgendwie dann Level von eins bis N gibt und Level eins ist halt Junior und das war der andere Teil deiner Frage. Sorry."
    },
    {
      "end": 1520460,
      "speaker": "B",
      "start": 1518340,
      "text": "Wie sich zur Bank unterscheidet, Job Description."
    },
    {
      "end": 1588760,
      "speaker": "C",
      "start": 1520700,
      "text": "Das ist tatsächlich eine gute Frage, weil ich glaube eigentlich nicht wirklich. Der große Vorteil bei diesen Leitern ist halt, dass in der Regel auch visuell einfach so gestaltet ist, dass man möglichst viel auf einen Blick hat und halt sieht, okay, wie unterscheidet sich mein Job jetzt von meinem Job eins drüber oder von dem Job, den irgendwie mein Tech Lead im Team hat. Man könnte das auch alles überlappend gestalten und könnte halt sagen, okay, wir haben jetzt hier diese Karrierematrix und da steht eigentlich auch schon alles drin, was der Job beinhaltet. Ich finde es ehrlich gesagt im Sinne der Simplizität auch gut, das so zu halten, während halt dann eben die normalen Rolle and Responsibilities, Dokumente oder sowas dann in der Regel einfach quasi nur Blick auf das eigene oder das aktuelle Level haben. Das ist so der Unterschied. Und das ist auch das, wieso diese Karriereleitern irgendwann, also ich hatte das tatsächlich selber mal noch nachgelesen in Vorbereitungen, die wurden schon Ende des neunzehnte Jahrhunderts populär und ursprünglich in Großbritannien und tatsächlich zufällig auch bei einer Bank. Und zwar eben, weil den Führungskräften da klar wurde, dass es halt hilfreich ist, wenn man Leuten so ein bisschen aufzeigt, wie ihre Beförderungswege quasi aussehen könnten über die Zeit."
    },
    {
      "end": 1636690,
      "speaker": "B",
      "start": 1589240,
      "text": "Jetzt hast du schon erwähnt, es gibt unterschiedliche Motivationen, warum man so eine Karriereleiter einführt. Ich kann mich erinnern, bei mir bzw. Meinem Team war das immer so, bei Trivago damals, wir waren ein tausend fünf hundert Leute und es hat keine Titel und nichts gegeben und alles in irgendwie, also oder vielleicht nicht alle so fünfzig Prozent, fünfzig Prozent waren glücklich, die anderen fünfzig Prozent waren so, ja, was mache ich, was schreibe ich meinen CV rein, warum bekommt der andere mehr bezahlt als ich und so die halt die Struktur wollten. Gibt es bei dir irgendwo so eine Größenordnung, wo du sagst, ab einer gewissen Größe sollte eine Firma auf jeden Fall sowas einführen oder gibt es Requirements? Wann sollte man sowas einführen? Wie lange kann man das Chaos regieren lassen? Und im kleinen Stile funktioniert es ja ganz oft in kleinen Start ups bis zehn Leuten oder so, da brauche ich wahrscheinlich keine Titel oder irgendwas anderes einführen."
    },
    {
      "end": 1783260,
      "speaker": "C",
      "start": 1636690,
      "text": "Tue mich tatsächlich damit auch schwer, würde aber grob sagen, ich habe ganz gute Erfahrungen gemacht bei Firmen, die so irgendwann zwischen fünfzig und ein hundert Engineers einführen und das muss keine Matrix in der Form sein, aber es sollte irgendein System geben, was halt codiert. So, das sind die Jobs, das sind die jeweiligen Titel dazu, das sind die Verantwortungsbereiche, die diese Leute dann haben. Spätestens wenn wir dann so Richtung Dunbars Number mit ein hundert fünf und zwanzig gehen, würde ich sagen, ist es auf jeden Fall hilfreich, weil du dann halt über den Punkt hinaus bist, wo jeder jeden kennt und wo dann halt einfach auch das Kalibrieren von Performance über die Organisation hinweg wirklich, wirklich schwierig wird. Also wenn du sagst, du möchtest eigentlich schon haben, dass die Leute so fair das eben geht behandelt werden und auch, dass die Erwartungen klar sind und dass es eben auch die selben Standards gibt und nicht irgendwie Leute bei einem Manager immer wieder die Beförderungen kriegen, während andere Leute für dieselbe Arbeit, die aber für jemand anderes arbeiten, halt irgendwie komischerweise das nicht bekommen. Also solche Sachen, die werden einfach, je größer die Firma wird, desto schwieriger werden die quasi manuell zu kontrollieren. Und da hilft es dann halt so ein System hinten dran zu haben, was außerdem noch dazu kommt, um den Punkt noch einzubringen, ist eine große Schwierigkeit, die es dabei immer wieder ist, quasi was du machst mit Leuten, die schon sehr lange da sind. Also gerade wenn du das Szenario hast, du hast Founding Engineers oder eben andere Leute im Team, die schon von quasi Kindertagen der Firma mit dabei waren. Wir waren zehn Leute und saßen um einen Tisch rum. Szenario. Idealerweise wachsen solche Leute mit der Firma mit und können dann lange dableiben, haben auch weiter Bock drauf, obwohl ihre Rolle sich dann natürlich auch massiv verändert. Gleichzeitig passiert aber oft auch, dass du dann irgendwann Leute reinbringst, die vielleicht einen ähnlichen Erfahrungshorizont haben, einfach noch mal andere Perspektiven mitbringen oder einfach auch die Situation, dass jemand sagt Mensch, ich hatte dazu auch selber schon Gespräche ganz oft mit gerade sehr, sehr Senior Engineers, also Staff plus Level, die halt sagen Mensch, ich habe irgendwie hier ganze Zeit lang saß direkt neben dem CTO, habe an denen reported, was eigentlich hauptsächlich hieß, wir hatten einmal im Monat ein Gespräch mit Wie geht es dir? Okay, cool, mach weiter so. Und jetzt reporte ich halt, jetzt bin ich plötzlich in einem Team und ich reporte an eine einen Engineering Manager, der irgendwie seit zwei Jahren im Job ist und nichts gegen den. Aber das ist halt ein komplett anderes Arbeiten. Und wenn dann quasi noch neue Leute reinkommen, dann wird eben die okay, was für Standards setzt du denn jetzt eigentlich und was erwartest du gerade von jemandem auf Staff Level oder drüber, wo es dann gerade halt auch oft kritisch wird, weil die Arbeitsweise sich einfach so ändert."
    },
    {
      "end": 1840830,
      "speaker": "A",
      "start": 1783740,
      "text": "Die Arbeitsweise ändert sich aber auch, wenn die Firma sich ja weiterentwickelt. Wenn ich jetzt von fünfzig Engineers auf fünf hundert Engineers skaliere, dann hoffe ich, dass die Arbeitsweisen der Leute sich ändern und vielleicht auch die Arbeitspraxis. Und deswegen frage ich mich natürlich, wie startet man eine solche Karriereleiter in Bezug auf Anzahl der Level? Also soll ich eher klein und minimal starten und wächst dann diese Karriereleiter agil mit der Firma, sofern das denn auch stattfindet? Das ist ja immer eine Frage, ob überhaupt und packe ich dann später Level eigentlich hinzu oder over inch ich das from the get go und sag okay, wir packen jetzt sieben Level rein, weil umso mehr Level man später dazu packt, dann muss man, ich sag mal, seine eigene Belegschaft ja wieder neu kalibrieren in diesen Levels Also du hast ja eine Endlosarbeit meines Erachtens in meinem Kopf gerade. Also gibt's da eine Rule of Thumb?"
    },
    {
      "end": 1859140,
      "speaker": "B",
      "start": 1840830,
      "text": "Ja und vor allem müsste man dann wieder Downleveln anfangen, weil wenn die Firma vielleicht wächst, dann ist ja irgendwer, der davor Senior war, eigentlich kein Senior mehr. Das ist ja so der Klassiker. Wenn man zu einer größeren Firma geht, steigt man meistens irgendwie tiefere Levels wieder ein. Aber was ist, wenn man bei derselben Firma bleibt, die Firma aber wächst und man selber irgendwie nicht mitwächst? Also ist ja auch so ein Problem."
    },
    {
      "end": 1989200,
      "speaker": "C",
      "start": 1859140,
      "text": "Einfach per Policy nicht erlauben. Das ist die einfachste Lösung für das Problem. Also ich würde es mal so grundsätzlich, je simpler, desto besser. Ich bin tatsächlich, was das angeht, auch noch super happy mit dem, was wir damals bei Circle gemacht haben, weil das war so eine Minimalanforderung. Da gab es es glaube ich, alle Level, die wir in der Matrix drin hatten, auch vertreten zu der Zeit in der Firma. Es hat es natürlich auch so ein bisschen einfacher gemacht, aber die Versuchung des Over Engineering ist immer da. Ich kann die auch sehr gut nachvollziehen. Ich würde aber echt sagen, lasst die Finger davon, wenn es geht, einfach weil es macht keinen Sinn, das Problem, da kommen wir bestimmt auch noch im Detail drauf. Das Problem ist sowieso immer schon dann grad zu finden zwischen Abstraktion und Granularität und auch konkretem Inhalt. Das heißt aber auch, wenn du Level drin hast, die gerade in der Firma überhaupt nicht existieren, dann hast du gar kein Beispiel, an wen du es eigentlich festmachen kannst. Und dann wird es halt eine absolut theoretische Übung, die ehrlich gesagt keinen Sinn hat, weil halt auch, sorry, aber keine Sau das Level braucht. Das heißt, ich würde mich darauf konzentrieren, was haben wir eigentlich an Levels schon da. Und wenn jetzt eben der Verdacht ist mit so, Mensch, wir haben da vielleicht ein paar Leute, die gerade einen Titel haben, der zu niedrig ist oder zu hoch, okay, dann muss man wahrscheinlich die Level drüber oder drunter halt auch noch angucken und ausdefinieren. Ich würde auch sagen, mein Eindruck ist schon von den Inhalten an diversen Matrizen, die ich jetzt kenne, gerade so die Sachen, die auf Progression FYI sind, dass das schon relativ in dieselbe Richtung geht, wie dann auch Titel definiert sind. Das heißt auch so das Minimum Viable Product Prototype sogar und damit mal arbeiten, idealerweise sogar für ein Jahr. Und wenn es dann halt nicht reicht, dann kann man immer noch mal dran. Das Problem ist einfach aber auch, dass so ein Projekt ist sowieso schon echt zeitintensiv und echt kostenintensiv. Und in meiner Idealversion wäre es natürlich super, wenn sich da dann einmal im Jahr jemand dran setzt und guckt, Mensch, passt das noch so? Müssen wir Dinge ändern. Passiert in den seltensten Fällen und ich sage das nur, weil ich es, glaube ich noch nie erlebt habe, aber ich habe einfach die Hoffnung stirbt zuletzt. Also da ist einfach wenig Kapazität für. Das heißt auch natürlich der Druck, das da möglichst richtig zu machen von Anfang an, ist auch wahnsinnig hoch, was es auch nicht einfacher macht. Deswegen ja, so simpel wie möglich."
    },
    {
      "end": 1998080,
      "speaker": "A",
      "start": 1989600,
      "text": "Habe ich dich richtig verstanden, dass du eigentlich gesagt hast, man sollte nur Level einführen, wo man, ich sag mal, die Leute auch bis jetzt schon hat."
    },
    {
      "end": 2056280,
      "speaker": "C",
      "start": 1998320,
      "text": "Kann sein, dass ich so gesagt habe, gut, dass du noch mal nachfragst, weil ich schon, es hängt so ein bisschen davon ab, was ich halt habe und wo ich mit der Firma hin will. Ich will auch nicht jede Frage beantworten mit da ist it depends, aber es ist eine gute Nachfrage. Wenn du natürlich jetzt gerade nur Du bist Netflix, du hast nur Senior Engineers, du willst davon wegkommen, dann brauchst du wahrscheinlich noch andere Levels in deiner Matrix. Ich spiele es mal andersrum. Was ich versuchen würde, ist zu gucken, wie sieht die simpelste Version davon aus, die dann auch eine Karriereprogression erlaubt. Das heißt sowas wie Junior Engineer, Senior Staff, Senior Staff, Principal von mir aus. Das sind jetzt auch die Sachen, die wir bei Circle hatten. Das wäre so eine rudimentäre Variante. Was ich vermeiden würde, ist sowas wie Senior eins, zwei, drei, Staff eins bis vier, also wo es dann auch noch zu jedem Level so Unterkategorien gibt, weil es da dann ganz schnell super granular wird auf einer Ebene, die meisten Firmen zu dem Zeitpunkt überhaupt nicht handeln können."
    },
    {
      "end": 2094420,
      "speaker": "A",
      "start": 2056360,
      "text": "Ich habe nämlich explizit dahingegen gefragt oder noch mal nachgefragt, weil wenn ich nämlich jetzt ein C Level habe und ich sage, okay, ich würde mir eine Gruppe von Leuten wünschen, die mehr Business getrieben denken, so Staff, Principal, Distinguished und so weiter, und man hat diese aktuell noch, dann kann man natürlich zwei Möglichkeiten fahren. Man kann sagen, okay, ich hole mir jemanden, der das kann und setze diesen Menschen als Vorbild, als Stereotypen in diese Firma oder ich baue mir diese Erwartungshaltung, dieses Karriere Level und habe noch niemanden, der da ist, um zu schauen, wer competet denn da um dieses Level und so weiter. Deswegen habe ich noch mal gefragt, okay."
    },
    {
      "end": 2097460,
      "speaker": "C",
      "start": 2094420,
      "text": "Absolut doof formuliert, gute Nachfrage."
    },
    {
      "end": 2133030,
      "speaker": "B",
      "start": 2097460,
      "text": "Jetzt sind wir eh schon im Prinzip genau in dem Thema drinnen, wie startet man mit so einer Matrix? Jetzt ist immer noch die Frage, wie führt man diese ein? Weil das ist der Klassiker. Ich habe jetzt noch keine, ich habe ein tausend fünf hundert Leute in der Firma oder vielleicht, keine Ahnung, auch nur drei hundert Leute in meinem Engineering Team und muss jetzt irgendwie was einführen und muss am Anfang entscheiden, wer bekommt welches Level. Also die Einführung stelle ich mir ja sehr, sehr schwierig vor und du hast da sicher mehr Erfahrung. Also auf was muss man denn achten, wenn man das Ganze einführt, ohne dass man achtzig Prozent seiner Leute einfach verliert, weil sie danach kündigen."
    },
    {
      "end": 2346980,
      "speaker": "C",
      "start": 2134710,
      "text": "Guter Zusatz. Mein Rat wäre auf jeden Fall, das ganze Thema so partizipativ wie möglich zu gestalten, weil eine große Schwierigkeit dabei ist. Ein Grund, wieso sowas eingeführt wird, ist natürlich immer, dass die Firma Performance messbarer machen möchte und auch mehr wissen möchte, okay, wie halten wir denn unsere Manager innen dran, dass sie das auch quasi durchsetzen. Also da ist schon auch quasi der HR Angle drin. Aber aus meiner Erfahrung ist natürlich, gerade wenn sowas Engineering getrieben ist und Engineering Managerinnen oder Tech Leads oder so, hey, wir möchten, das ist natürlich ganz oft eigentlich das primäre Interesse, wir möchten unseren Mitarbeitenden Perspektive aufzeigen können, wir möchten mit denen Karriereentwicklungsgespräche führen können, besseres Feedback geben können und so weiter. Also alles, was eher so aus der Entwicklungsebene kommt. Das Problem ist aber, dass ganz viele Leute mit solchen Dingen auch schlechte Erfahrungen gemacht haben und auch dann zu Recht oft große Sorgen haben oder Ängste aufkommen. Und auch, dass wie bei allen Tools ist halt die Einführung das eine, wie das Ding dann wirklich hinterher verwendet wird, das ist nochmal eine ganz andere Kiste. Das heißt auch, also selbst wenn du als Manager in da mit der besten Motivation rangehst, musst du dich halt von Anfang an darauf einstellen, dass Leute das wahrscheinlich nicht direkt so wahrnehmen, selbst wenn sie dich gut kennen und dir vertrauen und was auch immer, sondern dass da erst mal große Sorgen und Ängste auch dran geknüpft sind. Das heißt auch aus dem Grund wäre meine Empfehlung immer zu gucken, kann ich das partizipativ machen. Wir hatten damals bei Circle, es gibt da auch einen Blogpost dazu, wo wir darüber geschrieben hatten, wie wir das dann gestaltet haben. Mein Kollege Justin Kauferthwaite, der da mit involviert war, hat das aufgeschrieben. Wir haben dann von Anfang an eine Arbeitsgruppe gestaltet, also wir hatten einen Aufruf gemacht an alle Leute im Engineering und hatten Hey, hier ist was wir vorhaben. Wir wollen quasi unsere Karrieresystematisieren und haben eben gesagt, wer Interesse hat daran mitzuarbeiten, melde sich bitte. Und wir hatten eine ganz gute Mischung, was uns auch wichtig war, aus Leuten aus verschiedenen Levels, also von sehr erfahrenen Leuten auf Indie Staff oder sogar Senior Staff Level bis hin eben zu Juniors, Karriereeinsteiger innen. Ich glaube, ich kann gerade die Zahlen nicht mehr so richtig im Kopf. Ich glaube, wir waren dann so fünfzehn Leute. Wir hatten auch versucht die Working Group nicht explodieren zu lassen. Das heißt haben auch geguckt, dass wir quasi von verschiedenen Teams Leute drin haben, einfach mit dem Ziel hintendran möglichst viele Perspektiven zu repräsentieren und gleichzeitig auch sicherzustellen, dass Leute dann auch mit ihren Teams noch mal drüber sprechen können und die damit einbinden können. Das hat als Ansatz aus meiner Sicht ganz gut funktioniert. Ich muss dazu sagen, dass es natürlich den Projektmanagement und Koordinationsaufwand recht hoch macht. Wir hatten so ein bisschen auch den Vorteil, dass Circlec zu der Zeit schon, es war ja von Anfang an eine verteilte Firma, das heißt, wir hatten auch von Anfang an eigentlich ganz gute Übungen schon drin, solche Sachen auch asynchron zu bearbeiten mit dann ab und zu Meetings, was da wirklich hilfreich war. Es war dann viel in Dokumenten, die dann umgeschickt wurden mit Lasst mal Kommentare da und was auch immer und haben uns dann regelmäßig getroffen, um uns auszutauschen über den nächsten Stand, nächste Schritte. Ein wichtiger Teil davon war auch, dass wir von Anfang an HR sehr eng mit eingebunden hatten. Wir hatten einen ganz tollen Personalleiter damals, David und der hatte also war da sehr auch selber involviert und war begeistert von dem Projekt und hat das auch so mit gesponsert quasi und der quasi das Backing von Anfang an zu haben und halt zu wissen, das ist okay von deren Perspektive und wird dann auch eingegliedert in die Prozesse, die die nutzen, halt auch hilfreich, weil wir natürlich auch vermeiden wollten, dass wir doppelte Arbeit für Leute machen oder es dann plötzlich irgendwie sowas gibt wie ein offizielles HR Performance Management Ding. Und dann gibt es irgendwie noch die Engineering Variante, was das natürlich nur noch komplexer und verwirrender gemacht hätte."
    },
    {
      "end": 2350020,
      "speaker": "B",
      "start": 2347220,
      "text": "Und wer hat wirklich die Einstufung übernommen?"
    },
    {
      "end": 2430490,
      "speaker": "C",
      "start": 2351220,
      "text": "Da kommt jetzt raus, dass es wirklich schon eine Weile her ist. Also ich kann dir sagen, wie wir es in anderen Projekten, Projekten gemacht haben. Ich glaube nicht, dass es besonders anders war. Ich kann es dir gerade nicht mehr so ganz konkret sagen. In der Regel mache ich es so, dass es wie ein Kalibrierungsgespräch läuft, also dass sämtliche Leute in Managementpositionen involviert sind, dass es aber auch Input gibt von Leuten, die sehr senior sind auf technische Seite, also was wie Tech Leads oder Leute drüber, die halt einfach auch eine gute Perspektive haben drauf und dass man sich dann ausführlich zusammensetzt und guckt, wo landen die Leute. Ich muss auch dazu sagen, dass es in der Regel relativ wenig kontrovers war und dass eigentlich so die Richtung, die sowieso schon da war, dass am Ende auch, dass man sich da relativ schnell einig war und auch dann mit den Engineers selber, die davon betroffen waren quasi von dieser Einstufung. Es gibt eigentlich immer ein paar Fälle, wo dann Leute nicht verstehen, wieso sie jetzt auf einem bestimmten Level landen oder wieso sie eine bestimmte Einstufung bekommen. Das ist in der Regel dann aber auch was, wo sagen würde, das Thema wäre so oder so aufgetreten. Das ist dann halt auf Basis das Thema, wir führen jetzt den Karriereleiter ein. Das ist dann halt so ein bisschen der Auslöser oder Trigger dafür, weil das dann halt einfach Leute schon waren, die entweder ein bisschen Schwierigkeiten hatten, die Rolle zu finden oder wo es Performance Schwierigkeiten gab oder einfach auch, wo die Managerin irgendwie nicht so eine richtige, nicht dieselbe Wahrnehmung hatte, wie die Person selber von ihrer Leistung, was ja auch ein wichtiges."
    },
    {
      "end": 2459720,
      "speaker": "B",
      "start": 2430490,
      "text": "Signal ist, Aber das ist dann immer ein Gremium oder du empfiehlst, es ist nicht nur eine Person, die Managerin, sondern wirklich immer ein Gremium und wird es dann schriftlich wirklich kommuniziert, Also wird er dann irgendwie geschrieben, du bist Level zwei, weil und du bist nicht Level drei, weil oder so in diese Richtung, weil das ist eigentlich immer das Schwierigste eigentlich dann die Kommunikation und auch das Festschreiben, weil dann ist es schwarz auf weiß und die Leute können dann rumspringen und sagen, die glauben, dass ich das nicht schaffe oder das Projekt war zu unwichtig."
    },
    {
      "end": 2525010,
      "speaker": "C",
      "start": 2460600,
      "text": "Das ist in der Regel schriftlich. Also ein Teil davon hängt auch einfach davon ab, was genau dann die rechtlichen Voraussetzungen sind, je nachdem, wo die Person, in welchem Land die Person einen Arbeitsvertrag hat. Meine Perspektive ist halt, das mit internationalen Teams zu machen, wo dann halt auch im Zweifelsfall du irgendwie achtzehn verschiedene, nicht ganz so viele, aber verschiedene Varianten brauchst von wie genau dann der Vertrag aussehen muss oder wie das schriftlich festgehalten wird und so weiter. Aber grundsätzlich würde ich sagen, immer schriftlich, einfach allein schon um Klarheit für alle Beteiligten zu schaffen und das auf jeden Fall mit HR abgestimmt und auch also immer im Gremium, weil einfach natürlich ein Grund, wieso man solche Dinge überhaupt einführt, ist die Idee, dass man Biases und andere irgendwie Vorideen davon, die wir halt alle mit uns rumtragen, auch über die Leute, mit denen wir arbeiten, dass die so ein bisschen ausgeglichen werden und dafür braucht es das. Es braucht dann aber auch die Weiterführung davon, also über Calibrations, dann auch in weiterem Performance Management, die Jahre danach, also nicht nur bei der Einführung, sondern auch später, weil natürlich wir einfach alle unterschiedliche Perspektiven haben auf Leute und nicht immer die Objektive, soweit Objektivität in dem Fall überhaupt gegeben sein kann."
    },
    {
      "end": 2539640,
      "speaker": "B",
      "start": 2525560,
      "text": "Jetzt hast du schon viel gesehen, wie viel Prozent oder mit wie viel Prozent muss man rechnen, die dann unglücklich sind am Ende? Also ist das irgendwie so nur ein Prozent oder muss man rechnen, dass dreiig Prozent einfach nicht zufrieden sind? Das heißt ja noch nicht, dass sie kündigen, aber dass sie zumindest irgendwie unzufrieden."
    },
    {
      "end": 2622250,
      "speaker": "C",
      "start": 2539640,
      "text": "Sind, ist natürlich immer so ein bisschen die Frage. Also ich war in diesen Projekten immer involviert, entweder als externe Beraterin oder dann als relativ Senior Führungskraft, inwieweit Leute mir dann persönlich noch sagen, dass sie das gerade alles total doof finden, was die da machen, muss ich halt auch leider sagen, weiß ich nicht. Aber ich sage das einfach nur, weil ich weiß, dass meine Perspektive da dann weiter weg ist nach allem. Also wir haben dann auch diverse Umfragen immer wieder gemacht mit Leuten und hatten natürlich auch das Thema, wie verstehst du deine Karriereentwicklung und sowas auch in mindestens vierteljährlichen Employee Surveys, also dazu Daten zu kriegen, war uns schon wichtig. Ich habe eigentlich jetzt in allen Projekten, die ich dazu gesehen habe, würde ich sagen, vielleicht fünf bis zehn Prozent, wo wie gesagt dann aber, also wenn es nicht das Framework gewesen wäre, dann wäre es irgendwas anderes gewesen. Zeiten, wo es halt einfach quasi dann ein Mechanismus ist, der solche Themen, die schon da sind, sichtbar macht. Aber ja, ich würde sagen, man sollte schon damit rechnen, dass es nicht alle Leute super gut finden von Anfang an. Einfach auch, weil es eine große Veränderung ist, die für Leute wirklich auch Impact haben kann. Deswegen ist es halt auch hilfreich, wenn man sowas relativ früh schon macht als Firma, weil man dann einfach das nicht bei nicht so vielen Leuten wie noch retroaktiv irgendwie aufrollen muss. Es sei denn, man möchte das natürlich, man kann sowas auch, finde es nicht gut. Aber ich habe auch schon gehört von Fällen, wo Firmen das dann halt nutzen, um Leute scharenweise rauszumanagen. Ist eigentlich nicht Sinn der Sache und auch unschöne Art, aber passiert."
    },
    {
      "end": 2636570,
      "speaker": "A",
      "start": 2622330,
      "text": "Du hast ein paar sehr, sehr spannende Aspekte angesprochen. Auf der einen Seite fünf bis zehn Prozent Leute, die unglücklich sind, finde ich sehr niedrig, muss ich zugeben. Also es ist natürlich Change Management, wie bei allem, würde ich mal sagen, aber."
    },
    {
      "end": 2641780,
      "speaker": "B",
      "start": 2636570,
      "text": "Fünf bis zehn Prozent sind bei dir die Leute immer unglücklicher. Andi, hast du immer fünfzig Prozent gegen dich gehabt oder warum ist das niedrig?"
    },
    {
      "end": 2674050,
      "speaker": "A",
      "start": 2642180,
      "text": "Ich habe ja noch nie eine Karriereleiter eingeführt, deswegen kann ich da nicht drauf antworten, Tut mir leid. Ne, aber was ich da sagen möchte, ist, dass natürlich im Vorhinein schon sehr viel gutes Expectation Management gemacht werden muss auf der einen Seite. Dann die andere Seite, ich glaube, du kannst bei einem solch großen Wechsel einfach gar nicht alle glücklich machen, so brutal wie das klingt. Die zweite interessante Beobachtung, die du geteilt hast, und die kann ich wirklich unterschreiben, ist verteilt und Remote Work. Remote Work ist zwar eine tolle Sache, aber wenn sie über Länder hinweggeht."
    },
    {
      "end": 2676370,
      "speaker": "C",
      "start": 2675890,
      "text": "Spaß."
    },
    {
      "end": 2688050,
      "speaker": "A",
      "start": 2676690,
      "text": "Unendlicher Spaß, legal und was man darf und was man nicht darf und wie, wo was geschrieben werden muss. Und ich weiß nicht, wer von euch sich schon mal mit verschiedenen Ländern und Rufbereitschaft, also wirklich on call auseinandergesetzt hat."
    },
    {
      "end": 2689010,
      "speaker": "C",
      "start": 2688130,
      "text": "Hör mir auf."
    },
    {
      "end": 2740730,
      "speaker": "A",
      "start": 2689090,
      "text": "Ja, das ist purer Horror. Also was darf man, wie muss die kompensiert werden und so weiter. Schweden ist ganz vorne dabei, aber nun Gut, du hattest gerade gesagt, ihr hattet eine sehr, sehr fähige Person in der HR, in der Personalabteilung, die das Ganze mit begleitet hat. Da kommt natürlich für mich die Frage, wer sollte eigentlich so eine Karriereleiter für die Software Engineering Abteilung leiten? Ist das jetzt der VP of Engineering? Ist das der CTO? Ist das vielleicht sogar der CEO die Personalabteilung? Aber jetzt, wo ich gerade die Frage Ist das nicht eigentlich generell der CEO? Weil wenn wir das jetzt für Software Engineers machen, dann frage ich mich okay, warum gibt es das nicht für Designer? Und dann nächstes Mal frage ich mich, warum gibt es das nicht Maurer? Klar, beim Maurer gibt es dann halt den Gesellen und den Meister und so, aber ich glaube, das sind halt zwei Level. Also du verstehst wer. Also ist das nicht eigentlich? Also ist das was Engineering Spezifisches? Das ist die Frage, glaube ich."
    },
    {
      "end": 2744570,
      "speaker": "B",
      "start": 2740970,
      "text": "Beziehungsweise erkennst du Firmen, wo das nur in Engineering eingeführt wurde?"
    },
    {
      "end": 2906210,
      "speaker": "C",
      "start": 2746410,
      "text": "Ja, kenne ich. Ein Teil davon ist tatsächlich, dass in einigen anderen Bereichen halt einfach die Erfolgsmessung sowieso schon viel klarer ist. Also guck dir Sales Teams so das ist so ein bisschen, ich sag mal, das krasseste Gegenbeispiel dazu, wo halt einfach auch Vergütung in der Regel über Verkaufszahlen läuft. Und in Software Engineering Teams hat man sich, glaube ich, auch gerade mit dem ganzen Thema wir arbeiten agil und das Ergebnis kommt aus dem Team und kann nicht unbedingt dann Einzelpersonen attribuiert werden und sowas. Da hat man sich im Engineering sehr lange auch drumherum gewunden und auch zu Recht, finde ich eben mit dem Gedanken, dass es nicht darum geht, irgendwie Hero Culture zu fördern und nur irgendwie die Top Entwicklerin und alle anderen sind egal, sondern eben Teamkultur, wo aber dann eben trotzdem klar wurde, es muss irgendwas geben, um auch klarmachen zu kö Was machen eigentlich Individuen? Welchen Teil leisten die dazu, dass dieses Team dann auch tatsächlich gut ist? Also deswegen, ja, ich kenne Firmen, die es nur für Engineers haben, die haben dann aber in der Regel auch so was wie sehr gute Jobbeschreibungen für Designleute oder sehr klare Rollenbeschreibungen für andere Bereiche, was halt viel davon abdecken kann. Gerade für Teams, wo es halt jetzt nicht diese krass ausdifferenzierte Rollenprogression gibt oder Jobprogression und auch die sehr unterschiedlichen Rollen, die da dranhängen. Also gerade wenn du gehst zum Unterschied zwischen so typischer Engineer versus Staff Engineer, das sind halt einfach auch eigentlich zwei unterschiedliche Jobs, die natürlich über Weiterentwicklung erreicht werden können. Versus in manchen Designteams gibt es halt Designerinnen, Senior Designer und dann gibt es noch Manager, wo es jetzt halt auch nicht diese krassen Sprünge oder noch mal diese großen Differenzierungen zwischendrin gibt. Das ist natürlich in ganz großen Firmen noch mal anders. Die haben dann auch die entsprechenden Frameworks dafür, aber gerade bei kleineren Teams nicht ganz ungewöhnlich. Also ich würde deswegen auch wenn es was ist, was im Engineering nötig ist, dann kann man das durchaus auch Engineering erstmal aus Engineering betreiben und muss das nicht direkt zum großen Aufriss für die ganze Firma machen. Es hat natürlich auch den Charme, dass man dann sagen so wir machen das beim Engineering und dann können wir daraus lernen und das für andere Bereiche noch interpretieren, wenn wir wollen. Und ich denke, also aus meiner Erfahrung ist es auf jeden Fall wichtig, dass Senior Engineering Führungskräfte da mit hinter stehen. Ob es dann VP ist oder ein CTO sollte auf jeden Fall da zumindest seinen Segen für geben und das Ding wir am Ende auch accountable dafür sein, von mir aus dafür, dass es eben passiert. Ob dann die Verantwortlichkeit darin, das zu implementieren und auszurollen, werden dann auch bestimmt andere Leute übernehmen. Also ich war damals, als wir das bei Circle gemacht hatten, war ich als Director eingestiegen. Justin, den ich erwähnt hatte vorhin, war ein Engineering Manager bei mir im Team und der VP, der mich eingestellt hat, war da schon auch federführend mit dabei. Ich habe das Projekt aber halt geleitet, aber ohne das Backing von meinem Chef wäre das auch gar nicht gegangen damals."
    },
    {
      "end": 2918450,
      "speaker": "B",
      "start": 2906210,
      "text": "Jetzt hast du kurz erwähnt, dass Engineering sich lange genug dagegen gestellt hat, gegen die ganzen Levels und zu guter Recht hast du glaube ich, als kommend dazu gesagt, jetzt haben wir eigentlich immer angenommen."
    },
    {
      "end": 2922810,
      "speaker": "C",
      "start": 2918610,
      "text": "Gegen so individuelle Attribuierung von Erfolg, aber."
    },
    {
      "end": 2949260,
      "speaker": "B",
      "start": 2922810,
      "text": "Jetzt haben wir ganz allgemein immer angenommen, so ein Karrierepfad, so eine Matrix ist super. Gibt es auch irgendwie Fälle, wo du sagst, es macht keinen Sinn oder gibt es Argumente auch gegen so eine Career Ladder? Und ich habe schon erwähnt, fünfzig Prozent der Leute wollten eine bei mir im Team, fünfzig Prozent, denen war es egal oder die waren froh, dass irgendwie alle gleich sind und da muss man da nicht competen und hat die Probleme mit diesen Levels und Titles und Gehältern und sonst irgendwas? Also wann macht es Sinn oder wann macht es keinen Sinn?"
    },
    {
      "end": 3175890,
      "speaker": "C",
      "start": 2950060,
      "text": "Das ist eine gute Frage. Und mir fehlt jetzt auch gerade wieder Ein, was ich vorhin sagen wollte, das passt hier sehr gut rein, nämlich es ist halt am Ende ein Kulturwandel. Also in der Regel ist es ein Kulturwandel, der schon passiert ist und den man damit sehr, sehr sichtbar macht. Oder es ist ein Kulturwandel, den man damit explizit initiiert, weil einfach es ist eine Abkehr davon, dass entweder alle irgendwie gleich sind, zumindest auf dem Papier, oder dass Erwartungen auch eher so larifari verhandelt werden und wo ja erstmal überhaupt nichts gegensprechen muss. Das kann ja total gut funktionieren, wo man dann eben mit dem Einführen von so einer Matrix sagt, okay, hey, wir wollen jetzt sehr viel klarer damit sein, das wollen wir von dir und das musst du tun. Wo aber auf der anderen Seite halt auch die mehr oder weniger konkrete oder mehr oder weniger explizite Aussage drin hängt mit, ja, wenn du das nicht tust, dann haben wir irgendwie ein Problem miteinander oder müssen wir halt darüber reden, wie du hier deinen Job machst. Das ist halt gerade auch, ich hatte vorhin auch viel über Firmen gesprochen, die gewachsen sind. Das ist halt was, was dann nicht alle Leute wollen. Also wenn jemand in der Firma lange drin war und eben so dieses Shoulder Tapping miteinander arbeiten, also mit so einem, oder auf Zurufen, das eben gern möchte, dann kann das eben auch was sein, wo dann Leute sagen, okay, ich möchte so nicht Arbeit, ich habe keinen Bock auf Performance Reviews und ähnliche Prozesse, die dann häufig da mitkommen mit so einem System und sich dann eben eine andere Firma sucht. Also das heißt, das Erste, was ich zu deiner Frage auf jeden Fall sagen würde, ist, man muss sich einfach bewusst sein, ob man diesen Kulturwandel eigentlich will und wie genau der aussehen soll und was der beinhalten soll und wie viel ich da dann auch hinten dranhänge. Was dann zum zweiten Punkt führt, nä ich würde auf jeden Fall von so einer Matrix abraten, wenn man nicht die Kapazität hat oder nicht die Fähigkeiten im Team, das dann auch wirklich zu nutzen, weil das schön ist, sowas als Projekt und dann hat man das irgendwie ausgerollt und angekündigt, hat den Blogpost geschrieben und so und alles super, aber jetzt musst du das Ding halt auch wirklich nutzen. Das heißt eigentlich, also ich würde es mal nicht mal idealtypisch, aber eigentlich meine Mindestanforderung, dass das heißen sollte, es gibt mal ein initiales Gespräch mit den Leuten in den Teams zwischen den Manager Innen und ihren jeweiligen Leuten im Team dazu, wo stehst du gerade, wo möchtest du hin, was sind Stärken, Schwächen, was auch immer dafür. Dafür wird dann am besten auch noch Feedback eingeholt in irgendeiner Form von dann auch den anderen Leuten im Team und der Führungskraft selber, um mal quasi ein erstes Bild zu zeichnen. Darauf basierend kann man dann auch den Development Plan entwickeln oder die Software Engineers entwickeln lassen. Danach sollte es dann halt auf jeden Fall einmal im Monat Feedback geben von Manager innen an die Person im Team, idealerweise dann quartalsweise einen bisschen größeren Check In und alle sechs bis zwölf Monate mal irgendeine Form von Performance Review, wo man sich halt noch mal das Gesamtbild quasi anguckt. Das sind alles Dinge, von denen ich eigentlich sagen sollte, die solltest du sowieso machen, egal ob du eine Matrix hast oder eine Career Framework Ladder, was auch immer oder nicht. Aber das Problem ist halt, wenn du diese Sachen nicht machst und dann aber so mit viel Trara diese Matrix angekündigt hast, dann wird es halt auch ganz schnell mit der Glaubwürdigkeit echt schwierig, weil dann ist halt die Frage, ja okay, jetzt haben die dieses System hier rausgehauen, aber irgendwie passiert nichts damit, what's the point? Und gerade das ist aus meiner Sicht auch so problematisch, weil halt gerade wenn es um das Thema geht, dass Accountability fehlt, sorry, ich bin jetzt wieder ganz bei den Anglizismen, aber dass es keine Konsequenzen gibt, um Dinge zu tun oder Dinge zu lassen, dann verlierst du halt als Führungsteam extrem schnell Glaubwürdigkeit bei den Leuten im Team und auch zurecht. Das heißt, man muss sich zumindest bewusst sein, was da dranhängt und sollte halt auch dann auch bereit sein, das zumindest in einer gewissen Form durchzuziehen, weil ansonsten ist es halt auch, ja, was ist es sonst sonst ist vielleicht was Schönes, dass man irgendwie Leuten in die, wenn man Job Postings macht, es da irgendwie reinschreibt und sagt, toll, wir haben das oder es ist gut fürs Employer Branding, aber es macht halt nicht das, was es eigentlich soll, nämlich eine Kultur fördern, die du so haben möchtest in deiner Firma."
    },
    {
      "end": 3205470,
      "speaker": "B",
      "start": 3176050,
      "text": "Jetzt hast du ja auch schon gesprochen, remote und mit vielen Firmen und vielen Kulturen. Was ja gerne als Argument auch gebracht wird für so Career Letters ist, wenn du was formalisiert hast, dass gerade die Diversity in irgendeiner Form gestärkt wird, vor allem Leute die vielleicht ruhiger sind und nicht immer immer die Lauten, die vorne dran sind und dann immer die Beförderungen einheimsen oder die unterrepräsentierten Gruppen, die einfach nicht so laut sind und nicht so stark sind. Wie ist dein Blick darauf? Funktioniert das in der Realität? Hilft das Ganze?"
    },
    {
      "end": 3346880,
      "speaker": "C",
      "start": 3206670,
      "text": "Ich glaube ja und nein. Also ich glaube schon, dass es hilfreich sein kann, um gerade auch bei Manager innen so ein bisschen auf Fairness Aspekte drauf zu gucken. Also gerade wenn man wirklich so was wie Kalibrierungsgespräche regelmäßig macht und sei es halt nur einmal im Quartal oder alle sechs Monate, wo sich wirklich alle Leute aus dem Management oder Führungsteam zusammensetzen und drauf gucken, wo stufen wir die Leute gerade jeweils ein, wie sehen wir das im Vergleich und in Relation zueinander. Das kann da super hilfreich sein, wenn die jeweiligen Führungskräfte da auch offen für sind, dass vielleicht ihre Perspektive nicht immer die einzig wahre und einzig korrekte ist. Es kann aber auf der anderen Seite kann es halt auch größere Probleme nicht wegmachen. Also es gibt eine schöne McKinsey Studie dazu von zwei tausend drei und zwanzig glaube ich, ich, die sprechen so über die gebrochene Sprosse in der Karriereleiter. Das ist einfach trotzdem das Beförderungsraten und die Frage, wer besetzt dann welche Leute von welchem Gender oder welchem anderen Hintergrund besetzen höhere Positionen, dass sich daran nicht wahnsinnig viel verändert, nur weil man solche Systeme hat, weil da einfach noch zu viele andere Faktoren reinspielen. Ich habe das auch immer wieder, wenn ich ich arbeite halt auch viel mit Leuten, die neuer in Führungsrollen sind, sei es als Tech Lead oder mit Personalverantwortung und wo sowas wie, du musst wahnsinnig laut sein und wenn alle in Meetings sowieso schon durcheinander schreien, dann musst du jetzt auch noch miteinander damit reinschreien oder wir wollen, dass du selbstbewusster auftrittst und das heißt halt, dass du irgendwie auch Leute unterbrichst oder dass du dem Product Manager mehr auf die Füße trittst und so weiter. Also das, wo diese, ich sehe es halt gerade in Führungsrollen, weil es so primär die Arbeit ist, die ich mache, aber wo so antiquierte Ideen davon, wie Führungsarbeit aussieht, aber sich halt auch dann runterbricht auf IC Arbeit. Ich habe häufiger auch schon Diskussionen gehabt mit anderen Manager innen darüber, dass wenn jemand regelmäßig das Note Taking Meetings übernimmt, als das noch nicht von ai's gemacht wurde, dass das halt auch was Wichtiges ist fürs Team und dass das auch ein Beitrag ist, der seine Relevanz hat. Also wo ich glaube, wir immer noch einfach sehr, sehr viel Arbeit zu tun haben als Führungsteams, um drauf zu gucken, was nehmen wir eigentlich als wirklich wertvolle Arbeit an, was nehmen wir als solche wahr und was, was fördern wir und was belohnen wir halt auch und wo aber gleichzeitig, deswegen sind wir dann wieder beim, ja, wo so was wie so eine Leiter halt ein wirklich guter Katalyst und ein System sein kann, um sich darüber zu unterhalten."
    },
    {
      "end": 3370970,
      "speaker": "B",
      "start": 3347440,
      "text": "Wobei das ja auch immer so die Frage ist, ist das dann alles definiert? Natürlich, gerade wenn du so Notetaking erwähnst oder wenn es um irgendwelche zwischenmenschlichen Dinge geht, die sind ja oft ganz ganz, basieren ganz im Hintergrund und sind offiziell nicht definiert und stehen gar nicht in der Job Description womöglich. Und diese ganze Glue Work, wie sehr oft genannt wird, die fällt halt dann durch den Rost oder du wirst nicht belohnt dafür. Also das ist ja das andere Problem, weil du kannst nicht jede Kleinigkeit in."
    },
    {
      "end": 3389530,
      "speaker": "C",
      "start": 3370970,
      "text": "Irgendeiner Form definieren und solltest du auch nicht. Genau, also das ist tatsächlich eine Schwierigkeit. Deswegen finde ich inzwischen auch wirklich gut, wenn man Beispiele drin hat für Verhaltensweisen, weil einfach die Matrix an sich so abstrakt sein sollte, dass sie eben auf verschiedene Leute in verschiedenen Teams passen kann. Und ja, dann fehlen halt solche Beispiele."
    },
    {
      "end": 3408070,
      "speaker": "A",
      "start": 3389530,
      "text": "Vielleicht auch zum Thema Glue Work und Technical Leadership und Note Taking und dass das nicht wertgeschätzt wird. Einen wunderschönen Talk gibt es von Tanja Riley, den haben wir auch mit unten in die Show Notes gepackt, wirklich dreiig fünf und vierzig Minuten purstes. Ich habe mir die mal angesehen und ja, genau das genau, was ich sage. Genau."
    },
    {
      "end": 3413310,
      "speaker": "B",
      "start": 3408470,
      "text": "Und ich glaube, sie hat sogar Glu Work erfunden, den Term, wenn mich nicht alles täuscht oder ich kenne ihn auch."
    },
    {
      "end": 3416470,
      "speaker": "C",
      "start": 3413310,
      "text": "Von ihr zumindest ins Engineering gebracht."
    },
    {
      "end": 3463330,
      "speaker": "A",
      "start": 3417190,
      "text": "Sehr, sehr gut, Watch empfehlen. Jetzt ist es ja so, dass Levels auch Erwartungen setzen und allem drum und dran und auch fürs Performance Management genutzt werden. Und dann sind natürlich auch Beförderungen irgendwann ein Thema. Hast du es schon mal erlebt, dass auf Basis einer Karriereleiter oder auf Basis von definierten Levels, aber auch ein Performance Management Missbrauch stattgefunden hat. Also zum Beispiel, wo, was ich mir gerade so schnell denken kann, ist, jemand macht exzellente Arbeit, aber der Engineering Manager oder die Engineering Managerin möchte ihre Leute kleiner halten als sie selbst oder irgendwie so sowas auf Basis, ja, aber diesen kleinen Satz von fünfzig Erwartungen erfüllst du nicht und deswegen kann ich dich nicht für eine Promotion vorschlagen oder irgendeine andere Art von Missbrauch. Kam dir sowas schon mal unter oder beziehungsweise für wie realistisch hältst du die ganze Thematik schon?"
    },
    {
      "end": 3559480,
      "speaker": "C",
      "start": 3463570,
      "text": "Also ich grabe gerade so ein bisschen und ich kann mich nicht an viele konkrete Fälle erinnern, aber die ganze Thematik, dass Führungskräfte irgendeine Form von Anforderungen, sei es jetzt halt über so eine Matrix oder eine Rollenbeschreibung, Jobbeschreibung, dass die dir sehr unterschiedlich auslegen und dann auch vielleicht mal so ein bisschen Machttrip fahren, kommt vor und ist ein Problem, wenn es vorkommt. Absolut. Ich habe solche Fälle definitiv schon erlebt, mit oder ohne Matrix macht dann ehrlich gesagt auch keinen Unterschied. Also es ist dann wieder nur das Tool, über das es halt sichtbar wird. Wenn jemand den Eindruck hat, dass das einem selber oder einer Person aus dem Team passiert, dann wäre mein erster Rat auf jeden Fall, das zu dokumentieren, Also solche Gespräche auch festzuhalten, Gedächtnisprotokolle anzufertigen, sich, wenn es geht, auch von der jeweiligen Führungskraft schriftlich geben lassen, einfach was da irgendwie die Performance Einschätzung ist und dann mit einer vertrauten Person erst mal drüber sprechen. Das kann Personalabteilung sein. So ein bisschen empfiehlt HR immer nur bedingt als Ansprechperson, weil deren Job ist am Ende halt die Firma zu schützen. Es gibt Personalabteilungen, die sehr gut sind und sehr auch offen mit den Mitarbeitenden umgehen. Es gibt aber auch andere, bei denen das nicht so ist. Deswegen da mit Vorsicht oder wenn es eine andere Person im Führungsteam gibt, zu der es Vertrauen gibt oder oder halt Chefin des eigenen Chefs, der irgendwie diesen Kram macht. Das ist ein haariges Thema, aber auch da wichtig, dass es, dass es sichtbar wird auf jeden Fall. Und auch da ist es eben eigentlich was, was eben eigentlich in der Idealversion über Kalibrierungen nicht passieren sollte. Aber ja, dass Manager in Macht Trip fahren, kommt leider vor."
    },
    {
      "end": 3619470,
      "speaker": "A",
      "start": 3559960,
      "text": "Du hast gerade einen ganz wichtigen Punkt angesprochen in Bezug auf die Rolle von HR. Ich glaube, da gab es auch mal vor ein paar Jahren Fall bei, wo eine Software Engineerin sexuell belästigt wurde, glaube ich, und dann HR mit eingebunden hat und HR sagte Ja, aber das ist ein High Performer und den wollen wir behalten und allem drum. Also war auch eine ganz schwierige Sache. Gibt es einen riesen Blogpost zu, ich glaube, ein Jahr at Uber oder sowas heißt der. Suchen wir mal raus, verlinken. War auch schrecklich zu lesen, aber auch irgendwie mal interessant zu sehen, okay, was HR für eine Rolle ab und zu einnehmen kann. Jetzt hatten wir im Vorgespräch, kommen wir mal zu was Positivem und nicht irgendwie sowas. Im Vorgespräch hattest du von einem Talk erzählt, wo du diesen Talk eröffnest mit einer Slide, wo ganz fett draufsteht People suck at expressing expectations, also zu Menschen sind sehr schlecht darin, Erwartungen zu äußern. Welche häufigen Fehler kommen dir unter die Manager im Gespräch mit ics zum Thema Erwartungshaltung machen?"
    },
    {
      "end": 3628910,
      "speaker": "B",
      "start": 3619870,
      "text": "Moment, da wäre jetzt gleich meine Frage drin. Beziehst du das auf die Manager Seite oder auf die IC Seite oder die Teamseite? Weil expectations kann man ja auf beiden Seiten äußern."
    },
    {
      "end": 3633190,
      "speaker": "C",
      "start": 3628910,
      "text": "Das ist eine sehr gute Rückfrage. Ich sage das als globales Statement."
    },
    {
      "end": 3638710,
      "speaker": "B",
      "start": 3635510,
      "text": "Ich kann einfach alle nicht. Es würde jetzt unterschreiben."
    },
    {
      "end": 3654490,
      "speaker": "C",
      "start": 3639110,
      "text": "Also das Slide war jetzt hier auch selber das volle Zitat. Many people are bad at expressing expectations. Es war Slide Nummer sechzehn aus zwei und dreiig, also genau in der Mitte. Ja, der Talk ist auch auf meiner Website, können wir auch noch verlinken. Also ja, ich halte das für ein global relativ wahres Statement."
    },
    {
      "end": 3671890,
      "speaker": "A",
      "start": 3656250,
      "text": "Welche Fehler siehst du denn öfters, die Menschen machen? Jetzt gehen wir mal nicht auf die Manager Seite, sondern die auch ics machen, die ich jetzt Ich bin Senior Engineer und ich möchte Erwartungshaltung gegenüber meiner Vorgesetzten mal klarstellen. Das, was ich erwarte, welche Fehler, in welche Fehler renne ich?"
    },
    {
      "end": 3750950,
      "speaker": "C",
      "start": 3671890,
      "text": "So, was siehst du als Kontext vielleicht nur hilfreich? Der Vortrag war konkret zum Thema Managing ab. Also wie arbeite ich mit meinem Chef, meiner Chefin, Führungskraft? Wo halt das auch tatsächlich wirklich eines der Kernprobleme ist. Der erste Punkt ist, glaube ich, ganz viele Leute wissen einfach nicht, was sie überhaupt erwarten dürfen. Also was sollte denn mein Chef eigentlich für mich machen? Ist es okay, wenn mein Chef ständig die One on ones absagt. Ist es okay, wenn ich irgendwie seit Monaten kein Feedback bekommen habe und ich würde beide zu diesen Beispielen beiden sagen, nee, es ist nicht okay Oder ist es okay, wenn ich keine Ahnung habe, was mein Job eigentlich bedeutet oder was es für mich heißt, einen guten Job zu machen. Also so wirklich rudimentäre Dinge. Ich habe auch auch in dem Vortrag einiges an Beispielen und Templates und so weiter drin, wie man das herausarbeiten kann, weil das wirklich ein massives Problem ist. Also was darf ich eigentlich erwarten? Dann ist der zweite Was möchte ich eigentlich? Also möchte ich Mentoring haben oder möchte ich irgendwie, dass mein Chef mich mehr in größere Projekte einbindet? Also ein Stück weit Self Awareness oder so ein Verständnis davon, was brauche ich? Was möchte ich? Wo möchte ich mit meiner Karriere hin? Hier als Sternchen vielleicht noch dazu. Ich glaube nicht, dass man in fünf bis zehn Jahresplan für seine eigene Karriere haben muss. Ich hatte noch nie einen. Ich bin jetzt in einem Monat seit zwanzig Jahren berufstätig und habe immer noch keine und es lief trotzdem ganz okay."
    },
    {
      "end": 3756549,
      "speaker": "B",
      "start": 3751350,
      "text": "Das freut mich jetzt wirklich zu hören gleich mal von meiner Seite. Ich bin auch ganz auf deiner Seite. Ich hasse diese."
    },
    {
      "end": 3913260,
      "speaker": "C",
      "start": 3758470,
      "text": "Das heißt aber auch, es kann ja schon sein mit ich habe eine Idee, dass irgendwie hier ist so ein cooles Projekt, von dem ich gehört habe, da möchte ich dabei sein oder hier ist jemand, mit dem ich möchte mal arbeiten oder wir haben ein anderes Team, was ich interessant finde, vielleicht kann ich da mal rein. Also also es muss ja nicht alles super abstrakt sein. Man kann sich das auch total konkret erst mal überlegen und so ein bisschen Ideen zumindest mitbringen, weil ich da schon auch und das ist so ein Problem, was schnell in beide Richtungen geht. Ich habe mal vor Jahren mal Coaching Training gemacht und eines der ersten Dinge, die uns da die uns dabei gebracht haben, war, dass die Coaching Arbeit eigentlich immer sein sollte. Also ein gleichwertiger Beitrag von allen Beteiligten. Und das ist natürlich eine Manager Angestellte oder IC Beziehung bisschen schwierig, weil da natürlich die Power Dynamik noch Macht Dynamik noch reinspielt und irgendwie mit meinem Chef oder meiner Chefin sehr offen zu sein, ist noch was anderes als mit einem Peer, mit dem ich Coaching mache. Aber ich sehe halt auch oft, dass viele Manager viel zu viel übernehmen davon, wenn es um Karriereentwicklung geht. Der Angestellten Also ich sehe schon, dass wenn du irgendwie vorankommen möchtest in deiner Arbeit und neue Dinge lernen und was auch immer, dann gehört dazu auch ein Stück weit Eigenverantwortung zu übernehmen. Der Job von deinem Manager, deiner Managerin sollte sein zu gucken, was kann die dir möglich machen, kann die dich vielleicht mit mit Leuten verknüpfen oder dich mal für ein neues Team vorschlagen, was auch immer. Aber die Ideen müssen grundsätzlich mal von dir kommen. Wenn du gar keine hast, kannst immer noch nachfragen. Vielleicht hat dein Chef ja auch Ideen für dich. Aber genau, also dich selber kennen und auch so ein bisschen wissen, was du eigentlich willst und dann ist der Rest viel nachfragen und ins Gespräch gehen. Angefangen bei OK Chef, was kann ich denn von dir erwarten? Wie arbeitest du gern mit deinen Leuten oder was möchtest du von Leuten wie mir gerne sehen? Was erwartest du, wenn ich jetzt weiterentwickeln möchte, Was müsste ich denn tun? Nicht alle Chefs sprechen das immer irgendwie sehr aktiv an, das ist auch eine Krankheit. Aber wenn wir jetzt nicht die Chefs irgendwie alle fixen können gerade man kann da schon auch selber so ein bisschen was tun, um da zumindest näher dran zu kommen. Wenn man dann gar nichts kriegt, gibt es immer noch Frameworks, auf die man zurückfallen kann. Sowas wie heißt Leader Member Exchange ist eine relativ alte schon Theorie aus dem Personalmanagement und aus dem Operational Psychology Bereich, wo es eigentlich darum geht, was ist ein produktiver Austausch zwischen Führungskraft und Mitarbeitenden Oder man geht auf sowas wie Transformational Leadership, was eben auch wissenschaftlich ein recht fundierter Ansatz ist, um dann zu gucken, macht mein Chef das eigentlich? Also da kann man sich schon rantasten und man kann relativ weit kommen, wenn man einfach mal Fragen stellt, weil da ganz viele Leute auch Scheu vor haben, nachvollziehbarerweise. Aber das ist in der Regel schon echt guter Ansatz."
    },
    {
      "end": 3930060,
      "speaker": "B",
      "start": 3913740,
      "text": "Also ich erwarte mir jetzt keine Antwort, weil ich glaube, es ist eine schwere Frage und vielleicht ist sie auch sehr philosophisch. Aber hast du eine Idee, warum das bei uns so ein Problem ist mit Erwartungskommunikation, dass das die Leute nicht können, nicht möchten? Ist es kulturell? Wo ist der Root Cause sozusagen?"
    },
    {
      "end": 4063140,
      "speaker": "C",
      "start": 3931100,
      "text": "Ich habe da einige einfach auch, weil das ist ein Thema, über das ich mit Leuten oft spreche. Also wenn die jetzt da nicht mit ihrem Chef drüber sprechen können, dann wird es da ja auch Gründe für geben. Deswegen habe ich das mit einigen Leuten schon bearbeitet. Also ein Teil ist tatsächlich einfach kulturell diese Idee, dass gute Arbeit spricht für sich selbst und bloß nicht irgendwie angeben oder auffallen, sondern schon die Werke für sich sprechen lassen. Das ist noch total drin, auch gerade so in Deutschland einfach die Idee, dass wenn ich gute Arbeit mache, dann wird das schon wahrgenommen werden, dann sehen das die Leute schon von alleine, da muss ich gar nichts in Mikros tun und ich sollte da bloß nicht irgendwie drüber reden. Da ist auch oft so eine Angst dahinter, dass man dann im Team unangenehm auffällt und dass Leute einen dann für einen Angeber halten oder für jemanden, der irgendwie sich für was Besseres hält. Also ganz viele Sorgen davor, wie werde ich dann wahrgenommen, wenn ich da explizit damit bin. Was dann aber halt ganz schnell dazu führt, dass Leute sich einfach nur darauf verlassen, mein Chef wird das schon sehen, wenn ich gute Arbeit mache. Das wäre schön. Ja, aber es gibt halt auch Jahrzehnte von wissenschaftlicher Arbeit, die sagt, so läuft das halt nicht. Also das ganze Thema Perception Bias zum Beispiel. Ich glaube die ersten Studien waren aus den ERN, wenn ich mich richtig erinnere, die wunderschön gezeigt haben, wie krass der Unterschied einfach ist darin, dass Leute an Beförderungen kriegen und Gehaltserhöhungen, wenn sie einfach häufiger am Chef vorbeilaufen im Büro und nicht von zu Hause arbeiten. Also wir können halt nicht so tun, als wären diese Sachen nicht da. Und ich glaube, vielen Leuten ist es auch gar nicht so richtig bewusst, wie viele unsichtbare Dynamiken da eigentlich Kinder reinspielen. Am Ende ist so, selbst Chefs, die sich wirklich für ihre Mitarbeitenden interessieren und die da wirklich einen guten Job machen wollen, sind A sowieso nicht perfekt. Das ist schon mal das erste Problem und sind zweitens halt auch einfach extrem unter Wasser. Also wir haben alle viel zu tun und du als IC halt auch. Was auch wiederum heiß selbst wenn ich jetzt als Chefin wirklich wissen wollen würde, was all meine Mitarbeitenden ganze Woche machen, also A komme ich dann halt auch ganz schnell Micromanagement Territorium und niemand will, dass ich mir irgendwie die ganze Zeit auf die Finger schaue und B hat da einfach auch niemand Zeit für. Das heißt am Ende ist halt, es ist ein eigener Job, Marketing für dich selber zu machen, da läuft es halt am Ende drauf raus."
    },
    {
      "end": 4082960,
      "speaker": "A",
      "start": 4063460,
      "text": "Ich bin sehr, sehr dankbar, dass du die Busyness von Managern angesprochen hast, denn da finde ich mich wieder. Also es geht gar nicht oft darum, dass man die Erwartungen gar nicht kommunizieren möchte, sondern im Busy Lifestyle und im Busy Company Style. Ja, man hat fünf Bälle in der Luft und jongliert die alle."
    },
    {
      "end": 4186010,
      "speaker": "C",
      "start": 4083200,
      "text": "Eine ganz, ganz große Schwierigkeit ist auch einfach noch das Abstraktionslevel. Also ich habe auch schon oft erlebt, dass Leute dann wirklich mal nachfragen, ihren Chef, ihre Chefin, so was erwartest du denn von mir? Und viele tun sich einfach super schwer, das irgendwie abstrakt zu formulieren. Ja, halt, mach halt deinen Job. Das ist an sich auch eine total faire Erwartung, nur kann das ja alles Mögliche heißen oder kommuniziere irgendwie gut, aber Dinge, die dann ganz schnell auch in so Floskeln ausarten, wo der Interpretationsspielraum wahnsinnig groß sein kann und wo aber gleichzeitig auch überhaupt nicht klar ist, was heißt das denn jetzt eigentlich für mich und was mache ich denn jetzt damit? Das heißt, es ist entweder zu abstrakt oder es ist halt viel zu konkret und damit auch schon viel zu preskriptiv. Also sowas wie, ich möchte jetzt, dass du mir irgendwie jeden Dienstag fünf Punkte schickst zum Thema, wie dieses aktuelle Projekt läuft. Das kann total gerechtfertigt sein, aber ich sehe euch so semi nicht die Augen verdrehen, schon so ein bisschen wissend nicken. Es ist dann halt auch schon sehr, sehr konkret zum Punkt, wo dann auch die Frage ist, wenn du Leute dafür bezahlst, dass sie Expertise haben und mitbringen, sollten die dann nicht selber rausfinden, wie man das am besten kommuniziert. Und sich da irgendwie gut zusammenzuraufen und zu treffen, ist super schwierig. Deswegen ist mein Rat ganz oft auch Dinge ausprobieren. Also gerade wenn es um Kommunikation geht, das sollte regelmäßig passieren. Ich finde auch einen Wochentakt da völlig gerecht rechtfertigt. Also wo du deinem Chef dann einfach sagst mit hier läuft es, so sehen Dinge gerade aus Und dann auszuprobieren, wie findet der oder die das, was kommt da an, was kann ich vielleicht ändern? Und da selber so ein bisschen die Initiative zu ergreifen, weil ja konkrete Erwartungen sind doof, abstrakte Erwartungen sind irgendwie auch nicht so super hilfreich. Ja, schwierige Sache."
    },
    {
      "end": 4218690,
      "speaker": "B",
      "start": 4186010,
      "text": "Ich hatte einmal einen Vorgesetzten, der war auch der Vorgesetzte von Andy zur gleichen Zeit und der wollte auch ein Reporting von mir und hat dann gemeint, ja, Abstraktionslevel, das musst du selber rausfinden einfach das, was sinnvoll ist, ist Abstraktionslevel, aber schau mal die Reports von Andy an, der macht es ganz gut. Also ich habe dann Andis Reports mir als Vorlage genommen. Fürs IC Level haben wir auch mal eine Episode ein hundert dreizehn über BRAG Documents gemacht, genau aus dem Grund, wie man eben den Vorgesetzten auch vielleicht mitteilen kann, was man denn so macht und das eigentlich dann auch gut nutzen kann. Also gern mal da auch auch super Sache."
    },
    {
      "end": 4312820,
      "speaker": "A",
      "start": 4218690,
      "text": "Julia Evans, großartige Arbeit und genau das habe ich, ich habe vor kurzem zwei Teams übernommen und genau das habe ich dann auch wieder eingeführt. Einmal die Breakdokuments, ich sag mal, mehr oder weniger angefordert, genau aus diesem Grund, was du gesagt hast. Lena, es ist halt einfach so, du hast etliche Direct Reports, natürlich versucht man diese zu beobachten, ohne Micromanagement zu betreiben, um dann später in irgendwelchen Performance Cycles fair zu sein. Der Punkt ist aber, du bist auch nur Mensch, du übersiehst was, du bist auch busy, du hast auch ein Bias und deswegen habe ich jetzt, das heißt nicht, Andi, ich habe alles toll gemacht, also gar nicht, sondern eher so nach dem Motto, okay, pass auf, du bist verantwortlich für deine Karriere. Hier so ein Breakdokument ist ein tolles Tool, weil ich frage dann immer so als Testfrage, was hattest du vorgestern zum Abendessen? Und dann kommt Shouldersruck und meine ich so, aha, wie möchtest du denn in vier Monaten sagen, was du die letzten sechs Monate gemacht hast? Dann sagen die, oh, ich weiß nicht. Dann habe ich auch gesagt, pass auf, das ist jetzt nicht nur für dich, sondern natürlich auch für mich in einer Art und Weise, dass ich halt alles sehe, Aber auch wenn ich sage, pass auf, das habe ich gesehen, dass du mich auch challengen kannst. Ja, Moment mal, aber ich habe doch noch fünf andere Sachen hier und das ist halt genau der Punkt, den du auch genannt hast. Und ich fand es wunderschön. Danke, da gehe ich heute Abend mit einem Grinsen ins Bett. Lena, wir haben so viel besprochen über Karrierepfade, über Individual Content, über Levels, über Erwartungshaltung. Ich bin ein hundert Prozent davon überzeugt, dass wir, wenn wir jetzt nicht aufhören, dass wir eine fünf Stunden lang Episode machen. Deswegen kommen wir mal langsam zum Ende."
    },
    {
      "end": 4316700,
      "speaker": "B",
      "start": 4312820,
      "text": "Wir haben ja schon vereint, dass wir diese eigene Episode zu Netflix machen oder."
    },
    {
      "end": 4323500,
      "speaker": "C",
      "start": 4317980,
      "text": "Die Halbtages Episode Ping Pong mit."
    },
    {
      "end": 4344130,
      "speaker": "A",
      "start": 4324540,
      "text": "Jetzt ist das Thema natürlich sehr breit, aber was würdest du unseren Hörerinnen und Hörern denn mitgeben? Was würdest du sagen zum Thema Erwartungsmanagement, aber auch zum Thema vielleicht Karriereleiter und allem drum. Was würdest du sagen, okay, wenn ihr eine Sache behaltet, wenn ihr eine Sache an euch erinnert, was ist das und was wäre es?"
    },
    {
      "end": 4361270,
      "speaker": "C",
      "start": 4344130,
      "text": "Ich würde es runterbrechen auf Finde raus, was dein Chef, deine Chefin von dir erwartet und mach das. Und wenn die Person Schwierigkeiten hat, dir das zu erzählen, dann such dir einen anderen Weg. So ein Weg kann der Karriereleiter sein, Jobbeschreibung oder eben auch irgendwelches wöchentliches Reporting mal zu machen und dann zu gucken."
    },
    {
      "end": 4365350,
      "speaker": "A",
      "start": 4361270,
      "text": "Was passiert kurz und knapp, wenn das doch mal so einfach wäre, wie du es formuliert hast."
    },
    {
      "end": 4369590,
      "speaker": "C",
      "start": 4367030,
      "text": "Du wolltest was kurz und knapp haben, jetzt hast einen Salat."
    },
    {
      "end": 4374150,
      "speaker": "B",
      "start": 4370870,
      "text": "Es ist ja die Vision, wie man dorthin kommt, ist dann nochmal eine andere Sache."
    },
    {
      "end": 4377030,
      "speaker": "C",
      "start": 4374230,
      "text": "Richtig. Niemand gesagt, dass es einfach wird."
    },
    {
      "end": 4407790,
      "speaker": "A",
      "start": 4377750,
      "text": "An alle, die genau Wow, was die Frau da sagt, davon brauche ich mehr. Man kann Lena dafür bezahlen, zahlen. Also man kann ganz professionell sie als Coach, Mentor, als Trainerin und Co. Natürlich auch buchen oder zumindest erstmal anfragen. Ob sie dann annimmt, ist dann, glaube ich, eine andere Thematik. Links zu Lena findet ihr in den Show Notes und ich gehe stark davon aus, dass sie auch hier und da die eine oder andere Frage vielleicht mal in einem LinkedIn Kommentar oder ähnliches beantworten wird. Lena vielen lieben."
    },
    {
      "end": 4411720,
      "speaker": "B",
      "start": 4407790,
      "text": "Und du hast auch zwei Podcasts, oder? In denen du regelmäßig über diese Themen sprichst."
    },
    {
      "end": 4449420,
      "speaker": "C",
      "start": 4411950,
      "text": "Ja, genau. Der eine Podcast ist Leadership Confidential. Das sind häufig anonyme Gespräche, über was es heißt, Führungskraft zu sein und über die Sachen, über die Leute oft nicht öffentlich reden wollen. Wir hatten jetzt schon Podcast zum Thema, kein Technical Manager zu sein, zum Thema Neurodiversität. Wir hatten jetzt eine Managerin mit ADHS und Autismus oder eben auch so was wie neue Teams und neue Verantwortungs. Das andere ist mit o'reilly, also wessen Firma o'reilly Mitgliedschaft hat, kann da mit reinhören. Das ist Technical Leadership Tuesday einmal im Monat. Das nächste ist im August."
    },
    {
      "end": 4464670,
      "speaker": "A",
      "start": 4449420,
      "text": "Dann verlinken wir natürlich auch alles in Shownotes, wer die Stimme mehr hören möchte. Vielen lieben Dank. Also ich bin wirklich sehr stolz, dass du die Einladung angenommen hast, denn wie gesagt, diesen Link von eurer Arbeit teile ich jetzt nicht wöchentlich, aber wir sagen."
    },
    {
      "end": 4465430,
      "speaker": "C",
      "start": 4464670,
      "text": "Alle drei Wochen."
    },
    {
      "end": 4470830,
      "speaker": "B",
      "start": 4467190,
      "text": "Hat uns schon begleitet, das ganze Leben fast schön."
    },
    {
      "end": 4476870,
      "speaker": "C",
      "start": 4470830,
      "text": "Nein, es hat mich sehr gefreut und danke für die schönen Fragen. Es war mir ein Vergnügen. Die Zeit ging sehr schnell rum. Sehr vielen Dank."
    },
    {
      "end": 4491430,
      "speaker": "A",
      "start": 4476950,
      "text": "Vielen Dank von meiner Seite auch noch mal Und wer mit uns darüber diskutieren möchte, kann gerne in unsere Discord Community kommen. Fragen und Feedback leiten wir natürlich auch sehr, sehr gerne an Lena weiter. Deswegen hemmt euch da nicht ein bisschen Feedback zu schreiben. Das war's von uns. Wir sagen, wir sind bis nächste Woche und tschüss."
    }
  ],
  "webhook_auth": false
}