{
  "acoustic_model": "assemblyai_default",
  "audio_duration": 3861,
  "audio_url": "https://cloud.inlupus.at/s/KozQE2mRsJoywMA/download",
  "auto_chapters": false,
  "auto_highlights": false,
  "auto_highlights_result": {},
  "confidence": 0.9568719,
  "content_safety": false,
  "content_safety_labels": {
    "status": "unavailable"
  },
  "custom_topics": false,
  "disfluencies": false,
  "dual_channel": false,
  "entity_detection": true,
  "filter_profanity": false,
  "format_text": false,
  "iab_categories": true,
  "iab_categories_result": {},
  "id": "6057dda6-9bce-4e6c-867d-9d01eacb5c6e",
  "language_code": "de",
  "language_detection": false,
  "language_model": "assemblyai_default",
  "punctuate": true,
  "redact_pii": false,
  "redact_pii_audio": false,
  "sentiment_analysis": false,
  "speaker_labels": true,
  "speakers_expected": 2,
  "speed_boost": false,
  "status": "completed",
  "summarization": false,
  "throttled": false,
  "utterances": [
    {
      "end": 36970,
      "speaker": "A",
      "start": 3360,
      "text": "Willkommen zu einer weiteren Episode vom Engineering Kiosk Podcast. Heute mit einer Ask Me Anything Session. Die Fragen kommen von euch, die Antworten kommen von uns. Ein Mix zwischen Technologie, der eigenen Jobmotivation und side Projects. Es geht um Linter, Formatter und ob wir JavaScript eigentlich hassen oder lieben, um beständiges Jobhopping, um das Bedürfnis, mal raus aus der Techbubble zu kommen und etwas komplett anderes zu tun, was uns am wichtigsten im neuen Job ist. Gehalt, Produkt oder Technologie und welche side Projects wir bereuen, diese nicht weiterentwickelt zu haben. Ab geht's, viel Spaß."
    },
    {
      "end": 41930,
      "speaker": "B",
      "start": 39690,
      "text": "Weißt du, was mich wirklich interessieren würde?"
    },
    {
      "end": 44170,
      "speaker": "A",
      "start": 42010,
      "text": "Eine Frage, die sehr oft."
    },
    {
      "end": 51610,
      "speaker": "B",
      "start": 44170,
      "text": "Du fängst zu wen Politiker schon an? Ganz allgemein. Eine Frage, die man Blablabla, ne, ich."
    },
    {
      "end": 57610,
      "speaker": "A",
      "start": 51610,
      "text": "Habe keine Ahnung, was dich interessiert. Höhle Wolfgang, erzählst du mir bitte, was dich interessiert? Diese Frage stelle ich mir auch auf das, was dich interessiert."
    },
    {
      "end": 81620,
      "speaker": "B",
      "start": 58420,
      "text": "Wie viele Hörer innen wir verloren haben durch diese Werbung zu unserer Ask Me Anything, diese aggressive KI Voice, die du super toll gefunden hast. Du bist ja fast steil gegangen mit dieser Stimme. Ich habe sie auch sehr anstrengend gefunden, sehr aggressiv, aber ich hoffe mal, dass wir keine Hörer innen verloren haben dadurch. Aber würde mich durchaus interessieren. Aber es hat gewirkt. Wir haben auf jeden Fall Fragen bekommen."
    },
    {
      "end": 122260,
      "speaker": "A",
      "start": 81620,
      "text": "Ich kann mich nicht mehr an die Werbung erinnern. Kannst du die noch mal hier einspielen, bitte? Du hast Fragen an Andi oder Wolfi? Dann ist jetzt deine Chance. Der Engineering Kiosk macht eine Ask Me Anything Folge. Egal ob ernste oder sinnbefreite. Nichts ist tabu oder sagen wir fast nichts. Ob Rosinen in den Kaiserschmarrn gehören, ist und bleibt ein Tabuthema. Jetzt Frage einsenden auf engineeringkiosk, Dev am A M A. Wie Ask Me Anything mitmachen, lachen lernen. Andi und Wolfi freuen sich mehr oder weniger. Wir haben die jetzt gerade ja noch einmal alle gehört. Bisschen aggressiv, aber auch motivierend. Also mich hätte die ganze Sache sofort motiviert. AMA Ask Me Anything."
    },
    {
      "end": 133780,
      "speaker": "B",
      "start": 122260,
      "text": "Und weißt du, wie schwierig das war, das so hinzubekommen, dass sie Ama sagt und jedes Mal, wenn du auf Generate drückst, bekommst du eine andere Aussprache. Das ist gar nicht so leicht, das hinzubekommen. Das ist korrekt ausgesprochen."
    },
    {
      "end": 157040,
      "speaker": "A",
      "start": 133860,
      "text": "Ja, ich glaube, KI Modelle haben auch Probleme. Ich glaube mit großen Zahlen. Also da gibt es ja immer noch hier und da ein paar Hürden. Aber wie gesagt, vor sechs Monaten hatten Bildgenerierungsmodelle ja auch noch sechs Finger, haben die ja auch hingekriegt. Deswegen gehe ich stark davon aus, dass in sechs Monaten werden die das auch hinbekommen. Aber seit Ende Mai sammeln wir ein paar Fragen und irgendwann müssen wir die jetzt auch mal beantworten."
    },
    {
      "end": 167360,
      "speaker": "B",
      "start": 157200,
      "text": "Für mich stellt sich auch die Haben wir nur dreiig bekommen, weil sie so aggressiv war oder haben wir sogar dreiig Fragen bekommen, weil sie so cool war, diese Stimme."
    },
    {
      "end": 176380,
      "speaker": "A",
      "start": 167360,
      "text": "Ja, da weiß ich jetzt, ich habe ja keine Referenzwert zu anderen Podcasts, wie viel Ask Me Anything Fragen die so bekommen. Deswegen kann ich da relativ wenig zu sagen. Deswegen weiß ich auch nicht, ob dreiig viel oder wenig ist."
    },
    {
      "end": 225530,
      "speaker": "B",
      "start": 176540,
      "text": "Wir sind auf jeden Fall sehr glücklich, sind sehr coole Fragen auch dabei gewesen und darum wollen wir heute auch mal ein paar von denen beantworten. Vielleicht gleich vorab, weil wir sonst immer am Ende der Episode sagen, ihr könnt in die Show Notes runtergehen in jeder App, die ihr so verwendet, um Podcasts zu hören und eine Thumbs up, Thumbs down klicken in unserem Voting System, damit wir da Feedback bekommen. Wir sagen das normal immer am Ende der Folge, aber üblicherweise sind natürlich am Ende der Folge nur mehr die dabei, die es wirklich cool gefunden haben. Darum jetzt mal die Info, wenn ihr das cool findet oder nicht cool, könnt ihr gerne da draufklicken. Und wenn ihr dann irgendwann sagt, uninteressante Folge, bitte klickt davor einmal noch den Thumbs Down, einfach damit wir das Feedback auch bekommen, weil es ja auch eine komplett neue Art von Folge ist, die wir heute machen und so allgemeine Fragen beantworten, die euch scheinbar interessieren und hoffentlich natürlich auch mehr."
    },
    {
      "end": 232570,
      "speaker": "A",
      "start": 226010,
      "text": "Also am besten ist natürlich immer, wenn ihr einen Kommentar auf der Plattform eurer Wahl da lässt, dann wissen wir nämlich auch, warum ihr die Folge gut oder schlecht fandet."
    },
    {
      "end": 256310,
      "speaker": "B",
      "start": 233210,
      "text": "Das kam ja jetzt bei uns übrigens auch beim Voting. Ich habe endlich den Bug gefixt. Wenn man keine E Mail Adresse eingibt, dass man eine Fehlermeldung bekommt oder eine JSON Antwort habe ich gestern gefixt. Kann man also jetzt auch da einen Kommentar eingeben, Dann braucht ihr nicht unbedingt auf Spotify oder so einen Kommentar hinterlassen, wenn ihr das nicht wollt. Und wir fordern ja auch gerne andere Systeme und nicht immer nur die großen Insofern gerne da auch ein Feedback zurücklassen."
    },
    {
      "end": 295410,
      "speaker": "A",
      "start": 256310,
      "text": "Ich finde es nämlich immer schwierig, immer wenn der rote Balken so nach oben geht. Ganz viele Leute finden diese Folge nicht Thumbs up würdig. Das heißt für mich ist sie jetzt schlecht, ist die jetzt nicht gut, trifft das jetzt nicht deren Geschmack? Also ich kann mit dieser Zahl dann relativ wenig anfangen, denn ich sehe nur einen roten Balken, ganz viele Thumbs down. Aber ich weiß ja jetzt nicht, was ich jetzt besser machen soll. Das ist ja das Problem. Vielleicht war die Audioqualität auch einfach nur sehr bescheiden, dass man sich das einfach nicht anhören konnte. Man weiß es nicht. Deswegen am besten mal einen Kommentar da lassen, dann wissen wir auch, was besser zu machen ist. Aber lass uns mal zu dem Grund kommen, weswegen die Leute hier eigentlich eingeschaltet haben. Wolfgang."
    },
    {
      "end": 327900,
      "speaker": "B",
      "start": 295650,
      "text": "Genau, starten wir mal mit ein paar Fragen, die wir bekommen haben. Und ich habe mich wirklich bemüht, keine KI oder AI Frage am Anfang zu wählen, weil das ist ja irgendwie das Hot Topic. Wir haben auch gar nicht so viele dazu bekommen. Also nehmen wir mal eine ganz spezifische Frage, die ganz leicht hoffentlich zu beantworten. Was haltet ihr von Linter und Formaten? Hilfe oder Zwang? Finde ich eine super Frage, weil der Andi ist immer der, der mir dann die ganzen Linter einfach so mit klassischen GitHub Standard Actions reinwirft und dann fehlen immer alle meine Commits und Pushes."
    },
    {
      "end": 389550,
      "speaker": "A",
      "start": 327900,
      "text": "Also hier gibt es nur die einzig wahre, die sind ein Segen. Ich weiß gar nicht, wie wir früher ohne arbeiten konnten, meines Wissens nach oder meiner Erkenntnis nach. Und bitte korrigiert mich da, falls ich da falsch liege. Die Sprache Go hat das mal wirklich, ich sag mal, salonfähig gemacht mit Go FMT. Die Jungs und Mädels von Go, die haben einfach gesagt, es gibt einen Go Standard, einen Formatter und der folgt den Coding Guidelines hier. Und wenn du einfach Go FMT machst, dann läuft die ganze Sache einfach durch. Da gibt es dann jetzt keine Diskussion mehr über Dieser Coding Style Guide ist so oder so. Und jetzt das Beste, in den ganzen Code Reviews hast du nicht mehr diese Nitpicker, diese Klammer gehört in die nächste Zeile. Das machst du einfach, wenn du speicherst in deiner IDE oder wir haben das auch in unseren Projekten hier beim Engineering Kiosk. Wir haben, ich glaube, jede Woche einen GitHub Action Job laufen, der sich den ganzen Source Code einmal pullt, einmal formattet und einmal wieder nach oben pusht, weil im Endeffekt, das ist nichts, wo ich Energie drauf anwenden sollte, sondern dafür gibt es Maschinen. Also Hilfe oder Zwang. Es ist eine Hilfe und es sollte Zwang sein."
    },
    {
      "end": 482870,
      "speaker": "B",
      "start": 450270,
      "text": "Jetzt hast du bei Go einen Formata und scheinbar war da wieder irgendein Dictator am Werk, der einfach entschieden hat, das ist der Standard, der zu verwenden ist. Jetzt alle sinnvollen Sprachen sind da ja ein bisschen offener und erlauben da Flexibilität. Wie handhabst du Stop? Welche Formate verwendest du, welche Guidelines, Welchen Code Style? Wie wählst du das aus? Oder auch in deinem Team ist ja wahrscheinlich auch in deinen Teams vielleicht mal die Diskussion gewesen. Wobei in dem Infrastrukturbereich, da macht man sowas nicht, oder? Da macht man nur YAML, da gibt es sowieso nur einen Style."
    },
    {
      "end": 505030,
      "speaker": "A",
      "start": 482870,
      "text": "Soviel ich weiß, hat Rust auch einen Rust FMT und soviel ich weiß, haben die auch einen opinionated Coding Style Guide. Und Achtung, ist ja eigentlich mal aufgefallen, dass die meisten Frameworks und Sprachen einfach so populär geworden sind, weil sie opinioniert sind, siehe Ruby und Rails und Co. Aber nun gut, wenn du opinionate schlecht findest, dann belassen wir das bei dem du lenkst ab."
    },
    {
      "end": 508750,
      "speaker": "B",
      "start": 505030,
      "text": "Meine Frage war ja, wenn du da eben mehrere zur Auswahl hast, wie machst du das in einem Team?"
    },
    {
      "end": 555850,
      "speaker": "A",
      "start": 508750,
      "text": "Ich meine hier und da, je nach in einem Coding Style Guide, je nach Regel gibt es ja auch technische Gründe, aber wenn es nur um Subjektivität geht, das eine sieht schöner aus als das andere, da sage ich Jungs und Mädels, bitte einigt euch. Mich interessiert das jetzt hier nicht, weil im Endeffekt, ob die Klammer jetzt in derselben Zeile oder in der nächsten Zeile steht, das ändert ja nichts am Produkt. Und im Endeffekt, wenn du dich mit dem Code identifizierst und wenn du dich mit dem Code, wenn du da öfters daran arbeitest, dann gewöhnst du dich einfach an alles. Für mich ist nur wichtig, dass man sich auf eine Sache einigt und dass man die dann so schnellstmöglich automatisiert. JavaScript oder typescript, wer heißt das? Es lint oder wie sie alle heißen, von mir aus auch YAML Formatter nutzt einfach die Default Sachen. Also ich verstehe nicht, warum es da so große Diskussionen zu gibt, warum Leute da so harte Energie reinstecken, ob es jetzt zwei oder vier Whitespace sind."
    },
    {
      "end": 617430,
      "speaker": "B",
      "start": 555850,
      "text": "Du lieferst Ja, weil eben alle Opinion sind und die Opinions von den verschiedenen Leuten krachen dann gegeneinander. Also ich habe das auch einmal miterlebt, aber am Ende ist es dann ganz gut gelaufen über eine Gilt und die Gilt hat dann gemeinsam entschieden. Also ich bin mir nicht sicher, ob das schnell war, dieser Prozess, weil da sind wirklich viele, viele Personen Stunden reingeflossen und ein harter Kampf gewesen. Aber das Gute am Ende war, es gab eine Entscheidung und ab diesem Zeitpunkt war das einfach gegessen und auch die Leute, die Onboarding gemacht haben, es war einfach dann fixiert und alle Teams in der gesamten Firma haben das gemacht. Obwohl es auch die Diskussion war, müssen das alle Teams machen können manche Teams anders machen und so weiter. Aber das war über eine Bildstruktur, wo einfach dann aus allen Teams Leute eingebunden sind, hat es eigentlich erstaunlich gut funktioniert. Aber es wurde sicher viel Zeit verbrannt. Auf der anderen Seite, glaube ich, ist es immer noch effizienter, als wenn du die Zeit nicht verbrennst und dann ständig die Diskussion hast. Das ist ja noch viel, viel schlimmer. Oder die ganzen Probleme dann mit dem Pull Request und so weiter. Also du musst wahrscheinlich irgendwann diese Zeit investieren, um die Entscheidung zu treffen."
    },
    {
      "end": 626890,
      "speaker": "A",
      "start": 617430,
      "text": "Ja, ich gehe einen Schritt weiter. Ich sage, ich investiere die Zeit nicht. Ich nutze einfach irgendwas Fertiges von irgendwelchen sehr intelligenten Leuten, die sich da schon jahrelang oder stundenlang Gedanken drüber gemacht haben und und nutze das."
    },
    {
      "end": 639370,
      "speaker": "B",
      "start": 627450,
      "text": "Ja, das kannst du jetzt sagen, aber wenn du zwei, drei hundert Entwicklerinnen unter den Hut bringen musst, ist es schon schwieriger. Also du bist CTO und sagst einfach so ist es. Kannst du natürlich machen, aber ich glaube, es ist kein guter Weg."
    },
    {
      "end": 645130,
      "speaker": "A",
      "start": 639370,
      "text": "Ja, da ist die nächste Frage, ob die ganze Firma einsteigert haben muss oder ob die Teams das nicht selbst automatisiert haben."
    },
    {
      "end": 647890,
      "speaker": "B",
      "start": 645690,
      "text": "Große Diskussion im Endeffekt."
    },
    {
      "end": 652610,
      "speaker": "A",
      "start": 647890,
      "text": "Zurück zur Frage, was haltet ihr von Lintern und Vormettern ein Segen, Aber was ist mit Lintern?"
    },
    {
      "end": 658620,
      "speaker": "B",
      "start": 652610,
      "text": "Lintern ist ja auch nochmal so eine Sache. Stört dich das? Weil keine Ahnung, ob es ein Code wirklich dann besser macht."
    },
    {
      "end": 701830,
      "speaker": "A",
      "start": 658620,
      "text": "Aber nein, ich habe Linter in jedem Projekt drin als Pre Merge Requirement drin. In Go ist es dann jetzt hier Static Lint und Golint, also klassische Fehler, die abfangen, wie zum Beispiel neue Variablendeklarierung, Überschreibung und so weiter. Also Das verhindert ja wirklich Bugs. Und wenn du jetzt mit Lintern jetzt sagst, nicht nur Syntax Linter, sondern wirklich synchron Static Linking, also Static Analysis, was für mich auch dazugehört, dann rettet dir das den Popo über Production Bugs und richtig dreckige Bugs. Also Pflicht, Punkt, aus, Ende, die Tools sind fertig nutzen. Wer das nicht macht, der verbrennt Trillionen von Stunden und Kopfschmerzen wegen Production Bugs. Und die gibt es ja jetzt in jeder Sprache, solche kleinen dreckigen Bugs."
    },
    {
      "end": 712150,
      "speaker": "B",
      "start": 701830,
      "text": "Was ist denn mit diesen ganzen Kommentaren, die dann irgendwelche Linter in manchen Zeilen abschalten und diese ganzen Dinge, weil, weil Linter ja schon auch öfters Probleme machen diesbezüglich."
    },
    {
      "end": 719510,
      "speaker": "A",
      "start": 712230,
      "text": "Ah ja, kann man nutzen zum Beispiel. Es gibt auch ein Linter by Go zum Beispiel, der holt dir ziemlich viele Typos."
    },
    {
      "end": 722950,
      "speaker": "B",
      "start": 719670,
      "text": "Sag mal, hast du auch noch irgendwelche anderen Beispiele als Go, das ist halt."
    },
    {
      "end": 801100,
      "speaker": "A",
      "start": 722950,
      "text": "Die Sprache, die ich am meisten nutze oder typescript bei uns auf der Arbeit Option ein bisschen. Aber wenn du Kommentare hast und du hast dann, du hast einen Tippfehler drin, dann kommt der Linter mit einem englischen Wörterbuch, dann hast du jetzt Wort aus einer Fachdomäne, was vielleicht jetzt nicht Englisch ist, sondern weiß ich nicht Deutsch, weil es halt so heiß Steuerfachrecht oder so, wenn es an der Steuersoftware arbeitest, dann schlägt der Linter halt an, Dann muss er halt entweder das Wort zu der Liste hinzufügen oder, also dann musst du da halt auch eine Ausnahme machen. Und wenn du wirklich weißt, was du tust, dann ist es ab und zu okay, den Linter auszuschalten. Es kann ja auch sein, dass der Linter auch einen Bug hat, muss man ja auch zugeben. Dann reportest du den Bug und dann sagst du, okay, wenn wir auf der nächsthöheren Version sind und der Bug gefixt ist, dann kannst du den, die Ausnahme wieder rausnehmen. Also ja, kann man machen. Wenn das jetzt aber nur zur Faulheit ist, da bin ich dagegen, dann sollte das auch im PR angemarkert werden. Kommt natürlich auf den Aufwand drauf an. Wenn das ein Architekturproblem ist und das drei Wochen Arbeit ist, dann würde ich sagen, okay, weiß ich jetzt nicht, ob man da jetzt im Linter die hundertprozentige Approval geben, aber du warst ja einer der, wie soll man sagen, der Leidtragenden von meiner Linter und Vormitta Thematik oder hast es zumindest immer stillschweigend hingenommen und du hast dich gerade auch schon wieder beschwert, dass deine Pre Commit Hooks und was weiß ich nicht alles Merch immer fehlschlagen, weil irgendein Linta meckert."
    },
    {
      "end": 898409,
      "speaker": "B",
      "start": 801100,
      "text": "Ja, das ist es ja, wenn man Pre Commit Hooks hätte, ging das ja eh ganz gut. Also was mich dabei stört, ist eigentlich nur, dass das Tooling teilweise ein bisschen schwierig ist, dass man zu spät erst merkt, dass es ein Problem gibt, weil wie gesagt, das Commit Hooks, bin kein großer Fan davon, muss man einrichten. Die IDE sind dann teilweise unterschiedlich. Es ist zwar mittlerweile einfacher mit den ganzen Config Files, die dann vielleicht sogar IDE übergreifend agieren, aber da hätte ich einfach noch gern mehr Automatisierung. Das wäre natürlich cool, dass es irgendwie automatisch gecheckt wird oder vielleicht die IDE auch sinnvoll übernimmt. Vielleicht bin ich da auch zu faul, das einzurichten. Kann natürlich auch gut sein, dass ich mir mehr damit beschäftigen müsste. Aber grundsätzlich finde ich schon gut, Linda und Formata zu haben, vor allem Formata, also das beim Safe einfach das richtig formatiert wird, das finde ich schon Segen. Und vor allem, wenn man so an die frühere Zeit denkt, wo du dann zu prs bekommen hast, wo einfach das komplette Format umgestellt war und die einfach nicht reviewbar waren. Schwieriges Wort, also das gibt es eigentlich kaum mehr und das ist schon gut. Wir hätten ja auch gerne erwähnt, wer diese Frage gestellt hat, aber diese Person wollte den Namen nicht an Google übersenden, ist im Namensfeld gestanden. Darum kommen wir jetzt zur nächsten Frage, die eigentlich sehr, sehr eng auch mit der ganzen verknüpft ist, weil der Andi hat jetzt Go schon hunderttausend Mal erwähnt und eine Sprache, wo es irgendwie tausende Style Guides gibt, auch die Sprache selber ganz viele Styles hat und Einstellungsmöglichkeiten. Ist Andis Lieblingssprache JavaScript? Und der Matthias hat uns da eine Frage gestellt. Wieso hasst Andy denn JavaScript?"
    },
    {
      "end": 902370,
      "speaker": "A",
      "start": 898409,
      "text": "Hasse ich denn JavaScript oder mag ich es nur nicht? Weil hassen ist so ein starkes Wort."
    },
    {
      "end": 904130,
      "speaker": "B",
      "start": 902530,
      "text": "Hast du keine starke Meinung?"
    },
    {
      "end": 907650,
      "speaker": "A",
      "start": 904370,
      "text": "Eine starke Meinung heißt nicht, dass ich etwas hassen muss versus nicht mögen."
    },
    {
      "end": 917070,
      "speaker": "B",
      "start": 907650,
      "text": "Aber solltet ihr jetzt diese Slack Messages raussuchen, wo du irgendwie der Rotz oder sonstige Sachen geschrieben hast oder diese, keine Ahnung, was du noch für Wörter verwendet hast."
    },
    {
      "end": 1010400,
      "speaker": "A",
      "start": 917070,
      "text": "Also erstens, da ging es um typescript, zweitens hatten wir da schon in Episode zwei hundert drüber gesprochen, dass du typescript genommen hast und dann trotzdem nicht typensicher gearbeitet hast, weil deine Meinung war, das geht nicht. Und dann frage ich mich, warum nutzen wir typescript, aber warum hasse ich JavaScript? Also pass auf, die Thematik ist wie folgt. Ich finde es sehr schade, dass JavaScript die einzige Sprache ist, die man kleinseitig im Browser verwenden kann. Ich hätte da gerne mehr Konkurrenz und ich denke, dass mir da ziemlich viele Leute zustimmen würden, da vielleicht mal ein bisschen Innovation zu haben. Typescript ist keine Konkurrenz, weil das wird wieder in JavaScript transpiliert. Deswegen zählt das nicht meines Erachtens nach. Und Kombi nicht mit webassembly, dass man da irgendwie jede Sprache in webassembly machen kann, Weil im Endeffekt ist es ja halt auch irgendwie bei JavaScript ist es so, ich habe ja auch sehr viel JavaScript programmiert im Browser und tue ich ja hier und da immer noch gezwungenermaßen wegen der Monopolstellung. Ich mag es halt einfach nicht auf Serverseite. Ich finde eine Skriptsprache, die primär fürs Frontend definiert wurde und auch für den Browser designt wurde, hat im Backend nichts zu suchen, denn diese Dependency Hell, die sich da auftut, dass wir ganz viele kleine Pakete haben. Ich frage mich immer warum, Weil das ursprüngliche Versprechen oder die ursprüngliche Idee, die fand ich ja nett, dass du Code zwischen zwischen Frontend und Backend sharen kannst. Und ich glaube, paypal hat sich mal aus dem Fenster gelehnt und hat Ja, wir machen das. Kennst du noch eine andere Firma, die das wirklich tut?"
    },
    {
      "end": 1050140,
      "speaker": "B",
      "start": 1010400,
      "text": "Im kleineren Sektor gibt es sehr viel und mit dem ganzen Nuxt und Next JS und diese Frameworks, wo du so Client Code und Server Code bis zum gewissen Bereich in einem Projekt auch wirklich drin hast und das sauber dann gerendert wird auf der Serverseite schon und solche Sachen. Also gibt es durchaus mehr Bewegung. Wirklich in großen Projekten sind es dann meistens sowieso getrennte Repositories und wirklich komplett getrennte Systeme. Also es sei auch gar nicht als großen Vorteil eigentlich mehr an oder habe es auch nie als großen Vorteil angesehen, weil es in der Realität eher selten der Fall ist, außer du machst jetzt so ein Backend for Frontend da vielleicht eher."
    },
    {
      "end": 1053260,
      "speaker": "A",
      "start": 1050140,
      "text": "Ich finde die Idee Granate, aber sie hat sich halt einfach nicht bewährt."
    },
    {
      "end": 1068120,
      "speaker": "B",
      "start": 1053580,
      "text": "Ich glaube, dass es konzeptionell auch gar nicht geht, dieses Checken. Klar, du könntest jetzt sagen, du hast irgendwelche Field Checks oder so, die du sharest, das könntest du noch über irgendwelche Libraries, aber das ist so wenig Code, dass es sich eigentlich kaum rentiert, meiner Meinung nach."
    },
    {
      "end": 1095460,
      "speaker": "A",
      "start": 1068280,
      "text": "Das würde ich nicht unterschreiben. Ich denke, man kann sehr viel Code sharen, wenn man jedoch eine gute Abstraktion hat, weil du musst die ganze Sache vom DOM abstrahieren und kannst halt nichts HTML spezifisches haben und so weiter und so fort, weil du hast ja kein DOM im Backend eigentlich. Klar, jetzt kommen wir nicht mit, du kannst ja eine V A Einborn. Ja, kannst du auch, alles ist schon richtig, aber da führt die ganze Sache ja schon irgendwie ad absurdum. Also das hat sich nicht bewährt. Deswegen denke ich, hat es im Backend nichts, nichts wirklich zu suchen."
    },
    {
      "end": 1121600,
      "speaker": "B",
      "start": 1095460,
      "text": "Aber es gibt ja keine Definition, dass du im Backend irgendwie nur eine Sprache verwenden darfst, wo du Code scheren kannst. Also das ist ja, das war eine Argumentation, dass das vielleicht cool wäre, aber du hast ja mittlerweile eine JavaScript Welt, die sich weiterentwickelt hat, wo es neue Versionen gibt. Ecmascript hat sich wirklich stark verändert. Es kann gut oder schlecht sein, aber es hat sich stark verändert und die ganze Serverwelt ist ja da auch mit reingewachsen. Eine Sprache kann sich ja auch weiterentwickeln."
    },
    {
      "end": 1143280,
      "speaker": "A",
      "start": 1121600,
      "text": "Also ich meine, JavaScript ist, da muss ich zugeben, einer der Sprachen, die sich am meisten und am schnellsten weiterentwickelt hat. Das ist korrekt, aber auch erst seit die ganze Thematik auf der Serverseite kam. Also das bedeutet, da sieht man ja wieder Konkurrenz belebt das Geschäft. Das bedeutet, weil auf der Serverseite mehr Konkurrenz da ist, wurde gesagt, ah OK, vielleicht sollte man bei JavaScript andere Sprache langsam mal was tun."
    },
    {
      "end": 1145710,
      "speaker": "B",
      "start": 1143280,
      "text": "Das heißt, du hast gerade dein eigenes Argument widerlegt."
    },
    {
      "end": 1200830,
      "speaker": "A",
      "start": 1146100,
      "text": "Nein, ich mag es trotzdem nicht im Backend, weil ich denke, Frontend Entwicklung und Backend Entwicklung sind zwei völlig unterschiedliche Paar Schuhe. Du hast ein komplett anderes Skalierungsmodell. Du hast im Frontend, hast du deine Ressourcenverteilung auf Millionen von Clients. Wenn du da Resource Leaks hast, dann hast du einen Effekt nur auf einen einzelnen Browser, wo du im Backend in der Regel Millionen Clients auf einer Instanz hast und da somit Bugs and Resource Leaks und allem drum und dran sich auf Millionen Request verteilen. Also das Skalierungsmodell ist ein komplett anderes, deswegen ist das Programmiermodell was komplett anderes auf dem Backend und Ich würde verstehen, wenn man JavaScript im Backend nutzt, wenn man diese Code Sharing Sache macht. Das finde ich ja, ist ein gutes Modell, habe ich ja gerade schon gesagt, hat sich aber in der Praxis in der Regel nicht bewährt und ich nehme gerne Ressourcen und Links und Case Studies entgegen, wo dies wirklich mal genutzt wird, weil da sage ich, OK, coole Sache."
    },
    {
      "end": 1207540,
      "speaker": "B",
      "start": 1201220,
      "text": "Was, du willst jetzt große typescript Projekte sehen? Ja, wie gesagt, typescript oder mit dem Sharing?"
    },
    {
      "end": 1223980,
      "speaker": "A",
      "start": 1207700,
      "text": "Also für mich ist typescript ja schon fast kein JavaScript mehr, weil es ist eine neue Sprache, die halt nur keinen eigenen Compiler und keine eigene Runtime hat, weil sie ja nach JavaScript transpiliert wird. Deswegen hasse ich typescript. Nein, mag ich JavaScript nicht. Ja, aber typescript ist ja nicht JavaScript."
    },
    {
      "end": 1225500,
      "speaker": "B",
      "start": 1223980,
      "text": "OK, magst du typescript?"
    },
    {
      "end": 1228820,
      "speaker": "A",
      "start": 1225500,
      "text": "Typescript finde ich deutlich besser, weil damit kann man endlich mal arbeiten."
    },
    {
      "end": 1232420,
      "speaker": "B",
      "start": 1229940,
      "text": "Politiker Antwort. Magst du typescript?"
    },
    {
      "end": 1237860,
      "speaker": "A",
      "start": 1232420,
      "text": "Schreibe ich es gerne? Ne, mag ich es mehr als JavaScript?"
    },
    {
      "end": 1258070,
      "speaker": "B",
      "start": 1237860,
      "text": "Ja, eines mehr. Okay, also du magst es auch nicht, aber es ist besser als JavaScript, da gehe ich ja voll mit dir mit. Gar kein Thema. Also heutzutage, ich glaube vor allem wenn man im Serverbereich ist, also ich hoffe nicht, dass es Leute noch gibt, die in einem neuen Projekt JavaScript einsetzen und nicht typescript in einem Serverprojekt. Also es wäre schade, finde ich."
    },
    {
      "end": 1264270,
      "speaker": "A",
      "start": 1258070,
      "text": "Dann das Ecosystem mit den Dependencies. Also ich habe keine Ahnung, woher diese Tendenz zu diesen Mikro Packages kommt."
    },
    {
      "end": 1275590,
      "speaker": "B",
      "start": 1264270,
      "text": "Ja, ist durchaus ein Problem, aber musst du ja auch nicht unbedingt verwenden. Klar bist du abhängig, andere Pakete inkludieren dann wieder andere und du hast sehr viele Pakete, aber ja, du musst schon sehr zustimmen."
    },
    {
      "end": 1289140,
      "speaker": "A",
      "start": 1275590,
      "text": "Es ist sehr, sehr schwer da vorbeizukommen. Du musst enorm viel Aufwand reinstecken, um keinen Dependency Tree mit einer vierstelligen Anzahl Dependencies zu haben oder hoch dreistellig. Du musst enorm viel echt aufpassen."
    },
    {
      "end": 1314210,
      "speaker": "B",
      "start": 1289460,
      "text": "Aber ich persönlich finde es jetzt nicht schlimmer als in anderen Sprachen. Klar, du hast viel, viel mehr Dependencies, aber du hast eigentlich dieselben Probleme. Also ihr hattet genauso bei anderen Sprachen genauso diese Dependency Probleme und Update Probleme und neue Versionen. Also es geht vielleicht noch eine Spur schneller bei JavaScript, aber dass ich Probleme mit dem Ganzen habe, mit dem Dependency Management, kenne ich eigentlich aus jeder Sprache und die Upgrades sind einfach schwierig."
    },
    {
      "end": 1329570,
      "speaker": "A",
      "start": 1314610,
      "text": "Die Upgrades schon, aber wie gesagt, die Häufigkeit macht es auf der einen Seite. Dann die zweite Thematik, Security technisch. Dependency Reviews sind einfach bei JavaScript unmöglich. Machen wir uns mal nichts vor. In anderen Sprachen kannst du es vielleicht noch irgendwie hinkriegen. Machen auch, glaube ich, die wenigsten Teams."
    },
    {
      "end": 1335090,
      "speaker": "B",
      "start": 1330050,
      "text": "Ich wollte sagen, also ich glaube, wir sprechen über Sachen, die eigentlich in der Realität ganz selten sowieso gemacht werden."
    },
    {
      "end": 1420660,
      "speaker": "A",
      "start": 1335490,
      "text": "Gut, das ist alles schon traurig, aber die einzig wahre Theorie oder die Theorie da, wo ich sagen würde, okay, da gehe ich halt mit. Warum es diese Micro Packages gibt, kam mal aus dem Buch Working in Public. Da wurde gesagt, okay, JavaScript hat ganz viele kleine Pakete, um die Arbeit für die Maintainer managebar zu halten, weil eine große Codebase kann von einem Maintainer, von einem Open Source Maintainer nicht mehr maintained werden, weil die halt so groß ist. Deswegen ist JavaScript oder deswegen ist das JavaScript Ecosystem dahin gegangen, ganz viele kleine Pakete zu machen. Und jetzt hast du, Wolfgang, jetzt hast du ein Paket ist false, das gibt es ja leider, glaube ich, oder ist true, da rede ich jetzt nicht drüber. Und das Paket ist so klein von der Code bisher, dass du das alleine main kannst. Deswegen gibt es ganz viele kleine Pakete. Also diese Grundidee davon, da gehe ich mit und macht ja auch irgendwie Sinn. Aber dann hast du natürlich diese komplette Dependency Tree Kette. Und ja, ich sage auch, weil es ganz viele Pakete gibt und weil die ganze Thematik dann so undurchsichtig Das ist natürlich ein Nährboden für Hacker und für Bösewichte, sich die ganze Thematik näher anzusehen und für Phishing, Attack und all drum und dran, all das, was wir sehr viel sehen. Also ich sage so, das eine befüttert halt dann das Security Problem, aber das ist auch ein Grund, warum ich einfach Ja gut, hasse ich deswegen die Sprache JavaScript. Ich hasse, wohin sich das Ecosystem entwickelt hat, aber der Einfachheit halber schmeiße ich das jetzt einfach alles in einen Topf. Deswegen, du willst opinionated? Hier hast du opinionated."
    },
    {
      "end": 1476330,
      "speaker": "B",
      "start": 1421060,
      "text": "Also wie gesagt, ich glaube, dass es ein kleineres Problem ist, als was man oft so denkt. Und ich erfahrungsgemäß ist es in anderen Sprachen auch so. Aber gehen wir mal weiter. Bei mir im Hintergrund läuten schon die Glocken. Religiöses Thema ist sehr passend bzw. Auch die Frage, ob man in Zukunft überhaupt noch so viele Pakete braucht oder ob das nicht sowieso von LLMs dann einfach programmiert wird. Diese vor allem diese kleinen Pakete, dass man gar nicht mehr einbindet, sondern programmieren lässt, Was ja auch so die Go Herangehensweise ist. Ich kopiere mir irgendwo einen Code, anstatt eine Library hereinzuholen. Aber die Frage die konkrete AI und KI muss natürlich doch irgendwo drin sein. Und zwar von Tiffy W. Wie behält man die Ruhe bei den ganzen Neuigkeiten um LLMs und AI und verliert trotzdem nicht den Anschluss? Jetzt haben wir da komplett unterschiedliche Herangehensweisen drum. Andi, jetzt bin ich mal gespannt. Wie verlierst du nicht den Anschluss? Du bist ja mittlerweile sogar zum LLM User geworden, obwohl du dich lang geweigert hast."
    },
    {
      "end": 1501320,
      "speaker": "A",
      "start": 1476330,
      "text": "Die einzig wahre konstante Ignoranz. Ich höre gerade einen Podcast von Hotel Matze. Er hat einen Gast eingeladen, Gregor Schmalzried, mit der Wie nutzen wir KI richtig? Gregor ist ein Tech Journalist, unter anderem von dem KI Podcast von der ARD oder ähnliches. Und sogar er, der sich beruflich damit beschäftigt. Er kriegt nicht alles mit."
    },
    {
      "end": 1507760,
      "speaker": "B",
      "start": 1501720,
      "text": "Aber das ist ja keine Ignoranz, man bekommt nicht alles mit. Aber das ist nicht, dass ich alles ignoriere."
    },
    {
      "end": 1599570,
      "speaker": "A",
      "start": 1507760,
      "text": "Nein, die Frage und verliert trotzdem nicht den Anschluss. Das bedeutet, TV setzt da Anforderungen an sich selbst, die in der Regel nicht erfüllt werden können. Wenn im Vergleich, wie jetzt gerade von Gregor Schmalzried gesagt Leute, die sich beruflich als Tech Journalist mit KI beschäftigen, sogar ich verpasse auch Dinge, dann frage ich Wie kann tiffiwe nicht den Anschluss verlieren, aka den Anschluss verlieren? In einem Umfeld, was sich so schnell nach vorne entwickelt, ist der Normalzustand. Jetzt hast du mehrere Möglichkeiten. Du kannst dich irgendwie in den Burnout treiben, alles lesen, konsumieren zu dem Thema, aber dann testest du es nicht aus und lernst auch nicht damit umzugehen. Oder du akzeptierst, dass du einfach gut genug informiert bist und einfach nicht alles mitnehmen kannst. Also wie behält man die Ruhe bei den ganzen Neuigkeiten und wie verliert man trotzdem nicht den Anschluss? Also meine Vorgehensweise ist, ich höre zum Beispiel sehr oft die AI News von der Programmierbar. Das ist auch ein deutscher Tech Podcast, verlinken wir auch in den Shownotes. Zugegeben, die News, ich bin ehrlich, sind ein bisschen langweilig geworden, weil irgendwie alle zwei Wochen heißt es da neues Modell sieben und vierzig elf mit zehn Trillionen Token Windows und dann in zwei Wochen neues Modell vier tausend acht hundert elf mit fünf Trillionen Token Windows. Also die News gehen eigentlich nur in die Richtung, okay, die Modelle werden größer und so weiter. Deswegen aber die Ruhe."
    },
    {
      "end": 1616610,
      "speaker": "B",
      "start": 1599570,
      "text": "Also wenn ich die Frage richtig verstehe, dann bezieht sich ja die Ruhe auch vielleicht. Wie kann man gelassen bleiben mit der ganzen Entwicklung? Also du programmierst ja nichts mehr in deinem Job, du brauchst ja keine Angst haben. Vielleicht kann man dann mit LLMs auch mal den Engineering Manager weg optimieren."
    },
    {
      "end": 1636240,
      "speaker": "A",
      "start": 1616770,
      "text": "Ich glaube sogar eher, dass der Engineering Manager in vielen Sachen deutlich mehr wegoptimiert wird als Softwareentwickler und Softwareentwicklerinnen. Und weil ein Design Dokument und so weiter für Cursor und Cloud Code muss ja trotzdem noch schreiben, damit der Agent weiß, was zu tun ist. Und so ein Engineering Manager eine Performance Review für jemanden zusammen zu schreiben, sorry, da kann die AI deutlich besser als ich inzwischen."
    },
    {
      "end": 1637680,
      "speaker": "B",
      "start": 1636240,
      "text": "Warum braucht es dich dann noch?"
    },
    {
      "end": 1670150,
      "speaker": "A",
      "start": 1637680,
      "text": "Du pass mal auf, niemand hat gesagt, dass ich gebraucht werde. Also andere Leute denken noch, ich erzeuge Value und ob ich jetzt selbst einschätze, ob ich gebraucht werde, ist eine andere Frage. Aber im Endeffekt, wie behält man die Ruhe bei den ganzen Neuigkeiten? Ich denke, man sollte es ab und zu mal ein bisschen austesten, ein bisschen rumspielen. Mache ich ja auch in letzter Zeit sehr viel. Ich habe mir jetzt die Tage auch Cloud Code besorgt, habe da mal ein bisschen mit dem Agent rumgespielt, spiele ein bisschen mit NN so eine Automation Engine mit AI Workflows rum, hänge inzwischen jeden Tag im Google Gemini rum und prompte da sehr viel und probiere da aus."
    },
    {
      "end": 1685020,
      "speaker": "B",
      "start": 1670150,
      "text": "Kleines Trivia am Rande, weil du gerade NN erwähnt hast. Weißt du was das eigentlich heißt? Nein, habe erst gerade neuerdings gelernt. Das ist so wie Kubernetes mit K, das heißt, es sind die acht Buchstaben dazwischen und es heißt Notation."
    },
    {
      "end": 1687460,
      "speaker": "A",
      "start": 1685260,
      "text": "OK, cool. Wo hast du es gelernt?"
    },
    {
      "end": 1696700,
      "speaker": "B",
      "start": 1687460,
      "text": "Es ist jetzt peinlich im Doppelgänger Podcast. Habe mir das von BIP erklären lassen müssen, aber die haben das auch nur live gegoogelt. Also, aber habe ich auch nicht gewusst. Ich habe auch bis vor kurzem immer NN gesagt."
    },
    {
      "end": 1781270,
      "speaker": "A",
      "start": 1697020,
      "text": "Eine andere Strategie, um die Ruhe zu bewahren mit den ganzen Neuigkeiten ist vielleicht so ein bisschen vergleichbar mit Litauen und Lettland. Litauen und Lettland. Haben fast überall Glasfaser inzwischen. Jetzt fragt man sich, okay, wieso haben die alles so schnell das Internet ja relativ einfach, weil die sich so spät entwickelt haben, jetzt kaum Koaxialkabel für DSL und so weiter liegen. Das bedeutet, die sind einfach von ISDN nach Glasfaser gesprungen und haben einfach eine komplette Ära übersprungen. So wo wir Deutschen dann jetzt überall mit unseren DSL Koaxialkabel im Boden rumhängen und jetzt erst Glasfaser ausbauen müssen und das erst langsam kommt. Also so kann man es natürlich auch sehen und so habe ich es am Anfang auch mit AI gemacht. Also der Wolfgang hat mich immer belächelt, ja, du musst mehr AI machen, mehr AI machen, mehr AI machen. Und am Anfang habe ich damit mal ganz kurz rumgespielt, OK, war mir nicht gut genug oder ich war einfach nur zu doof das zu verstehen, dann habe ich einfach mal zwei, drei, vier Monate gewartet und jetzt nutze ich das irgendwie jeden Tag und offen gesprochen, ich fühle mich jetzt nicht schlechter oder besser in der Bedienung als der Wolfgang, der das seit Anfang an mitbegleitet hat. Also ich denke nicht, dass ich dadurch einen Nachteil hatte. Von daher habe ich da jetzt, ich sag mal, die Ruhe bewahrt und einfach, ich bin später eingestiegen, aber aber hey, ich habe da jetzt keinen Produktivitätsverlust oder ähnliches. Jetzt kommt natürlich der Wolfgang, der kann sich jetzt wehren, ob der jetzt besser prompten kann oder nicht. Aber Prompt Engineering gibt es ja jetzt auch nicht mehr. Das heißt ja jetzt Kontext Engineering und ist anders. Also von daher sind deine Prompt Engineering Skills halt auch nicht mehr notwendig."
    },
    {
      "end": 1894680,
      "speaker": "B",
      "start": 1781670,
      "text": "Also als erstes würde mal die Episode ein hundert sieben und zwanzig empfehlen mit der Fanny über Impostor Syndrom und Beta Prinzip, weil da haben wir auch besprochen, was das Gegenteil von Impostor Syndrom ist, wenn man glaubt, man ist besser als man eigentlich ist und man glaubt, man kann perfekt prompten und ist so gut wie wenn man das von Anfang an mit begleitet hat. Aber das ist noch ein anderes Thema. Andi, kannst du dir mal anhören, ist eine coole Episode, besser prompten, keine Ahnung, ich glaube wie überall, wenn man einfach mehr damit macht, kann man besser damit umgehen. Ganz allgemein eine kleine Anekdote. Ich habe am Anfang erwähnt, dass sie diesen Bug gefixt habe, dass wenn man bei uns ein Upvote und Download macht und eine Message hinterlässt und keine E Mail eingibt, dass es da ein Problem gibt. Der Bug besteht seit langem, haben uns schon zwei, drei Leute geschickt. Ich habe einmal was probiert, es hat nicht funktioniert auf die Schnelle, dann ist es irgendwie liegen geblieben. Jetzt hat mir noch mal ein Kollege angeschrieben, danke Manu, hat gemeint, konnte keinen Comment angeben. Ihr habt schon ein Issue erstellt, damals schon. Und was ich jetzt mittlerweile gemacht habe in dem Issue, ich habe einfach vor zwei Tagen auf der rechten Seite das ganze copilot zugeordnet den Issue. Zwanzig Minuten später hatte ich einen Pull Request mit allen Tests und so weiter durchprobiert, habe den durchgeschaut. Es war wirklich nur eine Option, die gefehlt hat, aber aus irgendeinem Grund hatte die selber nicht am Schirm, habe auf Merge gedrückt, hat funktioniert, war alles durch. Also in dem Fall danke an copilot für den Bugfix. Und da hat man dann schon gesehen, es geht schon in eine Richtung, die schon sehr cool ist und solche Sachen muss man einfach entdecken, da geht es gar nicht. Darum hätte ich mir das nicht vorstellen können. Aber wenn man das einfach mal macht und auch Erfahrung sammelt, was ist möglich, wie gut funktioniert es, dann kann man das Ganze natürlich auch besser verwenden. Und ich glaube, genau darum geht es, wenn man nicht in Panik verfallen will. Man sollte sich einfach damit beschäftigen und das Zeug verwenden und dann lernt man einfach auch damit. Und was in Zukunft kommt, da müssen."
    },
    {
      "end": 1970540,
      "speaker": "A",
      "start": 1894680,
      "text": "Wir einfach abwarten, sagt Gregor Schmalzried im Hotel Matze Podcast eigentlich auch. Man muss es einfach mal verwenden. Und er sagte, vielleicht einfach ganz doof mit Basis Elementen starten, wie zum Beispiel, der hat eine Einkaufsliste und schmeiß diese Einkaufsliste in die AI und sortier mir die Liste mal nach Abteilungen im Supermarkt. Das klingt jetzt total trivial, aber das sind so Kleinigkeiten und so weiter. Gestern zum Beispiel habe ich wieder etwas festgestellt, wo die nicht so gut ist. Und zwar habe ich von einem Haus Dach ein Foto gemacht von der Seite und mein Ziel war, dass die AI das Bild analysiert, also chatgpt das Bild analysiert und mir den Winkel des Daches nennt. Ich habe mich gefragt, in welchem Winkel steht mein Dach zur Sonne für eine PV Anlage, für Photovoltaikanlage. Und da wollte ich einfach wissen, kann die AI das? Und dann habe ich dieses Dach einfach mal von links und einmal von rechts fotografiert, habe das reingeschmissen, stand da fünf und dreiig Grad im Winkel und da habe ich das andere Bild reingeschmissen, auf einmal stand neun und fünfzig Grad. Also ihr merkt schon, das ist vielleicht nicht ganz so ein guter Anwendungsfall für die AI. Zumindest habe ich da kein richtiges Ergebnis rausbekommen, kann natürlich auch an meinem Foto gelegen haben und so weiter, obwohl ich es eigentlich versucht habe, recht akkurat zu machen. Naja, aber das wäre so ein Fall, wo ich der AI jetzt nicht mehr vertrauen würde, zumindest heutzutage."
    },
    {
      "end": 2079510,
      "speaker": "B",
      "start": 1971380,
      "text": "Aber genau darum geht es, das zu lernen. Was kannst du machen, was kannst du nicht machen, wo musst du mehr überprüfen, was kannst du immer wieder mal überprüfen, was sind Fälle, was nicht funktionieren? Vielleicht funktionieren die in drei Monaten. Also es ist ja auch wichtig, dass man eben nicht sagt, okay, funktioniert einfach nicht, ich verwende das Ding nicht, sondern wo lerne ich, dass es besser wird. Und wenn man solche Cases hat, da merke ich einfach auch selber, wie gut das Ganze wird. Und was vor drei Monaten nicht funktioniert hat, funktioniert vielleicht jetzt, Das ist überhaupt kein Problem. Aber wenn wir schon bei dem ganzen Job Thema sind, ob die KI uns unsere Jobs wegnimmt. Es gibt ja auch so ein anderes Thema, was der Nico gefragt hat. Und zwar hat er gefragt, was haltet ihr von dem gefühlten Wandel von einem treuen Arbeitsverhältnis nach der Ausbildung zum eher nüchternen Jobhopping nach kurzen Projektphasen? Wie sieht es bei euch aus? Wie oft habt ihr denn den Job gewechselt? Und was der Nico da anspricht, ist sicher eine Entwicklung, die ich glaube, da können wir alle zustimmen, die es gibt, die jetzt vielleicht mit KI noch mal stärker wird, weil du brauchst weniger Einarbeitungszeit. Vielleicht früher hat es geheißen, du bist dann irgendwie Domain Spezialist in einer gewissen Branche. Das ändert sich jetzt vielleicht auch unter anderem durch die KI. Und ihr habt es schon auch gerade wenn ich mit Kunden spricht, die etwas älter sind oder aus traditionelleren Branchen kommen, die das auch gar nicht verstehen. Also die nicht verstehen, wie jemand, wie ein Entwickler, eine Entwicklerin einfach nicht zwanzig Jahre bei einer Firma bleibt. Also für die ist es ganz normal. Und vielleicht in traditionelleren Branchen ist es ja auch immer noch so, dass du vielleicht, keine Ahnung, startest als Elektriker und du gehst dann in Rente als Elektriker bei derselben Firma. Also das gibt es in anderen Branchen schon. Jetzt bist du auch, Andi, jemand, der gerade kürzlich wieder gewechselt hat. Und davor ja auch, seitdem du deine lange Zeit von, was war es bei Trivago? Acht Jahren. Neun Jahre."
    },
    {
      "end": 2081830,
      "speaker": "A",
      "start": 2079590,
      "text": "Neun Jahre oder neun Jahre, genau."
    },
    {
      "end": 2087430,
      "speaker": "B",
      "start": 2081830,
      "text": "Genau. Jetzt nur mehr da am herumspringen bist und da ja die Firmen öfter wechselst als die Unterhosen. Wie siehst du das?"
    },
    {
      "end": 2091140,
      "speaker": "A",
      "start": 2087670,
      "text": "Nur gucken, ob dein Satz auch standhält. Wie oft wechselst du die Unterhose?"
    },
    {
      "end": 2094810,
      "speaker": "B",
      "start": 2091450,
      "text": "Ja, also meiner Unterhosen Marke bin ich schon seit vielen, vielen Jahren treu."
    },
    {
      "end": 2124109,
      "speaker": "A",
      "start": 2094810,
      "text": "Ja gut, dann hält der Satz ja stand, denn ich bin gar nicht so ein Jobhopper, wie du das jetzt gerade beschreibst. Ich habe drei Jahre lang in einer Softwareentwicklungsagentur gearbeitet, da habe ich auch zweieinhalb Jahre zuvor meine Ausbildung gemacht. Dann war ich neun Jahre lang bei Trivago, Dann habe ich knapp drei Jahre lang bei einem Datenbank as a Service Provider gearbeitet und jetzt bin ich bei meinem vierten Arbeitgeber bei über fünfzehn Jahren im Job. Ich weiß jetzt nicht, ob das Job Hopping wäre."
    },
    {
      "end": 2129629,
      "speaker": "B",
      "start": 2124189,
      "text": "Ja, also du hast zwei Arbeitsverhältnisse mehr als ich. Ich habe nur zwei Arbeitsverhältnisse bisher gehabt in meinem Leben."
    },
    {
      "end": 2131949,
      "speaker": "A",
      "start": 2129709,
      "text": "Du bist selbstständig, das ist ja was anderes."
    },
    {
      "end": 2156910,
      "speaker": "B",
      "start": 2132189,
      "text": "Details, Details. Aber was heißt das jetzt bei dir? Du hast jetzt auch die Zeiten verkürzt. Du bist von acht Jahre dann auf drei Jahre. Ist es für dich, was Sinn macht? Würdest du sagen, okay, acht Jahre war wirklich zu lang und du würdest jetzt eher weniger lange Arbeitsverhältnisse wählen oder siehst du irgendwie einen Vorteil darin? Also wie blickst du jetzt auf diese Sache für dich persönlich?"
    },
    {
      "end": 2175660,
      "speaker": "A",
      "start": 2157230,
      "text": "Das Nüchterne und das Realistische ist leider, durch den Wechsel von Arbeitgebern entwickelt man sein Gehalt am schnellsten. Das ist meine Erfahrung und das würden ziemlich viele Leute im Internet so unterschreiben. Du bekommst bei einem Arbeitgeberwechsel in der Regel einen höheren Gehaltssprung, als wenn du lange bei jemandem bleibst."
    },
    {
      "end": 2177900,
      "speaker": "B",
      "start": 2175900,
      "text": "Das heißt, du machst es nur fürs Geld."
    },
    {
      "end": 2259420,
      "speaker": "A",
      "start": 2177980,
      "text": "Das habe ich nicht gesagt. Ich habe keine Relation auf mich genommen. Ich sage im nächsten Schritt, wenn man neun Jahre bei einer Firma ist und dort neun Jahre in einer Position, das halte ich auch für einen Fehler bei Trivago. Hatte ich schon mal eins, zwei, drei, vier, fünf verschiedene Jobs innerhalb von neun Jahren. Das bedeutet, ich habe Teams gewechselt, ich habe Positionen gewechselt, ich bin einmal die Managementleiter hoch und habe dann das Engineering Manager Pendulum angewandt, bin dann zurück zum Tech Lead und so weiter und so fort. Wenn man neun Jahre lang denselben Job macht, würde ich sagen, ist es vielleicht mal Zeit, über etwas Neues nachzudenken. Es kann ein anderes Team in der Firma sein, das kann ein anderer Arbeitgeber sein. Nach den neun Jahren habe ich dann die Firma gewechselt und die ersten sechs Monate waren wirklich, wirklich, wirklich, wirklich wieder anstrengend. Du hast mit neuen Leuten gearbeitet, du hast neue Denkensweisen kennengelernt, eine neue Architektur, neue Entscheidungskriterien und so weiter und so fort. Und dann habe ich mich Wow, die Erfahrung war so positiv. Warum habe ich nicht schon früher gewechselt? Da kam so der Gedankengang von, dass ich sehr viel gelernt habe in sehr kurzer Zeit und einfach eine komplett andere Perspektive gekriegt habe. Das fand ich sehr positiv, Dass ich jetzt nach drei Jahren wieder den Job gewechselt habe, kommt daher, dass ich denke, mein aktueller Arbeitgeber hat mir einfach eine sehr, sehr gute Möglichkeit gegeben, die ich einfach nutzen wollte. Da kam das. Da kam dann eins aufs andere eine."
    },
    {
      "end": 2262580,
      "speaker": "B",
      "start": 2259420,
      "text": "Sehr schöne politische Antwort. Also du hast wegen dem Geld gemacht."
    },
    {
      "end": 2265380,
      "speaker": "A",
      "start": 2262580,
      "text": "Das habe ich nicht gesagt. Du weißt doch gar nicht, ob ich mehr verdiene oder nicht. Also."
    },
    {
      "end": 2277040,
      "speaker": "B",
      "start": 2267200,
      "text": "Natürlich weiß ich das. Kennst du übrigens den Unterschied zwischen einem Kabarettisten und einem Comedian? Der Comedian macht es wegen dem Geld. Der Kabarettist macht deswegen des Geldes."
    },
    {
      "end": 2289920,
      "speaker": "A",
      "start": 2277040,
      "text": "Dankeschön, finde ich gut. Aber was die Frage ja auch initiiert, ist ein Wechsel nach Projektphasen, nach kurzen Projektphasen. Und da muss ich zugeben, kenne ich mich eigentlich gar nicht aus, weil ich habe noch nie nach einer kurzen Projektphase gewechselt."
    },
    {
      "end": 2398580,
      "speaker": "B",
      "start": 2290080,
      "text": "Also für mich als Selbstständiger ist es ja fast Normalität, dass man eben schnell wechselt von Projekt zu Projekt. Im Firmenkontext findet es schon auch so, bzw. Eigentlich auch im selbstständigen Bereich, wenn du mit einer Firma zusammenarbeitest, so richtig Fahrt nimmst du eigentlich erst auf nach einem halben bis einem Jahr, bis du alle Prozesse kennst, die Leute gut kennst, bis du richtig was bewegen kannst. Also sogar wenn du als Freelancer von außen kommst, brauchst du eine gewisse Zeit, um wirklich was meiner Meinung nach auf die Straße zu bringen. Insofern glaube ich, dass es schon eine gewisse Zeit braucht, um sinnvoll arbeiten zu können. Ich sehe aber auch kein Problem darin, wenn Leute einfach gehen, weil irgendwas nicht passt. Sei es jetzt vom Arbeitgeber oder vom Arbeitnehmer. Wenn so Leute nach drei Monaten weg sind oder auch nach vier Monaten, fünf Monaten, also nach der Probezeit, wenn es nicht passt, dann sollen die Leute einfach sich was anderes suchen. Ich finde das vollkommen in Ordnung und es gibt einfach Firmen und Personen, die nicht zusammenpassen. Aber wenn man irgendwo länger bleibt, glaube ich, kann man dann wirklich was bewegen, Ob man jetzt irgendwie mehr als fünf Jahre bleiben muss irgendwo oder keine Ahnung, da Loyalität zeigen muss. Also ich finde das auch ein falsches Verständnis von Loyalität, weil man will ja weiter wachsen, man will vielleicht andere Sachen sehen, man kommt vielleicht dann auch wieder mal zurück. Also ich sehe das schon als positiv an, eigentlich diese Flexibilisierung. Und ich habe das auch selber oft erlebt bei Kolleginnen, die waren weg bei einer anderen Firma, sind nach ein, zwei Jahren zurückgekommen, haben besseres Gehalt bekommen, haben super Blicke von außen, haben super viel gelernt bei der anderen Arbeitsstätte, haben da andere Einblicke bekommen, kommen zurück, bringen das wieder ein. Also das habe ich eigentlich jedes Mal positiv erlebt und die Leute haben sich extrem stark weiterentwickelt in ein bis zwei Jahren woanders. Also das hätten die nie in derselben Firma machen können."
    },
    {
      "end": 2428600,
      "speaker": "A",
      "start": 2398660,
      "text": "Ich würde dem Wolfgang zustimmen, dass man auch er hat aus Freelancer Perspektive gesprochen, ich spreche jetzt aus Arbeitnehmerperspektive, Wenn du in eine neue Firma kommst unter einem Jahr, kannst du keinen richtigen Value liefern. Natürlich lieferst du, du schippst Produkte und blablabla. Aber die großen Brocken bewegt man erst, wenn man ein Netzwerk innerhalb der Firma hat, wenn man die Prozesse kennt, wenn man die richtigen Probleme kennt und so weiter. Wenn man mal, ich sag mal, einen kompletten Planungszyklus mitgemacht hat, dann kannst du erst richtig produktiv sein und Sachen bewegen."
    },
    {
      "end": 2433900,
      "speaker": "B",
      "start": 2428760,
      "text": "Bzw. Ich würde sagen, du bist schneller. Also du kannst es davor natürlich auch, aber es braucht mehr Zeit."
    },
    {
      "end": 2505410,
      "speaker": "A",
      "start": 2434450,
      "text": "Dann gibt es natürlich noch dieses Job Hopping, was auch die Frage initiiert und dann kommt die OK, sieht das eigentlich positiv oder negativ im Lebenslauf aus? Als Hiring Manager sage ich Was ist denn da los, wenn ich mich dazu entscheide, die Person dann doch einzuladen, dann frage ich auch schon mal nach und hier kommt es einfach nur darauf an, wie ist die Begründung, wenn man mir ganz offen und ehrlich sagt, OK, pass mal auf, ich habe zwei Jobs jetzt versucht, ich kam mit meinem Chef da nicht klar, die Kultur hat mir nicht gefallen und so weiter und so fort, ist OK, passt, diese Person hat was riskiert, ist dann zweimal auf die Nase gefallen, alles gut, finde ich besser, als wenn man gar nichts riskiert. Wenn sich das jetzt über die nächsten sechs Jahre oder acht Jahre so durchzieht, dass man jede neun Monate den Job wechselt, dann ist das vielleicht was anderes, weil dann könnte man fragen, okay, liegt es vielleicht an der Person und nicht am Job? Aber so zwei, drei kurze Stellen halte ich jetzt nicht negativ auf dem CV, auf dem Lebenslauf. Und dann nächste Frage, was ist denn kurz? Wie gesagt, der Wolfgang hat mir gerade auch Job Hopping vorgeworfen, war bei keiner Firma weniger als drei Jahre. Drei Jahre finde ich jetzt kein Job Hopping, muss ich zugeben, besonders in der IT drei Jahre finde ich schon noch okay. Man sagt auch in der Regel, okay, so zwei Jahre sollte man schon pro Station bleiben, habe ich mal so als Daumenregel gehört, sage ich, hört sich sinnvoll an."
    },
    {
      "end": 2531940,
      "speaker": "B",
      "start": 2505410,
      "text": "Also ich glaube, wenn du im klassischen deutschen Mittelstand jetzt mal die Runde fragst, wie lange da so Leute bleiben, vielleicht so im produzierenden Gewerbe oder so irgendwo die irgendwelche Maschinen bauen sie das wahrscheinlich anders aus, die sehen wahrscheinlich drei Jahre eher als Job Hopping schon an, aber wie gesagt, ist eine andere Branche, aber auch da wird sich einiges bewegen und ich würde mal sagen, dort in der Entwicklung oder im IT Bereich sieht es vielleicht dann eh auch schon dynamischer aus."
    },
    {
      "end": 2551030,
      "speaker": "A",
      "start": 2531940,
      "text": "Also das ist natürlich richtig, der Kontext ist natürlich key. Wir reden, also meine Berufskarriere war jetzt in der Regel internationalen Start ups und jetzt auch in einem, ich glaube Konzern kann man schon sagen, internationalen Konzern, aber wenn du jetzt natürlich jetzt bei Vorwerk arbeitest oder so, dann sieht das vielleicht ein bisschen anders aus, dass das stimmt."
    },
    {
      "end": 2595680,
      "speaker": "B",
      "start": 2551030,
      "text": "Schon, aber es ändert sich auch da. Also ganz klar, was ich so mitbekommen habe, vor allem in unserem Bereich in der IT, jetzt aber auch ganz allgemein bei diesen Firmen, wenn die in der Forschung und Entwicklung sind, das heißt jetzt irgendwie Maschinenbau oder so, da sind die Zeiten natürlich auch kürzer mittlerweile im Gegensatz zu früher. Man bleibt zumindest nicht mehr bei einer Firma sein ganzes Leben lang. Und ich glaube, darum geht es ja auch. Aber eine andere Frage, die da super reinpasst, ist von Daniel und die geht jetzt genau in diese Richtung. Andy, weil du machst ja eigentlich alles nur fürs Geld, Haben wir ja gerade besprochen. Er hattet ihr schon mal das Bedürfnis, was anderes zu machen. Daher entweder kompletter Technologiewechsel oder weg von Tech. Also willst du auch mal was machen, was Nicht nur wegen dem Geld, Wegen des Geldes?"
    },
    {
      "end": 2632060,
      "speaker": "A",
      "start": 2596000,
      "text": "Ja. Comedian Wolfgang Naja, Technologiewechsel. Ich komme aus dem Web. Gut, bin jetzt immer noch im Internet. So richtigen Technologiewechsel habe ich jetzt noch nicht getan. Also ich habe jetzt noch nie Embedded Software geschrieben oder sowas, Fände ich auch mal spannend, aber das ist für mich jetzt nicht die Definition von komplett was anderem. Komplett was anderes ist jetzt eher der zweite Teil der Frage Weg von Tech. Und da stelle ich mir die Frage, nenne mir mal eine Woche, wo ich nicht das Bedürfnis hatte. Ab und zu frage ich mich jede Woche, okay, soll ich nicht einfach in die Landwirtschaft gehen oder einfach Gärtner werden oder so, weil da bist du den ganzen Tag an der frischen Luft und siehst was Schönes und so."
    },
    {
      "end": 2677990,
      "speaker": "B",
      "start": 2632060,
      "text": "Ja, aber hast du das auch mal ernst überlegt? Weil ich habe gerade kürzlich vor ein paar Tagen mit einer ehemaligen Teamkollegin gesprochen aus meinem Team von damals, die ist Data Scientist und überlegt sich, ob sie nicht vielleicht jetzt noch mal komplett was anderes machen soll und in die Pflege gehen soll oder Medizin studieren oder so, wirklich in den medizinischen Sektor gehen, um wirklich was zu bewegen, Purpose zu haben. Wenn mal ein Krieg ausbricht, kann man da noch was helfen anstatt mit Data Science. Aber ich bin mir nicht so sicher, ob das nicht oft so. Das sagt man so gerne und wenn jemand fragt, ist das eine super Antwort, aber denkt man das wirklich, dass man mal in so eine andere Branche steppt oder ist es nur, damit man was Cooles sagen kann oder vor sich herträgt, damit es irgendwie, ich weiß nicht, aber man macht es dann am Ende sowieso nie."
    },
    {
      "end": 2722700,
      "speaker": "A",
      "start": 2677990,
      "text": "Naja, im Sommer schaue ich ab und zu mal aus dem Fenster und irgendwann habe ich halt mal Dachdecker auf einem Dach gesehen, so zwanzig Grad schön Sonne und ich sitze hier im Sommer bei so einer Form rechnen und da habe ich mir schon gedacht, geil, wäre das jetzt mal ganz cool, so als Dachdecker zu arbeiten und dann habe ich wieder. Ach weißt du was, unser Job als Softwareentwickler, Engineering Manager und so weiter und so fort ist natürlich schon hart bequem. Also wir verdienen sehr gutes Geld im deutschen Vergleich und auch im europäischen Vergleich denke ich. Wir haben unglaublich viel Urlaub, wir machen unseren Körper nicht kaputt, wie zum Beispiel bei Dachdeckern jetzt oder auf dem Bau. Wir sind beruflich dem körperlichen Risiko jetzt nicht so ausgesetzt, wie vom Dach zu fallen oder ähnliches. Also das ist schon eine unglaublich luxuriöse Situation mit unglaublich vielen Privilegien."
    },
    {
      "end": 2765190,
      "speaker": "B",
      "start": 2723020,
      "text": "Das war übrigens auch das, was ich mit meiner Kollegin besprochen hab. Weißt du überhaupt, wie so ein Job aussieht? Weil man hat immer das im Kopf, dass das so toll ist und gute Freundin von mir ist. Moment mal, es ist schwierig mit diesem Jobtitel, Intensiv, Diplom, Intensivpflegekraft oder so irgendwas. Aber wenn man dann hört, was die verdienen, was die so machen, was für Stresslevel das ist, wenn du irgendwie in der Nacht plötzlich auf irgendein Bett drauf springen musst und irgendwen wiederbeleben und so Geschichten. Also so einfach, ich glaube, das ist halt so, the grass is always greener on the other side. Es ist so wie in Beziehungen oder so, was man da oft sieht, dass es woanders immer besser ist. Und ich glaube, das ist halt beim Job auch oft so."
    },
    {
      "end": 2794610,
      "speaker": "A",
      "start": 2765350,
      "text": "Habe ich mir jemals ernsthaft überlegt, was anderes zu machen? Ich denke öfter darüber nach, komme aber relativ schnell zu diesem Entschluss, dass ich in einer sehr privilegierten Situation bin, sehr viele Vorteile genieße, gutes Gehalt bei weniger körperlicher Arbeit und so weiter und so fort. Und im Endeffekt ist es dann halt wirklich, ich habe mein Leben auch darauf aufgebaut, muss ich zugeben. Ich habe mein Leben so jetzt designt und allem drum und dran. Natürlich kann man alles ändern. Das sage ich nicht. Möchte ich es ändern? Nein, aktuell nicht."
    },
    {
      "end": 2799570,
      "speaker": "B",
      "start": 2794770,
      "text": "Also es ist doch nur so was, was man halt gerne präsentiert und sagt, aber nie, nie dann durchzieht."
    },
    {
      "end": 2807790,
      "speaker": "A",
      "start": 2799570,
      "text": "Ja, also genau. Also wenn man dann mal wirklich wirklich anfängt, mal eins und eins zusammenzuziehen und sich die ganze Sache vorstellt, dann habe ich bisher immer einen Rückzieher gemacht. Das ist korrekt."
    },
    {
      "end": 2910280,
      "speaker": "B",
      "start": 2807950,
      "text": "Aber ich würde ja auch sagen, man kann ja mit seinen Skills auch wirklich in einem Bereich, wo man Purpose sieht, etwas bewegen. Wenn wir das Beispiel wieder nehmen, als Data Scientist. Ich kann ja auch im Medizinbereich als Data Scientist arbeiten, ich kann in der Wissenschaft arbeiten, ich kann irgendwelche Forschungsprojekte vorantreiben, Ich kann in Start ups arbeiten, die für die Medizin irgendwelche Produkte entwickeln und sei es nur irgendwie ein Fragebogen für irgendwelche Studien zum Beispiel. Das ist ein simples technologisches Problem und die kann aber wirklich viel damit bewegen. Also wenn es mir darum geht, glaube ich, kann man die schwer und lang erlernten Skills ja auch wirklich in den anderen Bereichen dementsprechend einsetzen. Und wir haben eine ganz ähnliche Frage eigentlich auch bekommen, und zwar vom Jan der Wenn ich ein neues Konzept lerne, begeistert mich, wenn es gut läuft, zumindest die Technologie an sich. Zum Beispiel habe ich mich einmal mit funktionaler Programmierung auseinandergesetzt und Haskell gelernt. Das war anstrengend, aber die Motivation kam, so schien es mir, aus der Sprache selbst. Nun muss aber irgendwie das Geld herkommen. Wie wichtig findet ihr es, dass der Einsatzzweck der Software, an der ihr schreibt, sinnvoll ist? Ist es egal, an was ich arbeite? Handy, Daddelspiel, Trojaner, Blockchain Quatsch. Sehr schön übrigens, der Blockchain Quatsch, das war jetzt von mir geerdet, by the way. Solange die Technologie, mit der ich arbeiten darf, toll ist. Oder würdet ihr für ein sinnvolles Projekt zum Beispiel Krebs besiegen, eine Hungersnot verhindern, das Klima retten, Kobold lernen oder irgendeine andere Sprache, die man nicht mag? Also würdest du, Andi, JavaScript nur mehr auf JavaScript setzen, wenn du wüsstest, du kannst was beitragen in der Krebsforschung, nachdem wir ja die Pausen rausschneiden. Jan falls du zuhörst, du merkst es jetzt nicht, aber Andi ist ganz hart am Überlegen."
    },
    {
      "end": 2923860,
      "speaker": "A",
      "start": 2910280,
      "text": "Ob es ganz hart ist, weiß ich nicht. Ich denke, ich bin technologieflexibel. Ich denke, ich mag kein JavaScript. Wenn es aber für meinen Job notwendig ist und so weiter und ich das verstehe, warum JavaScript da eingesetzt werde, dann mache ich auch JavaScript im Job."
    },
    {
      "end": 2939590,
      "speaker": "B",
      "start": 2923940,
      "text": "Okay, Moment, Moment, dann verändere ich das noch ein bisschen. Du machst JavaScript und verdienst nur mehr siebzig Prozent vom deutschen Durchschnitt, also nur dreiig Prozent verdienen mehr. Und du kannst jetzt Krebs Du veränderst."
    },
    {
      "end": 2942750,
      "speaker": "A",
      "start": 2939590,
      "text": "Die Frage so dermaßen, dass sie völlig unrealistisch ist."
    },
    {
      "end": 2944590,
      "speaker": "B",
      "start": 2943070,
      "text": "Wieso ist das unrealistisch?"
    },
    {
      "end": 2957710,
      "speaker": "A",
      "start": 2944830,
      "text": "Also du möchtest mir sagen, dass Softwareentwickler, dass ein Großteil der Softwareentwickler das Gehalt deutlich reduzieren würden, um an der Krebsforschung zu arbeiten, weil das hast du jetzt gerade impliziert, richtig?"
    },
    {
      "end": 2961230,
      "speaker": "B",
      "start": 2957710,
      "text": "Ja klar. Klar machen das Leute. Frag mal alle, die an der Uni."
    },
    {
      "end": 2974510,
      "speaker": "A",
      "start": 2961230,
      "text": "Arbeiten, die haben aber haben die schon mal so viel verdient? Die, Also wie viele Leute sind in die freie Wirtschaft gegangen, haben schon mal mehr verdient an allem drum und dran und sind dann wieder zurück an die Uni. Das sind glaube ich nicht so viele."
    },
    {
      "end": 2983870,
      "speaker": "B",
      "start": 2974590,
      "text": "Das stimmt. Aber es gibt zum Beispiel Leute, die dann in ein Startup gehen. Klar hat man da vielleicht dann irgendwelche Shares, aber man verdient dann wesentlich weniger als Natürlich gibt es das ganz klar."
    },
    {
      "end": 3014650,
      "speaker": "A",
      "start": 2983870,
      "text": "Ja, ja. Also dass es das gibt. Du hast das aber gerade so formuliert, als wäre das das Normale, weil die meisten Leute wechseln ja etwas. Also in der Regel wechseln die Leute, weil sie neue Vorteile haben im neuen Job oder sehr stark an die Idee glauben und darin getrieben sind und so weiter. Richtig. Und hier gehen wir auf das zweite mit dem sehr stark getrieben. Ich weiß, du googlest gerade den deutschen Durchschnitt, was Leute verdienen und wie siebzig Prozent davon werden. Wo liegen wir da? Wo liegen wir im deutschen Durchschnitt?"
    },
    {
      "end": 3017450,
      "speaker": "B",
      "start": 3015050,
      "text": "Vier tausend netto, das ist der."
    },
    {
      "end": 3021210,
      "speaker": "A",
      "start": 3017770,
      "text": "Du willst mir sagen, der Durchschnitt ist netto."
    },
    {
      "end": 3029680,
      "speaker": "B",
      "start": 3021210,
      "text": "Na, dreiig Prozent verdienen mehr, Wenn du Haushaltseinkommen hast als Single zum Beispiel, dann verdienen dreiig Prozent mehr."
    },
    {
      "end": 3036000,
      "speaker": "A",
      "start": 3029760,
      "text": "Ja, okay, das war aber nicht siebzig Prozent vom Durchschnitt, was du gerade gesagt hast. Du hast gerade siebzig Prozent der Topverdiener."
    },
    {
      "end": 3040800,
      "speaker": "B",
      "start": 3036000,
      "text": "Nein, ich hab gemeint siebzig Prozent, dass du beim siebzigste Perzentil bist. Das dreiig Prozent mehrfach."
    },
    {
      "end": 3048240,
      "speaker": "A",
      "start": 3040800,
      "text": "Achso, weil du hast nämlich gerade gesagt vom Durchschnitt und davon siebzig Prozent. Das hast du gerade gesagt und das würde bedeuten, als Softwareentwickler würdest du unter dem Durchschnitt verdienen."
    },
    {
      "end": 3059540,
      "speaker": "B",
      "start": 3048240,
      "text": "Achso, Moment mal, ich habe da übrigens gerade einen Fehler drin. Kommando zurück. Zwei tausend sechs hundert sind. Sorry, macht mehr Sinn. Ich hatte noch zwei Personen im Haushalt eingestellt."
    },
    {
      "end": 3062020,
      "speaker": "A",
      "start": 3059540,
      "text": "So und jetzt formuliere ich Frage bitte noch mal neu."
    },
    {
      "end": 3079020,
      "speaker": "B",
      "start": 3062420,
      "text": "Du kannst ordentlich was bewegen in der Krebsforschung, musst JavaScript programmieren und verdienst zwei tausend sechs hundert Euro netto. Weil wenn ich dir jetzt die Frage stelle, willst du dabei Köchler und wie heißt diese Waffenfirma da arbeiten? Dann ist es ja easy, aber muss ja so in die andere Richtung mal denken."
    },
    {
      "end": 3091280,
      "speaker": "A",
      "start": 3079020,
      "text": "Ja, Technologie wird mir hier keine Rolle spielen in meinem Gedanken das Gehalt und die Mission. Also ich habe meinen aktuellen oder meine letzten beiden Jobs so gesucht."
    },
    {
      "end": 3093280,
      "speaker": "B",
      "start": 3091680,
      "text": "Moment, was meinst du mit Mission?"
    },
    {
      "end": 3101840,
      "speaker": "A",
      "start": 3093520,
      "text": "Ja, an der Krebsforschung arbeiten, das wäre kein Grund, das wäre ein Kriterium, worüber ich mir danken machen möchte. Die JavaScript Thematik, das ist für mich nachgelagert."
    },
    {
      "end": 3104720,
      "speaker": "B",
      "start": 3101840,
      "text": "Okay, also in dem Fall wäre das Geld der Blocker."
    },
    {
      "end": 3118990,
      "speaker": "A",
      "start": 3104880,
      "text": "Ist schon. Also du hast ja gerade gesagt, dass es impliziert, dass man weniger verdient. Richtig. Das ist ja der Hint hierbei. Jetzt gehen wir mal weg von diesen von diesen absoluten Zahlen, sondern dass man weniger verdient, richtig?"
    },
    {
      "end": 3120030,
      "speaker": "B",
      "start": 3119070,
      "text": "Ja, genau."
    },
    {
      "end": 3158500,
      "speaker": "A",
      "start": 3120110,
      "text": "So, da muss man dann schon sehr getrieben sein von der Mission. Ich bin jetzt nicht so getrieben von der Mission, an der Krebsforschung zu arbeiten. Ich finde das sehr wichtig und ich habe auch beim höchsten Respekt für die Leute das tun und ich denke, das sollte auch gefördert werden. Aber das treibt mich jetzt nicht so an. Vielleicht weil ich auch in der Forschung generell so nicht drin bin. Das ist eine schwierige Frage. Aber ja, ich habe meine, ich habe auch Jobangebote gekriegt von Firmen, wo mich das Produkt keinster Weise interessiert und das habe ich abgelehnt, obwohl ich da auch mehr verdient hätte, als ich jetzt verdiene. Einfach nur, weil das Produkt dann lang. Also ich hätte nicht ans Produkt geglaubt."
    },
    {
      "end": 3165960,
      "speaker": "B",
      "start": 3158660,
      "text": "Noch eine kleine Frage nebenan. Was verdient ein Postdoc in Deutschland? Also nachdem er einen Doktor hat und dann weiterforscht."
    },
    {
      "end": 3172000,
      "speaker": "A",
      "start": 3165960,
      "text": "Ja, das ist hundsmiserabel, glaube ich, im Vergleich zu gut bezahlten IT Jobs. Drei netto."
    },
    {
      "end": 3185880,
      "speaker": "B",
      "start": 3172560,
      "text": "Ja, ich habe jetzt da nur einen Bruttowert brutto, aber das dürfte dann so irgendwas in der Richtung sein oder so. Da sind wir dann ungefähr bei den siebzig bei zehn höchstwahrscheinlich in der Größenordnung."
    },
    {
      "end": 3209310,
      "speaker": "A",
      "start": 3185880,
      "text": "Ja, aber jetzt bist du, jetzt machst du die ganze Sache sehr einfach. Du verdienst dreiig Prozent weniger von deinem aktuellen Job und müsstest, ich weiß jetzt gerade nicht was schreiben eine Sprache, Prolog. Du müsstest Prolog schreiben und mit einer DB arbeiten und verdienst dreiig Prozent weniger, bist dafür aber an der Krebsforschung beteiligt."
    },
    {
      "end": 3224710,
      "speaker": "B",
      "start": 3209470,
      "text": "Ja, es ist relativ easy. Ich mache ja jetzt schon Sachen, wofür ich gar nichts verdiene, nur weil ich es machen will und gerne mache. Also insofern, wenn die Vision passt oder die Vision mache das auf jeden Fall gerne, ist gar kein Thema."
    },
    {
      "end": 3232190,
      "speaker": "A",
      "start": 3224710,
      "text": "Nee, nee, nee, nee, nee, nee. Du hast aber noch ein Einkommen dabei. Also das ist jetzt dein Hauptjob. Das ist dein Hauptjob. Das ist deine Haupteingangsquelle."
    },
    {
      "end": 3246990,
      "speaker": "B",
      "start": 3232270,
      "text": "Wenn du jetzt meine Stundensätze oder sonst irgendwas hernimmst, die verdienen dreiig Prozent weniger, ist überhaupt kein Thema. Also das ist jetzt auch schon so, dass ich Projekte, die mir gefallen, mache, um ganz andere Preis Ranges. Natürlich mein Energieprojekt, das jetzt gestartet habe. Es geht genauso."
    },
    {
      "end": 3253190,
      "speaker": "A",
      "start": 3246990,
      "text": "Wir reden von vierzig Stunden. Wir reden von vierzig Stunden, klar, logisch. Also ist die Antwort ja oder nein?"
    },
    {
      "end": 3265590,
      "speaker": "B",
      "start": 3253190,
      "text": "Ja, klar, gar kein Thema. Also das ist für mich das Wichtigste. Die Sprache und die Technologie kommt dann, würde ich sagen, an nächster Stelle und dann kommt das Geld."
    },
    {
      "end": 3289290,
      "speaker": "A",
      "start": 3265830,
      "text": "Bei mir ist es die Technologie spielt für mich keine Relevanz bei der Thematik, sondern das, woran ich arbeite und glaube ich daran kommt als Nummer eins. Dann muss mein finanzielles Polster gegessen sein. Natürlich, ich habe jetzt ein Haus und zahle auch was ab und so weiter und so fort. Du hast jetzt keinen Hauskredit am Laufen. Das ist dann vielleicht noch mal ein Unterschied. Das bedeutet, man hat, man hat einen Mindesteinkommen, was man haben muss."
    },
    {
      "end": 3294330,
      "speaker": "B",
      "start": 3289290,
      "text": "Ja, aber das wäre jetzt trotzdem mit den dreiig Prozent weniger leicht gedeckt. Auch bei dir."
    },
    {
      "end": 3323210,
      "speaker": "A",
      "start": 3294650,
      "text": "Da lehnst du dich aber weit aus dem Fenster. Aber naja, wie dem auch sei was ganz anderes. Ich glaube, ich wäre sonst Landwirt geworden, aber knüppelharter Job, man verdient ist auch schwierig. Urlaub ist schwierig. Also ich glaube, kommen wir zurück zu Fragen, hattet ihr schon mal das Bedürfnis, was anderes zu machen? Das Bedürfnis? Ja, haben wir jemals gemacht. Nein, ich bin dafür viel zu schissig, gebe ich zu. Und ich genieße auch das Privileg, gebe ich zu."
    },
    {
      "end": 3337550,
      "speaker": "B",
      "start": 3323210,
      "text": "Also früher wäre es bei mir anders gewesen, aber mittlerweile wurde jetzt auf keinen Fall irgendwann Handy Dattel Spiel. Trojaner. Trojaner wäre eigentlich ganz interessant. Es kommt drauf an, für was für einen anderen oder irgendein Blockchain Quatsch, wie der Jan sagt."
    },
    {
      "end": 3343470,
      "speaker": "A",
      "start": 3337550,
      "text": "Ja, das hätte ich früher auch gemacht, aber heutzutage will ich das auch nicht mehr machen. Aber wegen dem Trojaner, Wie heißt der österreichische Geheimdienst?"
    },
    {
      "end": 3344670,
      "speaker": "B",
      "start": 3344030,
      "text": "Keine Ahnung."
    },
    {
      "end": 3345790,
      "speaker": "A",
      "start": 3344830,
      "text": "Ist er so geheim?"
    },
    {
      "end": 3358430,
      "speaker": "B",
      "start": 3346110,
      "text": "Ja, scheinbar. Ich weiß gar nicht, ob der einen Namen hat. Wir haben, glaube ich, irgendwie zwei, aber Wir haben so ein Bundestrojaner, wurde jetzt gerade im Gesetz festgelegt, wo keiner weiß, wer den macht, ob der überhaupt gemacht werden kann. Irgendwie so ein Bullshit."
    },
    {
      "end": 3378320,
      "speaker": "A",
      "start": 3358430,
      "text": "Aber gut, da haben wir jetzt mal, ich glaube, einen Punkt gefunden, wo wir ein bisschen anders drauf sind. Aber ich muss zugegeben, wir leben ja auch zwei unterschiedliche Leben. Ich habe Eigentum, du wohnst zur Miete, du reist sehr viel, bist unabhängig und Freelancer. Und von daher, ich glaube, das sind einfach zwei grundverschiedene Leben. Und das ist ja auch sehr spannend bei der Antwort dieser Frage."
    },
    {
      "end": 3395180,
      "speaker": "B",
      "start": 3378320,
      "text": "Ich glaube, also keine Ahnung, ob es vielleicht jetzt mittlerweile anders ist, ob es unser Alter ist oder eher der Zeitgeist. Aber ich würde sagen, früher war mir der Purpose weniger wichtig. Der ist mir schon wesentlich wichtiger geworden. Und da achte jetzt wirklich auch mehr drauf."
    },
    {
      "end": 3401740,
      "speaker": "A",
      "start": 3395660,
      "text": "Ein hundert Prozent. Also bei dem letzten Job Search habe ich über ein Jahr gesucht."
    },
    {
      "end": 3420430,
      "speaker": "B",
      "start": 3401820,
      "text": "Aber eben die Frage ist es die Zeit, weil wir so alt sind, oder ist es die Zeit allgemein? Und junge Leute suchen auch mehr Purpose. Meines, was ich so ließ, aber das ist auch jetzt keine ordentliche wissenschaftliche Statistik, ist ja, dass der Purpose allgemein wichtiger wird. Also auch bei jüngeren Leuten. Also vielleicht ist es der Zeitgeist, ja."
    },
    {
      "end": 3425310,
      "speaker": "A",
      "start": 3420430,
      "text": "Könnte aber auch die verbleibende Zeit bei uns sein, um jetzt mal hier poetisch."
    },
    {
      "end": 3442890,
      "speaker": "B",
      "start": 3425310,
      "text": "Zu werden, wie auch immer. Aber wenn wir schon bei Zeit sind. Eine finale Frage hätte ich noch, und zwar von Matthias, die ich sehr cool finde, Geht auch eigentlich in eine ähnliche Richtung. Gibt es ein Zeitprojekt, wo ihr im Nachhinein bereut, es aufgegeben zu haben bzw. Nicht mehr Zeit oder Leistung investiert zu haben?"
    },
    {
      "end": 3537730,
      "speaker": "A",
      "start": 3442890,
      "text": "Eins? Ja klar, gibt es, gibt es. Ich hatte mal eine Fitness Workout App, die habe ich nie wirklich released und wirklich weitergetrieben. Und jetzt habe ich die Tage, war ich die Tage auf Reisen und habe mir eine Fitness Workout App runtergeladen, die ich früher mal genutzt habe und habe jetzt gesehen, scheiße, die ist voll mit Werbung und die ist dauerhaft abgestürzt und also die hat einfach keinen Spaß mehr gemacht zu bedienen. Und ich habe einfach mal, ich habe sechs, sieben, zehn Minuten gebraucht, bis ich ein ordentliches Workout da herausgefunden habe und denke ich mir so, fuck, das ist doch genau das, was ich doch eigentlich gebaut habe. Und das ist jetzt so eine schlechte Experience und ich habe keine andere gefunden, die mir wirklich gefallen hat. Dann habe ich mir ganz kurz gedacht, setze dich heute Abend mit einer Flasche Wein dahin und machst Claude Code auf und Vibe Code das Ding mal eben weg. Habe ich dann im Endeffekt nicht gemacht. Das ist das eine Projekt. Das andere Projekt, das läuft noch, nennt sich Source Control. Das ist so ein bisschen, ich crawl da so GitHub und mache da Datenanalysen auf Open Source Projekte und so weiter und so fort. Das läuft immer noch. Sourcecontrol, Ein guter Kollege Matthias Endler, der nutzt das auch wirklich, ich glaube so jede Woche oder alle zwei Wochen mal. Das habe ich nicht aufgegeben. Da würde ich mir wünschen, mehr Zeit zu investieren. Und jetzt kommt ein ehrliches Geständnis. Ich habe das runter priorisiert, unter anderem um den Podcast weitermachen zu können, denn privat ist sehr, sehr wenig Zeit gerade über, und da muss man sich entscheiden, okay, was macht man? Da habe ich den Podcast über diesem Source Control und über dieses Coding mit der Flasche Wein, was ich gerade erzählt habe, priorisiert. So eine Art Liebeserklärung hier."
    },
    {
      "end": 3553770,
      "speaker": "B",
      "start": 3537730,
      "text": "Wolfgang, ich wollte gerade sagen, jetzt hast du dich gerettet, weil beim Engineering Kiosk springt gar kein Geld raus, Insofern du arbeitest scheinbar auch nicht nur wegen des Geldes. Also Hut ab. Sehr gute Entscheidung, wollte ich übrigens nebenbei noch mal erwähnen."
    },
    {
      "end": 3575430,
      "speaker": "A",
      "start": 3553770,
      "text": "Ja, und ich denke mir immer wieder, immer wenn ich mal so eine Stunde habe oder so, machst du da jetzt ein bisschen weiter und dann denke ich mir, was kann ich in einer Stunde machen? Dann spiele ich lieber mit meinem Hund. Ist, glaube ich auch besser investierte Zeit jetzt in diesem Sinne, als irgendwelche Open Source Daten Analyten Kram zu machen. Aber ja. Naja, also ja, gibt es. Die Frage ist nur, wie viele. Wolfgang, wie sieht es bei dir aus?"
    },
    {
      "end": 3677420,
      "speaker": "B",
      "start": 3575510,
      "text": "Ich habe schon öfters erwähnt, dass ich eigentlich den alten Projekten nicht mehr nachweine. Vor allem, wenn ich auch so ein Erlebnis habe, wie du jetzt gerade erklärt hast. Vor zwei Tagen hat mir eine Freundin ein Bild geschickt von so einem Voting Bildschirm in der Mensa an der Uni und vor über zehn Jahren wollte ich eigentlich genau sowas bauen oder habe schon Prototypen gebaut gehabt. Du wählst das Menü aus, das du gegessen hast und danach bekommst du so Smileys. Und beim Rausgehen kannst du einfach schnell sagen, dieses Menü, dieser Smiley war gut, war nicht gut, so eine Feedbackstation. Jetzt nach über zehn Jahren haben sie sowas Allgemein das Menü kann man immer noch nicht auswählen. Also da war ich vielleicht zu früh bzw. Meiner Meinung nach auch wenn ich mehr Zeit investiert hätte, hätte ich es wahrscheinlich in die falsche Aktivität investiert, weil ich hatte damals zum Beispiel nie mit denen gesprochen, ob das relevant ist für die für die Mensa wollen die überhaupt dieses System haben und diese Fehler habe ja bei ganz vielen Projekten gemacht. Da haben wir eine ganze Episode. Die ein hundert neun und neunzig kann man gerne mal reinhören. Also ich bin mir nicht sicher, ob es was gebracht hätte. Grundsätzlich ist aber schon das Problem, dass man in Projekte zu wenig Zeit investiert und vielleicht nicht den langen Atem hat, den man wirklich braucht, um was erfolgreich zu machen. Ob man in der Vergangenheit in dieser Situation den Atem überhaupt gehabt hätte, in die richtige Sache investiert hätte, ob das dann funktioniert hätte. Man hat ja auch irgendeinen anderen Hauptjob gehabt. Es hat ja einen Grund gehabt, dass man da nicht tiefer reingegangen ist. Also ich sehe da eigentlich recht nüchtern auf die Dinge und versuche einfach zu lernen und das in den neuen Projekten anzuwenden und jetzt eben nicht mehr den Fehler zu machen, dass man nicht als erstes mal mit einem potenziellen Kunden sprechen, anstatt schon den Prototypen zu bauen, was der größte Fehler ever ist. Aber wie gesagt, alles mehr gibt es in Episode ein hundert neun und neunzig."
    },
    {
      "end": 3681340,
      "speaker": "A",
      "start": 3677740,
      "text": "Bei der Sport App. Bei der Fitness App, von der ich gerade gesprochen habe, wäre ich ja mein Kunde."
    },
    {
      "end": 3700270,
      "speaker": "B",
      "start": 3681340,
      "text": "Ja, da sind wir wieder, was willst du erreichen? Aber wie gesagt, da haben wir eine ganze Episode dazu gemacht. Grundsätzlich weine ich eigentlich den side Projects nicht nach, auch wenn man wie gesagt immer so wie du das erlebt hast, man sieht dann, es hat irgendwer andere gemacht, zehn Jahre später, aber so what? Es gehört mehr dazu, als nur die Idee zu haben. Man muss sie eben auch umsetzen und live."
    },
    {
      "end": 3703230,
      "speaker": "A",
      "start": 3700350,
      "text": "Aber es heißt ja nicht, dass du, dass es das finale Ende sein muss."
    },
    {
      "end": 3706270,
      "speaker": "B",
      "start": 3703470,
      "text": "Denn das stimmt natürlich auch jetzt mit."
    },
    {
      "end": 3715150,
      "speaker": "A",
      "start": 3706270,
      "text": "Den neuen Möglichkeiten, mit dem Vibe Coding und so weiter, wäre es halt mal wirklich interessant, auf jeden Fall ein gutes Gerüst schon zu haben und damit einfach mal durchzustarten."
    },
    {
      "end": 3740570,
      "speaker": "B",
      "start": 3715390,
      "text": "Aber genau da ist wieder der Fehler. Also du kannst es zwar jetzt programmieren, du bist schneller in den Prototypen Entwicklung, aber das erspart dir nicht, mit dem Kunden zu sprechen und die Kunden zu suchen und diese ganzen Dinge. Also die musst du ja trotzdem machen und da kannst du eben nicht. Und genau das ist eigentlich die Zeit, die man investieren muss. Und wenn man da keinen Spaß dran hat, dann soll man es am besten lassen. Und dann macht man eben nur so irgendein Web Coding Projekt für sich oder Open Source und scheiß drauf, ob es da einen Kunden gibt oder nicht."
    },
    {
      "end": 3785470,
      "speaker": "A",
      "start": 3740810,
      "text": "Man muss ja leider auch sagen, das Coden ist so der kleinste Teil der Arbeit. Also je nachdem, wonach man aus ist, wenn man wirklich Kunden haben möchte oder User oder Feedback, dann baut man ja eine Community auf und man muss ja auch irgendwie Wert schaffen, damit Leute dafür Geld zahlen und Marketing und Leute. Also es ist ja nicht so, als sitzen Leute da und warten auf dein side Project. Deswegen, weswegen machst du das? Und auch jetzt hier Community aufbauen, auch im Engineering Kiosk, das ist sehr aufwendig. Und natürlich frisst auch das Podcasten hier viel Zeit, aber der ganze Kladderadatsch drumherum, ich würde sagen, der frisst mindestens noch mal so viel, wenn nicht sogar anderthalb bis zweimal so viel Zeit wie das Podcast selber. Also naja, da kommt halt ein ganzer Rattenschwanz mit, wie man hier so sagt im Pott."
    },
    {
      "end": 3843200,
      "speaker": "B",
      "start": 3785790,
      "text": "Und daher, wenn ihr uns mal einen Kaffee spendieren wollt, geht auf unsere Seite Engineering Kiosk. Kaffee ist es glaube ich, oder ist es Deutsch oder haben wir Coffee auch so schlecht bin ich vorbereitet. Aber ihr könnt uns da gerne mal einen Kaffee spendieren, sonst findet ihr den Link auf der Webseite. Danke auf jeden Fall auch an Matthias, Nico, Daniel, Jan, Matthias und alle anderen, die uns Fragen eingeschickt haben. Wie gesagt, wir haben jetzt mal ein paar Fragen ausgewählt. Wir werden auf jeden Fall auf andere Fragen auch noch eingehen in der Zukunft. Wenn ihr uns noch mehr Fragen schicken wollt, jederzeit gerne Engineering Kiosk, DE V AMA. Ich hoffe, ihr habt es netter formuliert als die KI Voice. Und ihr könnt natürlich auch zu uns in die Discord Community springen und uns da Fragen stellen oder auch Feedback zu dieser Episode geben. Super wäre auch Thumbs up, Thumbs down in den Shownotes. Klickt mal drauf. Im Idealfall schreibt ein Co dazu, damit wir oder der Andi vor allem auch weiß, warum der Thumbs Down gewählt wurde."
    },
    {
      "end": 3867050,
      "speaker": "A",
      "start": 3843360,
      "text": "Ja, und bis zum nächsten Mal werden wir zusehen, dass der Wolfgang natürlich auch siebzig Prozent vom Durchschnitt versus dem siebzig Perzentil richtig hinkriegt. Als Doktor ist das schon etwas beschämend, wenn man diese Basis Statistiken Sachen nicht hinkriegt. Naja, man weiß ja nie, ob der Wolfgang wirklich seine Doktorarbeit selbst geschrieben hat. Somit würde ich sagen, wir hören uns nächste Woche. Bis bald, bye bye und ciao."
    }
  ],
  "webhook_auth": false
}