{
  "acoustic_model": "assemblyai_default",
  "audio_duration": 3948,
  "audio_url": "https://cloud.inlupus.at/s/pHdMopP6W7S4S2H/download",
  "auto_chapters": false,
  "auto_highlights": false,
  "auto_highlights_result": {},
  "confidence": 0.9610734,
  "content_safety": false,
  "content_safety_labels": {
    "status": "unavailable"
  },
  "custom_topics": false,
  "disfluencies": false,
  "dual_channel": false,
  "entity_detection": true,
  "filter_profanity": false,
  "format_text": false,
  "iab_categories": true,
  "iab_categories_result": {},
  "id": "66901f4e-82b9-427a-91e8-924203629683",
  "language_code": "de",
  "language_detection": false,
  "language_model": "assemblyai_default",
  "punctuate": true,
  "redact_pii": false,
  "redact_pii_audio": false,
  "sentiment_analysis": false,
  "speaker_labels": true,
  "speakers_expected": 2,
  "speed_boost": false,
  "status": "completed",
  "summarization": false,
  "throttled": false,
  "utterances": [
    {
      "end": 79300,
      "speaker": "A",
      "start": 3200,
      "text": "Willkommen zu einer neuen Episode vom Engineering Kiosk. In der Corona Pandemie haben wir alle erfahren, was es heißt, von zu Hause zu arbeiten. Die einen haben es geliebt, die anderen wollten schnellstmöglich zurück ins Büro. Seit der Pandemie ist etwas Zeit vergangen und viele Firmen haben ein Hybrid Modell ausgerufen, sowas wie drei Tage Büro, zwei Tage im Homeoffice. Wie sich ein hundert Prozent Büroarbeit anfühlt, wissen wahrscheinlich viele von uns. Das war meist der Zustand vor der Pandemie. Doch wie ist es eigentlich, wenn man ein hundert Prozent remote arbeitet, ohne dass man ein Büro in der Nähe hat und seine Kollegen deutschlandweit bzw. Weltweit verteilt sind? Ist da alles super, weil der Büroweg nur vom Schlafzimmer in ein anderes Zimmer nebenan ist und man um Uhr aufstehen kann, um das erste Meeting um acht uhr wahrzunehmen? Was sind die nicht so schönen Seiten? Worauf kommt es eigentlich an beim Remote Arbeiten? Diese Episode ist ein Erfahrungsbericht. Wolfgang hat mich Andi als Interviewpartner zu dem Wie ist es eigentlich, ein hundert Prozent remote zu arbeiten zu Gast Ich selbst arbeite seit über drei Jahren in einem solchen Setup. Vielleicht überlegst du dir ja ab und zu mal, ob ein hundert Prozent remote was für dich wäre. Vielleicht hilft dir diese Episode, eine Antwort zu finden. Wir legen los. Viel Spaß."
    },
    {
      "end": 94750,
      "speaker": "B",
      "start": 80660,
      "text": "Andi. Nachdem du ja ein hundert Prozent remote arbeitest, hast du mittlerweile eigentlich überhaupt noch Zeit, Podcasts zu hören, Weil üblicherweise die Leute hören ja Podcasts beim Pendeln, in der U Bahn, im Bus, im Zug. Hörst du noch Podcasts oder produzierst du nur mehr?"
    },
    {
      "end": 126970,
      "speaker": "A",
      "start": 94990,
      "text": "Man sagt weniger konsumieren, mehr erstellen? Und an dieses Credo halte ich mich aber in der Tat. In letzter Zeit höre ich relativ wenig Podcast. Vorher kam ich sogar an Punkte, wo ich all meine abonnierten Podcast durchgehört habe, also immer on top war nach der letzten Folge. Und inzwischen weiß ich gar nicht mehr, wann ich die alle hören sollte. Gestern zum Beispiel habe ich mal wieder einen angemacht, aber dann hatte ich eine Maschine in der Hand, die ein bisschen lauter war und dann habe ich wieder den Podcast nicht gehört. Der lief dann nur so nebenbei, so als Flimmern im Hintergrund."
    },
    {
      "end": 137930,
      "speaker": "B",
      "start": 126970,
      "text": "Immer gedacht Du wirst jetzt schon die CEO Meinung bestätigen, dass die Leute, die remote arbeiten, eigentlich eh nichts tun und sogar ihre Podcastliste fertig hören können bzw. Leer hören können."
    },
    {
      "end": 157110,
      "speaker": "A",
      "start": 138390,
      "text": "Ich bin kein Mensch, der einen Podcast nebenbei laufen lassen kann und sich dann konzentrieren muss, um zu arbeiten, weil dann höre ich den nicht. Also ich glaube aber solche Fälle gibt es. Also ich glaube, es gibt auch Leute, die zu Hause arbeiten, die ein Arbeitsvolumen haben, was gering ist. Aber ich würde das sagen, das ist nicht die Maße."
    },
    {
      "end": 219630,
      "speaker": "B",
      "start": 157430,
      "text": "Vor allem ist immer die Frage, wer ist dann im Office wesentlich besser überhaupt? Auf jeden Fall sind wir eigentlich schon voll in unserem Thema heute drin. Und zwar geht es ums Remote Arbeiten und besonders ums ein hundert Prozent Remote Arbeiten. Und wir sind eigentlich auf dieses Thema gekommen, weil wir beide auch den Till Bot hören, also ein befreundeter Podcast. Und die hatten kürzlich in Episode sieben und fünfzig gesprochen über Office ist nicht gleich Office und habe so ein bisschen diskutiert, wie man remote arbeitet, von wo man remote arbeitet, Office Strukturen und so weiter. Und dann ist mir eingefallen, ich habe ja da als Podcast Partner einem Menschen, der wirklich ein hundert Prozent remote arbeitet, also so richtig weit ab vom Firmenstandort, ein hundert Prozent remote. Und wir haben noch gar nie eigentlich über dieses Phänomen gesprochen, weil viele denken sich, ja, das ist eigentlich ganz cool, ein hundert Prozent remote zu arbeiten. Viele wollen das gerne machen, manche müssen es machen und genau darüber sprechen wir mal heute. Ist es der perfekte Zustand und ist es, was wir alle erreichen sollten? Und daher, Andi, willkommen im Engineering Kiosk Podcast."
    },
    {
      "end": 221870,
      "speaker": "A",
      "start": 219630,
      "text": "Ich komme mir so vor, als wäre ich dein Interviewgast heute."
    },
    {
      "end": 223150,
      "speaker": "B",
      "start": 222030,
      "text": "Also bist du das nicht."
    },
    {
      "end": 237310,
      "speaker": "A",
      "start": 223390,
      "text": "Schauen wir mal, was es wird. Meine Frage erstmal an Was ist denn für dich Remote Arbeit? Weil ist Homeoffice und eine Hybrid Sache nicht auch Remote Arbeit für dich? Also wie definierst du Remote Arbeit?"
    },
    {
      "end": 332790,
      "speaker": "B",
      "start": 297870,
      "text": "Ja, ich würde es so definieren, Es ist diese Arbeit, die ich von überall aus machen kann. Also wenn ich jetzt gerade vor der Kletterwand bin und vielleicht gerade eine Hand noch frei habe und die andere Hand zum Sichern verwende, dann kann ich noch remote vielleicht irgendwas über ein SSH Terminal fixen. Das ist Remote Arbeit. Das kann ich also gut remote machen. Hingegen einen interaktiven Workshop mit Post its wird dann schon schwieriger remote zu machen. Aber ich würde es nicht unbedingt auf den Job umlegen, sondern eben auf eine gewisse Tätigkeit, ob ich die von überall ausmachen kann oder nicht. Das wäre so meine Definition."
    },
    {
      "end": 335650,
      "speaker": "A",
      "start": 333090,
      "text": "Und jetzt münz die mal bitte auf Software Engineering."
    },
    {
      "end": 338690,
      "speaker": "B",
      "start": 335650,
      "text": "Hey, war dir mein SSH Beispiel zu wenig Software Engineering?"
    },
    {
      "end": 340530,
      "speaker": "A",
      "start": 338850,
      "text": "SSH ist ja meistens Operations."
    },
    {
      "end": 348010,
      "speaker": "B",
      "start": 340610,
      "text": "Hey, du bist der DevOps Mensch. Ich habe gedacht, man macht da alles mit Software Neuerdings in dieser Infrastructure as Code und so weiter Welt."
    },
    {
      "end": 382790,
      "speaker": "A",
      "start": 348010,
      "text": "Du wirst lachen, aber ich stelle gerade wieder Leute ein und untersuche ich Systems Engineer, so heißt die Rolle, was eigentlich eine Softwareentwicklerrolle ist mit Infrastrukturfokus. Und dann frage ich auch immer ab, okay, wie viel Prozent deines aktuellen Jobs machst du in Softwareentwicklung und wie viel Operations. Und danach spezifiziere ich immer, dass Terraform Code schreiben und Helmcharts und Visa leisten ist für mich Operations. Das ist für mich kein Softwareentwickeln. Aber wie definierst du denn jetzt Remote Arbeit versus Home Office zum Beispiel? Also wo, Also im Software Engineering Kontext ist Homeoffice dann auch Remote Arbeit, würde ich schon sagen."
    },
    {
      "end": 408010,
      "speaker": "B",
      "start": 382790,
      "text": "Ja, Remote kann ja überall stattfinden, also kann es auch zu Hause stattfinden, dann ist es Homeoffice. Genau, wobei Homeoffice schwingt für mich da immer so mit, dass das nicht ein hundert Prozent ist. Also wenn man so irgendwie von macht es im Homeoffice spricht, dann klingt es sehr nach Hybrid Setup, was heutzutage wahrscheinlich der Großteil eigentlich hat in den Firmen, dass man mal zwei Tage zu Hause, drei Tage zu Hause, zwei Tage in der Company im Office sitzt."
    },
    {
      "end": 410010,
      "speaker": "A",
      "start": 408010,
      "text": "Viele Firmen nennen das auch mobiles Arbeiten."
    },
    {
      "end": 420250,
      "speaker": "B",
      "start": 410010,
      "text": "Ja, das ist dann der rechtliche Term, oder? Weil Homeoffice hast du glaube ich andere Ansprüche, bekommst du einen Schreibtisch gezahlt und mobiles Arbeiten ist dann etwas anderes üblicherweise. Zumindest ist es in Österreich so."
    },
    {
      "end": 530760,
      "speaker": "A",
      "start": 420410,
      "text": "Telearbeit ist der einzige der drei Begriffe, die im deutschen Recht klar definiert ist, und zwar in der Arbeitsstättenverordnung zwei Absatz sieben, falls ihr da mal nachschauen wollt. Bei der Telearbeit geht es eigentlich um einen festen Arbeitsplatz im privaten Wohnraum und den kann der Arbeitgeber dir auch einrichten. Dazu gehören Möbel, Arbeitsmittel, ein Laptop, die Software, Kommunikationseinrichtungen, Telefon, vielleicht sogar den Schreibtisch. In der Regel werden da sogar die Kosten übernommen. Wenn es zu den rechtlichen Anforderungen deines Arbeitsplatzes im Homeoffice, also im privaten Wohnraum kommt, dann gelten auch die Anforderungen der Arbeitsstättenverordnung. Also ist der Arbeitgeber auch verantwortlich für den Arbeitsschutz, die Ergonomie und für eine regelmäßige Gefährdungsbeurteilung. Theoretisch kann er dann also vorbeikommen, einmal drüber schauen, hey, passt das hier alles und so weiter. Aber meine Definition von Remote bzw. Auch von Remote in diesem Podcast hier oder für diese Podcast Episode ist im Man arbeitet ein hundert Prozent von einer Nicht Bürolocation aus, also nicht von einer Bürolocation, die von dem Arbeitgeber gegeben wird, wo sich mehrere Leute treffen. Remote heißt dabei unter Umständen nicht Homeoffice, wobei Homeoffice bei mir in meinem Falle jetzt auch remote ist, aber ich kann auch von Spanien arbeiten oder ähnliches, sofern mein Arbeitgeber das natürlich erlaubt. Der wichtige Unterschied zu Hybrid ist, dass wenn du ein hundert Prozent aus einer Nicht Büro Location arbeitest, dass du manche Dinge einfach nicht kompensieren kannst, die zum Beispiel beim Hybrid Environment, wenn du zwei Tage oder einen Tag die Woche ins Büro gehst, die du dann kompensieren kannst, wie zum Beispiel deine Kollegen treffen oder ähnliches. Und das geht dann halt einfach nicht, wenn du ein hundert Prozent remote bzw. Aus dem Homeoffice oder wo auch immer arbeitest."
    },
    {
      "end": 547040,
      "speaker": "B",
      "start": 530840,
      "text": "Wir werden jetzt gleich in die ganzen Details abtauchen und was es für Nachteile gibt und Vorteile und auf was man achten muss, wenn man ein hundert Prozent remote arbeitet. Aber initial mal meine Frage auf einem Level von eins bis zehn, wie zufrieden bist du mit ein hundert Prozent Remote? Zehn ist ganz gut übrigens, ich musste."
    },
    {
      "end": 549600,
      "speaker": "A",
      "start": 547040,
      "text": "Ein bisschen drüber nachdenken, weil das ist echt eine schwierige Frage."
    },
    {
      "end": 557280,
      "speaker": "B",
      "start": 549920,
      "text": "Pausen schneiden wir automatisch raus. Ihr könnt jetzt leider keine Pause hören, aber es waren sicher zwanzig dreiig Sekunden Pause."
    },
    {
      "end": 559200,
      "speaker": "A",
      "start": 557360,
      "text": "Ich würde sagen schon so nur acht."
    },
    {
      "end": 570040,
      "speaker": "B",
      "start": 559200,
      "text": "Könntest du dir vorstellen, mal hybrid noch zu arbeiten im aktuellen Setting mal das du hast oder bist du schon so eingestellt auf das ein hundert Prozent remote, dass es gar nicht mehr anders ginge?"
    },
    {
      "end": 601480,
      "speaker": "A",
      "start": 570040,
      "text": "Ich könnte es mir auch vorstellen, aber da müsste eine ganze Menge passen, weil eins muss man natürlich auch sagen, in dieser Acht steckt gerade eine Bewertung drin, die auf der einen Seite mein Privatleben beeinflusst, auf der anderen Seite aber auch mein berufliches in Bezug auf welche beruflichen Herausforderungen ich habe. Also ein hundert Prozent remote arbeiten und kein Büro in der Nähe zu haben, erlaubt mir natürlich auch für Firmen zu arbeiten oder in irgendwelchen Domänen zu arbeiten, die es hier in Duisburg, Düsseldorf oder im Ruhrgebiet gar nicht gibt."
    },
    {
      "end": 605960,
      "speaker": "B",
      "start": 601480,
      "text": "Ich hab gedacht, du bist immer der Meinung, dass eh alle mit Wasser kochen und alle dieselben Probleme haben."
    },
    {
      "end": 609780,
      "speaker": "A",
      "start": 606260,
      "text": "Das ist richtig, Aber wie geht der Satz denn weiter, den ich immer sage."
    },
    {
      "end": 611620,
      "speaker": "B",
      "start": 609860,
      "text": "Aber andere haben einen größeren Topf."
    },
    {
      "end": 649690,
      "speaker": "A",
      "start": 611940,
      "text": "Keine Ahnung, andere haben mehr Wasserkocher. Und was ich mit Herausforderungen meine, ist in Software Engineering Welt der Scale, was bei diesem Satz dann die Anzahl der Wasserkocher wären. Und wenn wir das jetzt mal aufs Internet runterbrechen, wo ich halt ziemlich viel in meiner Karriere drin gearbeitet habe, im Web, Web Operations und all sowas, dann ist mein aktueller Arbeitgeber natürlich schon ganz vorne dabei, was jetzt im Ruhrpott, soweit ich ihn auch liebe, keiner bieten kann. Und das ist ja dann die, der Trade, auf dem man den man macht, würde ich sagen. Man kann natürlich auch umziehen, aber umziehen kommt für mich jetzt gerade nicht in Frage."
    },
    {
      "end": 698320,
      "speaker": "B",
      "start": 649930,
      "text": "Wobei natürlich die Frage ist, wenn man jetzt so von den klassischen Cloud Firmen spricht, also so wie jetzt Cloudflare bei dir oder Google oder sonst was, ob es da überhaupt noch ein klassisches In Office Setting gibt, in dem Sinne, dass man nicht sowieso immer international zusammenarbeitet, über mehrere Zeitzonen hinweg verschiedene Kulturen in der Firma hat. Also diese Dinge spielen wahrscheinlich einfach durch den Scale schon eine ganz andere Rolle in solchen Firmen. Es hat jetzt wenig damit zu tun, ob es Hybrid, remote oder In Office ist, weil auch wenn du in einem Office sitzt, wenn du trotzdem mit der Westküste zusammenarbeitest und das passiert halt in diesen Firmen, musst du es genauso timen, mit den Zeitzonen arbeiten und diese in irgendeiner Form handeln und vielleicht mal außerhalb der normalen Arbeitszeiten arbeiten oder einen Termin wahrnehmen."
    },
    {
      "end": 726900,
      "speaker": "A",
      "start": 698480,
      "text": "Ja, das musst du ein bisschen detaillierter spezifizieren, ein bisschen detaillierter betrachten, denn wenn du über Teams hinweg arbeitest, dann stimme ich dir zu. Oft wird es aber so organisiert, dass zum Beispiel ein Großteil eines Produktes an einem Standort entwickelt wird, in München bei Google im Büro, da wird zum Beispiel ein Großteil der V JavaScript Engine geschrieben, soviel ich weiß. Hörensagen, liebe Googler, die uns zuhören, bitte bestätigen, aber das ist meine letzte Information."
    },
    {
      "end": 729780,
      "speaker": "B",
      "start": 726980,
      "text": "Ich weiß auch meine letzte Information Micro."
    },
    {
      "end": 745620,
      "speaker": "A",
      "start": 729860,
      "text": "Und dasselbe ist, glaube ich, für große Teile von YouTube werden oder wurden teils im Züricher Büro erstellt oder dass Teile vom EC Team bei Amazon, ich glaube in Dresden, sitzen oder saßen."
    },
    {
      "end": 749940,
      "speaker": "B",
      "start": 745940,
      "text": "Jetzt hättest du die Möglichkeit, über Cloud zu sprechen und jetzt sprichst du wieder über Google."
    },
    {
      "end": 750900,
      "speaker": "A",
      "start": 750180,
      "text": "Das ist korrekt."
    },
    {
      "end": 755600,
      "speaker": "B",
      "start": 750900,
      "text": "Ich meine auch wir haben oder schwingt da im Hintergrund so ein NDE Schwert bei dir rum?"
    },
    {
      "end": 774520,
      "speaker": "A",
      "start": 755600,
      "text": "Nein, nein, nein. Es geht nur darum, dass wir intern ziemlich viele proprietäre Produkte haben, die wir selbst entwickelt haben, die nach außen hin gar nicht sichtbar sind. Wenn ich jetzt einen internen Produktnamen nenne und sage, der wird in London entwickelt, dann sagt das einfach keinem was. Und EC versus V und YouTube sind halt Services, die in der Regel jeder kennt."
    },
    {
      "end": 813270,
      "speaker": "B",
      "start": 774520,
      "text": "Okay, jetzt hast du dich wieder gut rausgeredet, aber lass uns mal auf genau diese Details eigentlich gehen. Was macht denn für dich die ein hundert Prozent Remote Arbeit aus und wo siehst du da jetzt in deinem SE mit ein hundert Prozent Remote den großen Unterschied zu Hybrid? Weil Hybrid kennt jeder oder wird mal sagen, hat jeder und jede irgendwie Erfahrung damit gemacht und ist mittlerweile, würde ich mal sagen, in der IT Welt der neue Standard. Aber ein hundert Prozent Remote ist dann schon noch mal was anderes. Vor allem, wenn es ein hundert Prozent Remote ist im Sinne von die Firma ist vielleicht nicht mal im gleichen Land oder in der Stadt nebenan, sondern man muss wirklich vielleicht in den Flieger steigen, um sein Team zu treffen."
    },
    {
      "end": 834150,
      "speaker": "A",
      "start": 813270,
      "text": "Und genau das Letzte, was du gesagt hast, ist bei mir der Fall. Vertragstechnisch bin ich im Freistaat Bayern angestellt, weil das Cloudflare Deutschlandbüro in München ist, aber keiner von meinen Teammitgliedern sitzt irgendwie in München oder in Duisburg oder in Düsseldorf oder ähnliches. Also das bedeutet, ich müsste zumindest in den Zug steigen, um Teammitglieder zu treffen."
    },
    {
      "end": 839400,
      "speaker": "B",
      "start": 834150,
      "text": "Das heißt, du förderst die bayerische Regierung, du zahlst deine Steuern quasi dann in Bayern."
    },
    {
      "end": 841080,
      "speaker": "A",
      "start": 839560,
      "text": "Nein, nein, ich zahle meine Steuern."
    },
    {
      "end": 843720,
      "speaker": "B",
      "start": 841080,
      "text": "Also die Firma zahlt Steuern in Bayern, besser gesagt."
    },
    {
      "end": 847960,
      "speaker": "A",
      "start": 844040,
      "text": "Das musst du Cloudflare fragen, wie die das machen. Da bin ich jetzt kein Steuerfachangestellter bei."
    },
    {
      "end": 852920,
      "speaker": "B",
      "start": 847960,
      "text": "Uns, da tun sich ganz neue Welten bei mir auf. Aber bitte wollte dich nicht unterbrechen."
    },
    {
      "end": 873230,
      "speaker": "A",
      "start": 852920,
      "text": "Also wenn wir uns die Unterschiede zwischen ein hundert Prozent Remote und Hybrid mal ansehen, dann starte ich jetzt nicht damit. Ja, an den Tagen, wo ich im Homeoffice bin, schlafe ich bis sieben uhr neun und fünfzig und um sitze ich schon im Meeting. Kennst du wahrscheinlich dieses Meme oder? Oh ja, dann spare ich mir zwei Tage den Sprit vom Auto oder den Verkehrsweg oder sowas. Ja, das ist schön alles gut."
    },
    {
      "end": 878630,
      "speaker": "B",
      "start": 873230,
      "text": "Das kennen ja auch alle im hybriden Setup, auch an den Tagen, wo sie eben nicht im Office sind."
    },
    {
      "end": 979670,
      "speaker": "A",
      "start": 878630,
      "text": "Ja, ja, genau. Deswegen ist das jetzt nichts, nichts Tolles. Ich glaube, ein riesen Unterschied, den man über Zeit feststellt und den habe ich jetzt vor kurzem wieder festgestellt, als ich wieder zwei Tage auf einer Konferenz war. Dein Gehirn verdrahtet sich ein bisschen anders. Wenn du ein hundert Prozent remote arbeitest, dann solltest du auch, wie auch in einem hybriden Setup im besten Falle einen eigenen Raum haben in deinem Haus oder in deiner Wohnung, den du abschließen kannst, wo du ein Büro hast und so weiter. Ich glaube, das ist so eine Standardempfehlung, die jeder schon mal gehört hat. Das bedeutet also auch, du sitzt irgendwie acht Stunden alleine vor diesem Computer, ab und zu holst dir mal einen Kaffee bei dir in der Küche, wenn du Glück hast, arbeitet noch mal jemand remote, aber dann machst du ja kein Kaffeemaschinen Gespräch mit deiner Frau über das, was bei dir gerade in der Firma abgeht. Also das ist ja dann nicht wie im Büro, wo man über die gleichen Projekte spricht, wenn man jemanden der Kaffeemaschine trifft. Das bedeutet eigentlich, du sitzt halt sehr viel vor dem Computer, liest unglaublich viel und deine soziale Interaktion ist anders als hybrid. Du gehst nicht mit den essen, du isst vielleicht alleine, gehst vielleicht mit dem Hund oder ähnliches, wie du auch immer deine Mittagspausen verbrauchst. Punkt ist aber, deine sozialen Interaktionen im realen Leben sind anders als remote und dabei verdrahtet sich dein Kopf ein bisschen anders, so habe ich das Gefühl. Denn wenn ich zwei Tage auf einer Konferenz bin, mich mit sehr vielen verschiedenen Leuten unterhalte, ich bin am Abend deutlichst müder, als ich das vor fünf Jahren auf einer Konferenz noch war. Deutlichst einfach nur, weil die Art der sozialen Interaktion anders ist. Das wird dir aber erst nach einem Jahr oder anderthalb bewusst, kannst du es."
    },
    {
      "end": 1041790,
      "speaker": "B",
      "start": 979670,
      "text": "Irgendwie nachvollziehen, nachdem ich ja auch remote arbeite, die meiste Zeit zumindest außer jetzt mal ich bin vor Ort bei einem Kunden bei einem Workshop oder ähnliches, kenne ich natürlich dieses Problem, nenne ich es mal, oder diese andere Art von sozialen Kontakten im Business Umfeld sehr gut. Und gerade zum Vergleich bei klassischen Jobs, wo man halt fünf Tage die Woche im Office ist, ist da ein riesen Unterschied, weil die einfach wirklich was komplett wegbricht an soziale Interaktion und die musst du dann irgendwie kompensieren und man unterschätzt, wie viel das eigentlich ist. Ich würde mal sagen, beim hybriden Setup hast du ja trotzdem noch die Komponente, dass du Leute triffst. Aber wenn du ein hundert Prozent remote bist, dann musst du das wirklich kompensieren und zeitlich auch mit einkalkulieren, weil auch das schnelle Gespräch zu Mittag, was man so führt vielleicht im Business Kontext, aber das vielleicht mehr oder weniger ein privates Gespräch ist und man hat ja vielleicht auch Freundschaften im Business Kontext, die fallen auch komplett weg. Also es ist schon ein großer Einschnitt, nicht nur auf der Business Seite, meiner Meinung nach."
    },
    {
      "end": 1128279,
      "speaker": "A",
      "start": 1041790,
      "text": "Ich würde das nicht als Problem bezeichnen. Es fühlt sich nur anders an und es fühlt sich im täglichen Doing nicht anders an. Aber wenn du halt eine Maße an sozialen Interaktionen auf einmal hast, wie zum Beispiel ein ganzer Konferenztag, dann merkst du, du bist am Abend deutlichst müder. Und das hört sich jetzt so an. Andi, hast du keine Freunde? Doch, ich habe sehr viel Freunde und Bekannte und treffe auch sehr viel davon. Doch es ist eine andere Interaktion als im Business Kontext. Und man unterschätzt, das ist jetzt nicht negativ, sondern das nur einer der gravierenden Unterschiede. Ein anderer gravierender Unterschied ist natürlich die sozialen Interaktionen und das Vertrauen aufbauen und auch das, was du gerade erwähnt hast, diese kleinen Chats an der Kaffeemaschine oder beim Essen mit anderen Kollegen aus anderen Abteilungen. Man unterschätzt das, wie viel Wert einem diese Unterhaltungen mittel bis langfristig geben können, weil du warst ah Moment mal, stopp mal, aber die Abteilung arbeitet doch an dem Projekt und so weiter. Das musst du jetzt alles, wenn du ein hundert Prozent remote bist, aktiv irgendwo nachlesen, unter der Voraussetzung, dass das irgendwo steht oder dass du in irgendeinem Chatroom davon Wind bekommen hast. Und dann kommt das nächste Thema. Du bist ja nicht in jedem Chatroom dabei und du hast auch gar keine Zeit, jeden Chatroom zu folgen. Also diese, ich nenne es mal Seiten, Informationen, die du allein durchs Büro irgendwie aufpickst, können dir enorm helfen, um auf Englisch würde ich sagen, connecting the dots, um zwischen Zusammenhänge herzustellen. Das ist auch noch mal eine riesen Thematik."
    },
    {
      "end": 1150250,
      "speaker": "B",
      "start": 1128279,
      "text": "Jetzt hast du das Ganze ins Spiel gebracht mit den klassischen Kaffeechats, wichtig Kaffee, nicht Kaffee, dass Gott und die Welt rauf und runter betet. Aber jetzt mal konkret, was machst du denn dagegen? Weil von den Kaffeechats sprechen ja alle, also das hört man ja immer von den CEOs, die wieder hybrid wollen und so weiter. Aber was machst du jetzt in dem ein hundert Prozent Remote Setup dagegen. Also wie kompensierst du das Ganze?"
    },
    {
      "end": 1153770,
      "speaker": "A",
      "start": 1150250,
      "text": "Ich stelle mal eine Gegenfrage. Muss man es kompensieren Oder wenn du."
    },
    {
      "end": 1172120,
      "speaker": "B",
      "start": 1153770,
      "text": "Sagst, dir fehlen die Informationen, die irgendwo stehen müssen, dann fehlen dir Informationen. Also dann fehlen dir offensichtlich für deinen Alltag gewisse Informationen, die du bei der Kaffeemaschine kriegen würdest, die du jetzt in irgendeiner Form anders kompensieren musst oder aufholen musst oder in anderer Form irgendwo herbeschaffen musst."
    },
    {
      "end": 1199530,
      "speaker": "A",
      "start": 1172120,
      "text": "Naja, splitten wir das mal. Also auf der einen Seite bin ich natürlich auch ein neugieriger Mensch und ich möchte alles wissen. Dann die nächste Frage, sollte ich alles wissen? Also ich denke schon, dass dreiig vierzig oder fünfzig Prozent der Sachen, die ich bei so Coffeeshats und so weiter mitbekomme, dass ich die vielleicht gar nicht wissen muss, sondern einfach nur habe, aha, das geht in der Firma ab, aber die bringen mich dann nicht weiter. Die anderen Informationen, die mich vielleicht weiterbringen, die muss ich mir natürlich dann aktiv beschaffen. Dauert das länger? Weiß ich nicht. Erfordert das bessere Planung? Ja, auf jeden Fall."
    },
    {
      "end": 1224090,
      "speaker": "B",
      "start": 1200170,
      "text": "Okay, aber wie planst du das jetzt? Wie beschaffst du diese Informationen? Weil an der Kaffeemaschine kommen die ja zufällig vorbei. Also früher gab es ja sowas oder gibt es wahrscheinlich immer noch auf Wikipedia diesen Random Link. Ich hatte den mal sogar als Favorite zu meinen Universitätszeiten, wo ich draufgeklickt habe, habe eine Random Seite bekommen, habe mir mal die Seite durchgelesen. Aber so was wirst du ja aktiv wahrscheinlich in deinem Firmenkontext nicht machen. Jeden Tag eine Random Wiki Seite durchlesen."
    },
    {
      "end": 1281790,
      "speaker": "A",
      "start": 1224780,
      "text": "Du wirst lachen, aber ich lese mir oft Random Wiki Seiten durch, einfach nur, weil das Wiki so groß ist. Aber ich meine, wie beschaffe ich das? Bei einer Kaffeeunterhaltung kriege ich die Information ja deutlich vorher und erinnere mich später dran, wenn ich an einem Projekt arbeite, ah, da war doch irgendwas, Jetzt besorge ich mir die Information halt, wenn ich an diesem Projekt arbeite, halt einfach zu einem anderen Zeitpunkt. Wie besorge ich mir dann? Ganz klassisch, wie man sich eine Information in Unternehmen besorgt. Man schaut sich an, welches Team macht das? Wer ist ein möglicher Ansprechpartner? Wenn du nicht weißt, wer ein möglicher Ansprechpartner ist, dann fragst du irgendwelche Leute in deinem Team oder auf deinem Level. Und wenn nicht, dann postest du einfach in irgendeinen Engineering Channel, hey, ich suche was zu dem Thema, wer kann mir helfen? Also das ist ja nichts Neues, nur ich hole mir die Information dann einfach nur zu dem Zeitpunkt, wenn ich sie benötige und nicht einfach vorher und habe sie dann sofort, ich sag mal, an der Hand. Und deswegen habe ich ja die Gegenfrage, muss das alles kompensiert werden?"
    },
    {
      "end": 1288710,
      "speaker": "B",
      "start": 1281790,
      "text": "Bist du dann effizienter deiner Meinung nach, weil du eben nur fünfzig Prozent der Informationen dann überhaupt mal suchen musst?"
    },
    {
      "end": 1293390,
      "speaker": "A",
      "start": 1288710,
      "text": "Ich habe noch nie eine Studie darüber gemacht, ob ich jetzt effizienter bin oder nicht. Da müsste ich halt hybrid."
    },
    {
      "end": 1334180,
      "speaker": "B",
      "start": 1294030,
      "text": "Was hast du im Gefühl? Weil wenn ich so zurückdenke an so klassische ein hundert eins zum Beispiel, du bekommst eine Frage gestellt als Lead und dann hast du im Kopf, stimmt, denjenigen aus dem Team X da hinten aus dem SRE Team, den Andi, der hat mir erzählt, dass genau die dieses Problem haben und der Peter hat dieses Problem gelöst und ich kann direkt im ein hundert eins frag mal den Peter, der hat genau dieses Problem bearbeitet, vor einer Woche Problem gelöst. Du musst jetzt irgendwie entweder der Person beibringen, wie kommt die Person zu der Information aus deinem Team oder du machst es im Nachgang. Also schon eine extra Schleife, würde ich mal sagen, die unter Umständen auch länger dauern kann, oder?"
    },
    {
      "end": 1445510,
      "speaker": "A",
      "start": 1334340,
      "text": "Ja, so kannst du das sehen. Also ich bin sowieso ein Fan davon, von deinem ersten Vorschlag der Person beizubringen, sich die Information selber zu holen, weil du bist ja nicht deren Eltern und besorgst jede Information, nur weil du was gefragt wirst. Das hat ja dein Chef damals auch nicht gemacht oder deine Chefin, deswegen ist das sowieso immer gut. Und die zweite Thematik ist, da könnten wir jetzt darüber sprechen, ist das nicht vielleicht sogar premature optimization? Also du hast die Information und weiß eigentlich zu dem Zeitpunkt, wenn du die Information erhältst, ob du die jemals nutzen wirst. Und ich hole sie Informationen, wenn ich sie aktiv brauche. Also zurück, um zurück auf deine Frage zu kommen, bin ich dann effizienter? Kann ich nicht ganz genau beantworten, aber mit einer kleinen positiven Tendenz. Ja, weil ich hole mir diese Information, wenn ich sie brauche, zu dem aktuellsten Stand. Und die zweite Thematik, Achtung, weil ich bin nämlich auch so ein Typ, ist so ein bisschen Selbstschutz. Umso mehr ich weiß, desto mehr Projekte finde ich auch interessant und desto mehr verfolge ich diese Projekte auch und jetzt kümmere ich mich sehr viel um Projekte in meiner Domäne. Also dieses Setup hier und auch die, ich sag mal, fehlenden Kaffee Chats hilft mir sehr, mich auf meine Fachdomäne zu konzentrieren. Und ich guck nicht immer links und rechts. Das heißt jetzt nicht, ich bin so ein Eichhörnchen, was bei jedem kleinsten Piep irgendwo links und rechts guckt. Aber in großen Organisationen kann man sich gefühlt den ganzen Tag mit anderen Sachen beschäftigen, außer mit seinem eigenen Job, Sei es mit Trainings, sei es mit irgendwelchen, teilweise gab es ja sogar Kochkurse in manchen Firmen und so weiter und so fort. Oder man kann sich die neuesten Statusmeldungen vom Plattform Team abholen und so weiter. Man kann sich ja den ganzen Tag mit etwas beschäftigen, ohne mit seinem eigenen Job eigentlich. Aber eins muss man noch lassen, das Zwischenmenschliche, das geht natürlich komplett verloren. Also das, was auch bei jeder Unterhaltung an der Kaffeemaschine stattfindet, das hast du remote nicht, das kann man nicht ersetzen."
    },
    {
      "end": 1447430,
      "speaker": "B",
      "start": 1445510,
      "text": "Wie kompensierst du das dann?"
    },
    {
      "end": 1500880,
      "speaker": "A",
      "start": 1447510,
      "text": "Ja, das ist, wenn ich die Frage sehr gut beantworten könnte, wäre ich glaube ich reich. Ich habe zwei Antworten. Auf der einen Seite bin ich auch ein bisschen älter geworden, das bedeutet, ich muss meine ganze Freizeit auch nicht mehr auf der Arbeit verbringen und ich muss jetzt auch nicht mehr mit jedem Best Friend sein, muss ich zugeben. Das bedeutet, vielleicht lasse ich Arbeit auch Arbeit sein und halte es auf einem professionellen Level. Das ist die eine Baustelle. Die andere Seite ist natürlich, willst auch in irgendeiner Art und Weise ein angenehmes Arbeitsklima haben. Ich meine, starte halt nicht jedes ein hundert eins mit, hey, wie ist der Arbeitsstatus, sondern wie geht es dir denn gerade? Also das ist ja dann ein ganz normales Gespräch und du baust Vertrauen über Zeit auf. Da gibt es natürlich dann auch noch andere Elemente, dass du dich vielleicht mit diversen Leuten aus deinem Department bzw. Aus einer größeren Organisation einfach nur mal so randommässig triffst und über Gott und die Welt sprichst und jetzt vielleicht nicht dauerhaft über Arbeit. Das wäre so die Art und Weise und Weise, wie ich das kompensieren würde."
    },
    {
      "end": 1513520,
      "speaker": "B",
      "start": 1501040,
      "text": "Aber wie gehst du das dann an, wenn du random Leute triffst? Weil an der Kaffeemaschine ist das Gespräch ja schon da, aber so musst du jetzt aktiv irgendwen anschreiben und sagen, hey, machen wir ein Meeting zu nichts random."
    },
    {
      "end": 1527680,
      "speaker": "A",
      "start": 1513680,
      "text": "Das solltest du wissen, ist mein kleinstes Problem, einfach Leute anzuquatschen. Im Endeffekt frage ich dann immer, hey, pass mal auf, ich würde dich gerne mal kennenlernen, ich würde mal ein bisschen was über dich erfahren, aber auch natürlich auch ein bisschen Vorwand. Was machst du denn hier in dieser Firma und so weiter."
    },
    {
      "end": 1531580,
      "speaker": "B",
      "start": 1527840,
      "text": "Aber machst du das wirklich aktiv? Machst du das regelmäßig, solche Meetings?"
    },
    {
      "end": 1537500,
      "speaker": "A",
      "start": 1532060,
      "text": "Als ich den Arbeitgeber initial gewechselt habe, habe ich das deutlich mehr gemacht. Und jetzt mache ich das immer mal wieder."
    },
    {
      "end": 1545340,
      "speaker": "B",
      "start": 1537500,
      "text": "Und die Leute sind auch dazu bereit, da eine halbe Stunde zu reservieren für Im ersten Moment klingt es ja sehr nach random."
    },
    {
      "end": 1576110,
      "speaker": "A",
      "start": 1545340,
      "text": "Im ersten Moment klingt es nach random. Im Endeffekt ist es natürlich auch wie an der Kaffeemaschine. Irgendwann geht man halt wieder auf den Firmenkontext über. Ich frage jetzt nicht, hast einen Hund und wie viel Ziegen und Hühner bewirtschaftest du? Also das mache ich ja jetzt nicht. Oder wie groß ist deine Wohnung? Also das ist jetzt unpassende Fragen, die ich vielleicht im internationalen Kontext jetzt nicht so stellen würde, Aber hey, was hast du vorher gemacht? Worum kümmerst du dich hier? Welche Herausforderungen siehst du denn? Und so weiter und so fort. Das sind ja, ich sag mal so random Chats und dann merkst du ja schon, okay, wie tickt die Person und so weiter und so fort."
    },
    {
      "end": 1599350,
      "speaker": "B",
      "start": 1576110,
      "text": "Und dann aber wie siehst du denn das jetzt, wenn du von dir selber mal ausgehst? Du hast jetzt einen stressigen Tag, hast du ja wahrscheinlich, du leitest zwei Teams und noch viele Projekte und jetzt kommt da eine Anfrage rein, Hey, lass uns mal kennenlernen. Ich kenne dich noch nicht, Andi, ich möchte mal erfahren, was du denn so machst. Können wir eine halbe Stunde Chat machen? Wie glücklich bist du im ersten Moment, wenn du diese Message bekommst?"
    },
    {
      "end": 1617750,
      "speaker": "A",
      "start": 1599510,
      "text": "Erst mal cool, dass die Person mich gefunden hat, weil irgendwo muss ich ja aufgetaucht sein. Das freut mich natürlich schon sehr, dass man in irgendeiner Art und Weise eine gewisse Sichtbarkeit hat. Die zweite Niemand erwartet, dass du jetzt in den nächsten zwei Stunden eine halbe Stunde Zeit hast. Und niemand kann mir sagen, dass ein Tag so stressig ist, dass du innerhalb in anderthalb Wochen oder zwei Wochen nicht vielleicht mal einen Spot hast."
    },
    {
      "end": 1620360,
      "speaker": "B",
      "start": 1617750,
      "text": "Also du siehst es positiv und machst diese Gespräche auch gern."
    },
    {
      "end": 1680260,
      "speaker": "A",
      "start": 1620590,
      "text": "Ja, tierisch, weil also Netzwerk, und das hört sich jetzt total doof an, ist das Beste, was man in einer Firma haben kann. Ich bin auch ehrlich, mein aktuellen Job, den habe ich auch über Netzwerk bekommen, bzw. Ich habe die Chance zu einem Interview über das Netzwerk bekommen. Desto weiter du in einer Karriere bist, je mehr ist das Netzwerk von Vorteil und auch innerhalb der Firma hilft dir das, wenn du schon mal mit Leuten gesprochen hast, dich mal vorgestellt hast und so weiter und so fort, um einfach Projekte nach vorne zu treiben. Denn du bist vielleicht jetzt Softwareentwickler und Softwareentwicklerin und arbeitest vielleicht jetzt gerade im Scope von deinem Team. Je erfahrener du bist, desto mehr wird erwartet, dass du auch einen Impact außerhalb deines Teams hast, außerhalb deiner Abteilung und vielleicht sogar an Firmenprojekten arbeitest, die einen weit größeren Impact haben als an der Applikation, an der du jetzt arbeitest. Und da musst du mit Leuten kommunizieren. Und wenn du die Connection bereits hast, dann geht das alles. Wie sagt man so schön, auf kurzem."
    },
    {
      "end": 1703770,
      "speaker": "B",
      "start": 1680260,
      "text": "Dienstweg jetzt bist du ja Engineering Manager. Machst du auch was, das dein Team, das intern irgendwie ähnlich handhabt. Machst du irgendwelche speziellen Rituale? Trefft ihr euch da zum, wie heißt es bei euch Karneval dann online in irgendwelchen Dinosaurierkostümen? Ich kann mich erinnern, ich habe einmal in einem Lift so ein Dinosaurier getroffen im Office. War sehr lustig in Düsseldorf. Macht ihr dann auch so was?"
    },
    {
      "end": 1722730,
      "speaker": "A",
      "start": 1703770,
      "text": "Kostüm Meetings habe ich bisher noch nicht gemacht und der Grund ist relativ einfach. In meinem Team hat man, habe ich diverse Kulturen und manche Kulturen davon kennen einfach keinen Karneval, so wie das hier im Rheinland der Fall ist. Wenn ich denen sage, kauft euch mal ein Kostüm und zieht das mal an, dann gucken die mich, glaube ich, auch schräg an. Könnte aber eine lustige Thematik werden, aber habe ich noch nicht gemacht."
    },
    {
      "end": 1727010,
      "speaker": "B",
      "start": 1722730,
      "text": "Aber danke, es gibt ja auch Halloween oder solche Sachen, also die international sind."
    },
    {
      "end": 1732690,
      "speaker": "A",
      "start": 1727090,
      "text": "Ja, Halloween ist halt sehr viel in der westlichen Welt und sehr viel in Amerika, weniger im asiatischen Raum."
    },
    {
      "end": 1750210,
      "speaker": "B",
      "start": 1732930,
      "text": "Okay, aber es muss ja keine kostümierten Meetings sein. Aber machst du als Engineering Manager irgendwelche Rituale? Hast du da gewisse Meetings, die du aufsetzt, die speziell in die Richtung soziale Interaktion gehen oder motivierst du deine Team Members in irgendeiner Form solche sozialen Interaktionen zu machen?"
    },
    {
      "end": 1776160,
      "speaker": "A",
      "start": 1750370,
      "text": "Ja, wir fangen da jetzt gerade mit an. Wir haben das jetzt ein, zwei, drei Mal gemacht. Ganz doof. Wir spielen dann eine Kleinigkeit irgendwie online. Da gibt es dann halt so, weiß ich nicht, so Geoguesser oder so Sachen, die man halt im Team spielen kann oder da malt jemand was und alle anderen müssen tippen und raten, was es ist oder vielleicht eine Runde Among Us oder sowas. Halt so Kleinigkeiten kann man da immer spielen."
    },
    {
      "end": 1777080,
      "speaker": "B",
      "start": 1776160,
      "text": "Wie kommt es an?"
    },
    {
      "end": 1833520,
      "speaker": "A",
      "start": 1777320,
      "text": "Ja, die einen Leute mögen das natürlich, die anderen sagen, okay, ich öffne mich mal oder ich habe da keine Zeit zu, ich zwinge das jetzt keinem auf. Ich kann das auch verstehen, da jeder sein eigenes Leben hat. Und da das ja über verschiedene Zeitzonen hinweg ist, wäre es dann bei mir zum Beispiel, angenommen, man macht das freitags, ich müsste das dann freitags morgens machen, weil dann zum Beispiel das Team in Asien dann schon Freitag Mittag, Freitagnachmittag hat und ich möchte natürlich nicht bis Freitagabend dann irgendwie bei der Arbeit hängen haben, weil das ist ja für die mehr oder weniger Arbeitszeit. Da muss man natürlich aber sagen, das asiatische Team ist sehr gebündelt an einer Location und die kennen sich alle, weil die zum Beispiel in einem Büro sind. Also es ist so teils hybrid, aber mit virtuelle Happy Hours fand ich auch eine coole, eine coole Lösung. Happy Hour verbinde ich immer mit, man macht mal ein Bier auf oder ein Cocktail. Das Problem ist, über verschiedene Zeitzonen hinweg, irgendwo ist halt echt noch morgens und du kannst dir halt morgens nicht so Gin Tonic reinknallen, wenn du eine virtuelle Happy Hour machst."
    },
    {
      "end": 1837040,
      "speaker": "B",
      "start": 1833520,
      "text": "Trefft ihr euch dann irgendwie physisch von Zeit zu Zeit?"
    },
    {
      "end": 1850960,
      "speaker": "A",
      "start": 1837200,
      "text": "Bei der aktuellen Firma bin ich ja erst acht Monate und ich bin einmal nach Asien geflogen und habe das Team im realen Leben kennengelernt. Wurde auch sehr, sehr positiv aufgenommen, so wie ich das auf jeden Fall wahrnehme Und das verändert auch die Arbeit, ganz klar."
    },
    {
      "end": 1853480,
      "speaker": "B",
      "start": 1850960,
      "text": "Aber da sprechen wir von einmal im Jahr oder sowas."
    },
    {
      "end": 1856360,
      "speaker": "A",
      "start": 1853480,
      "text": "Wie gesagt, da ich erst acht Monate da bin, kann ich jetzt nicht von."
    },
    {
      "end": 1859820,
      "speaker": "B",
      "start": 1856360,
      "text": "Einem regelmäßigen Ja, du Engineering Manager, was planst du denn so?"
    },
    {
      "end": 1949050,
      "speaker": "A",
      "start": 1859980,
      "text": "Man plant, dass es einmal im Jahr stattfindet, dann ist die nächste okay, findet das Off Site regional statt oder weltweit? Weil weltweit, dann müsstest du halt wirklich Leute aus Europa, aus Amerika und Asien zusammenführen. Und davon rede ich jetzt nicht die komplette Firma, sondern wirklich nur die eine Abteilung oder ähnliches. Und dann kommen natürlich auch ganz andere Kosten auf einen zu. In der vorherigen Firma, wo ich war, die hat jedes Jahr ein Offsite gemacht für die komplette Firma eine Woche lang. Das ist schon sehr positiv, muss man zugeben. Und wenn ich die Chance hätte oder wenn man die Chance hat generell, dann würde ich auch vorschlagen, dass man das mindestens einmal im Jahr macht. Es ist aber auch so, gibt dem Ganzen immer einen größeren Sinn. Also trefft euch nicht, geht dann essen und arbeitet ganz normal am Schreibtisch nebeneinander, sondern macht wirklich Workshops, baut eine Roadmap fürs nächste Jahr, macht Teambuilding Maßnahmen und eine Retrospektive ist zum Beispiel prädestiniert, die Onzeit zu machen und so weiter und so fort. Also gibt dem Ganzen einen größeren Sinn. Denn ihr müsst bedenken, diese Leute opfern auch ihre Freizeit und ihre Reisetätigkeit. Besonders wenn du über Zeitzonen hinweg reist. Also ich sage jetzt nicht von Düsseldorf nach Berlin, sondern weiß ich jetzt nicht, von Düsseldorf nach New York oder nach Singapur oder ähnliches. Da sind ja Zeitzonen mit involviert. Das bedeutet, du musst dich auch noch irgendwie an die Zeitzonen gewöhnen und da geht dann deutlich mehr Zeit bei drauf. Das ist ja zusätzliche Arbeit, wenn man so möchte. Und die Leute lassen ja auch Familie zu Hause und das muss auch alles organisiert werden mit Kindern und Co."
    },
    {
      "end": 1968970,
      "speaker": "B",
      "start": 1949050,
      "text": "Wie stellst du dann sicher, wenn du da in mehreren Time Zones arbeitest, dass du selber dein Leben nicht komplett zerreißt und dann nur mehr nach den Time Zones von deinen Teams in irgendeiner Form lebst und dann am Ende womöglich irgendwie sechzehn Stunden arbeitest, weil Around the World kann man eigentlich eh immer Meetings machen. Hast du da irgendwie ein fixes Regelwerk?"
    },
    {
      "end": 2005790,
      "speaker": "A",
      "start": 1969210,
      "text": "Ich habe kein fixes Regelwerk, ich habe aber etwas gebraucht, um mich daran zu gewöhnen. Also als ich den Job begonnen habe, bin ich recht früh aufgestanden und habe viele Meetings auch frühzeitig gemacht. Besonders wenn es um die Winter und Sommerzeit Umstellung geht, muss man das ein bisschen tun, so dass man noch ein paar Stunden Überlappung mit zum Beispiel einem asiatischen Team hat. Für Europäer ist es dann meist die Abendüberlappung, wenn es dann Richtung Amerika geht. Inzwischen habe ich da so zwei Modi gefunden. Auf der einen Seite sage Nein, ich nehme keine Meetings um zwanzig uhr entgegen oder nein, ich nehme keine Meetings um vier uhr nachts entgegen."
    },
    {
      "end": 2009980,
      "speaker": "B",
      "start": 2005790,
      "text": "Ja, aber das sagt sich so leicht. Was ist, wenn da dein Chef Chef um die Ecke biegt?"
    },
    {
      "end": 2185360,
      "speaker": "A",
      "start": 2010050,
      "text": "Naja, mein Chef oder mein heißt das, sag ich auch schon. Chef Chef heißt das. Wenn mein Chef oder mein Chef Chef dann fragt hey, das ist ein wichtiges Meeting, dann gehe ich auch mal die Extra Meile. Das ist gar kein Problem. Wenn das ein sehr wichtiges Meeting ist, dann bin ich auch um zwei und zwanzig uhr da. Aber das ist nicht der Standard, ganz und gar nicht. Und diese Leute respektieren das natürlich auch, weil auch diese Leute haben mich ja eingestellt. Sie wissen, dass ich ja in Europa bin. Sie wissen ja, dass ich aus Deutschland zusammenarbeite. Und in solchen Fällen ist es bei uns zumindest Standard, dass man angefragt wird, hey, wir wissen, das ist außerhalb deiner Arbeitszeiten kannst du es möglich machen. Ich mache es auch gerne möglich. Und ich denke auch, wenn man ein hundert Prozent remote arbeitet und die Möglichkeit hat, an so einer großen Firma zu arbeiten oder in einem weltweiten Team, dass man hier und da auch mal, ich sag mal, die Extrameile gehen muss oder sollte. So denke ich zumindestens, weil jemand gibt dir die Chance. Das heißt aber nicht, dass ich dann an diesem Tag sechzehn Stunden arbeite, sondern ich kompensiere das dann irgendwann entweder zu einem anderen Tag oder an diesem Tag mache ich mittags sehr, sehr lange frei oder ähnliches. Zum Beispiel jetzt morgens arbeite ich sehr viel mit dem asiatischen Raum. In Europa haben wir natürlich auch Softwareentwicklung, aber mit denen habe ich gar nicht so viel zu tun. Und dann so ab fünfzehn, sechzehn uhr kommt dann die amerikanische Seite online. Ab und zu ist es so, ich splitte meinen Tag einfach morgens ein paar Stunden, dann mittags ein größerer Pausenblock und dann irgendwie nachmittags oder abends noch mal ein bisschen. Aber ich nutze in vielen Fällen aber auch die Zeitzonen zu meinem Vorteil, dass ich zum Beispiel die den Mittagsblock für reine Fokuszeit nutze, ziemlich viel geschriebene Dokumente vorbereitet, ziemlich viel Planung mache und so weiter und so fort. Und dann, ich sag mal, schriftliche Übergaben mache, entweder für das asiatische Team oder für das amerikanische Team. Dann machen wir vielleicht noch eine Absprache und dann, wenn ich nächsten Tag online komme, habe ich dann in der Regel schon ein weiteres Arbeitspaket was ich weiterarbeiten kann. Also ich nutze die Zeitzonen zu meinem Vorteil, wo es zumindest möglich ist bezüglich Meetings. Es gibt aber auch etliche Meetings, die werden einfach aufgenommen, die kann ich dann einfach später nachkommen. Also da kam jetzt gerade vor kurzem auch ein guter Artikel von Brandon Greg. Ich weiß nicht, wer ihn kennt, das ist so ein sehr guter Performance Engineer, der sehr lange bei Netflix gearbeitet hat. Brandon hat einen Artikel geschrieben, der nennt sich drei Jahre of Extreme Remote Work Und in diesem Artikel hat er unter anderem mal Statistiken geführt. Inzwischen arbeitet er nicht mehr bei Netflix, sondern bei Intel. Intel ist ja eine amerikanische Firma und er arbeitet aus Australien und inzwischen hat er Statistiken geführt, wie oft er Meetings zu seinen Nachtzeiten geführt hat. Über drei Jahre hat er sieben und siebzig Meetings zwischen ein uhr nachts und sechs uhr morgens wahrgenommen. Ich würde seinem Titel zustimmen, das ist extrem. Also in diesen acht Monaten habe ich bei weitem nicht so viele Meetings, auch nicht runtergebrochen zu einer Zeit wahrgenommen, zu der es mir nicht passt. Aber so extrem würde ich es jetzt nicht verfolgen."
    },
    {
      "end": 2210070,
      "speaker": "B",
      "start": 2185360,
      "text": "Ja, wobei man natürlich schon auch sagen muss, er hat sich das ausgesucht und das ist halt sein Job. Also wenn er das so aussucht, es gibt viele andere Jobs, von Pflege bis zu sonstigen Schichtarbeitern, die alle um diese Uhrzeit arbeiten und wahrscheinlich fünf Prozent von seinem Gehalt bekommen. Also das ist halt seine Wahl und das finde ich jetzt nicht extrem, sondern das hat er so ausgesucht, wenn er in Australien ist. Also das ist keine extra Meile, sondern das ist seine Arbeitszeit."
    },
    {
      "end": 2215660,
      "speaker": "A",
      "start": 2210460,
      "text": "Das ist nicht seine Arbeitszeit. Das sagt er auch in dem Artikel, aber das ist die Arbeitszeit, die er machen muss."
    },
    {
      "end": 2219820,
      "speaker": "B",
      "start": 2215740,
      "text": "Ja, korrekt. Aber weil er sich den Job mit Intel in Amerika ausgesucht hat."
    },
    {
      "end": 2223820,
      "speaker": "A",
      "start": 2219820,
      "text": "Naja, ich glaube Brendan Greg hat aber auch so ein starkes Profil, dass Intel ihn auch haben wollte."
    },
    {
      "end": 2247460,
      "speaker": "B",
      "start": 2223980,
      "text": "Aber das ist genau drum sage ich ja. Also er verdient wahrscheinlich auch ein sehr gutes Gehalt und er hat sich das ausgesucht, dass er diese Arbeitszeiten in Kauf nimmt. Und das ist jetzt keine extreme Work, wo er irgendwie Extremes leisten muss, sondern er hat sich das halt so ausgesucht, weil jemand, der in irgendeiner Schichtarbeit in irgendeiner Fabrik arbeitet, der muss genauso in der Nacht aufstehen und arbeiten."
    },
    {
      "end": 2320130,
      "speaker": "A",
      "start": 2247460,
      "text": "Aber das sage ich ja auch. Ich sage ja auch, dass einen solchen Job, wie ich ihn jetzt gerade tue, ich zumindestens in der näheren Umgebung denke, ich nicht finde oder nicht gefunden habe, vielleicht ist das zweitere besser. Und Brendan Greg als Performance Engineer arbeitet für einen CPU Hersteller oder Chip Hersteller, muss ich zugeben, wird der wahrscheinlich auch ein relativ einzigartiges Environment sein für seine Expertise. Das muss jeder dann für sich entscheiden. Es gibt sehr viele Leute, da würde ich sagen, ihr könnt ein hundert Prozent remote auch für eine deutsche Firma oder eine europäische arbeiten. Das ist alles super, dann seid ihr in der Zeitzone. Ich sage aber auch, es ist unglaublich interessant, auch für sich als Herausforderung zum Selbstmanagement mal für eine weltweit operierende Firma zu arbeiten. Denn du hast ja gerade schon gesagt, man kann eigentlich vier und zwanzig sieben arbeiten und man kann vier und zwanzig sieben in irgendwelchen Meetings beitreten und auch nicht nur Meetings, sondern auch irgendwelchen Engineering Talks und all sowas. Also all diese Knowledge Sharing Sessions, von denen wir hier im Podcast immer reden, gibt es da natürlich auch weltweit rund um die Uhr. Und es ist auch eine Herausforderung, sich selbst auch mal Grenzen zu setzen und diese auch durchzusetzen, weil du hast ja keine andere Wahl. Du musst ja sehr gut in der Selbstorganisation werden und sonst brennst du aus."
    },
    {
      "end": 2331030,
      "speaker": "B",
      "start": 2320210,
      "text": "Es ist eine gewisse Selbstdisziplin vorausgesetzt, würde ich mal sagen. Man kann ja auch in normalen Jobs ausbrennen, also auch da ist die Gefahr hoch und man kann auch dann länger im Office bleiben."
    },
    {
      "end": 2440400,
      "speaker": "A",
      "start": 2331030,
      "text": "Also ich meine, Remote Arbeit eröffnet ja für den Arbeitgeber einen weltweiten Talentpool und hoffen wir mal, dass die Firma dich als Arbeitnehmer gewählt hat, weil du eine gewisse Expertise an den Tisch bringst, an den Tag legst Und natürlich kannst du jetzt dauerhaft arbeiten, zwölf, sechzehn Stunden, aber dann ist die nächste Frage für wie lange? Du weißt auch, irgendwann kommt der Tipping Point und dann geht es leider nur noch steil bergab und dann bringst du gar keine Leistung mehr. Das bedeutet, von dir wird natürlich auch eine gewisse Performance erwartet und auch eine gewisse, auf Englisch würde ich sagen, Maturity, Erwachsenheit, ne, wie nennt man das? Erfahrung. Eine gewisse Erfahrung wird von dir erwartet. Und wenn du nicht in der Lage bist, Grenzen zu setzen und immer nur mehr Projekte aufnimmst, hintendran werden die Projekte eh nicht gemacht, weil du schaffst es ja gar nicht mehr. Also ist der einzige Ausweg, Burnout ist vielleicht dann der schlechtere Ausweg, das ist dann vielleicht, aber den will ja keiner freiwillig, dass du besser in dem Scheduling deiner Termine wirst, dass du dir Blocker reinsetzt, dass du Nein sagst und dass du Grenzen setzt. Vielleicht kann man sogar sagen, ein ein hundert Prozent Remote Job in einer weltweiten Firma ist ein Mittel zum Zweck, dass du dich anpassen musst, weil du es sonst nicht schaffst, weil du einen Treiber brauchst. Genauso wie bei einer Uni Prüfung. Niemand schreibt seine Bachelorarbeit. Oh, in sechs Monaten muss ich meine Bachelorarbeit abgeben. Ja, dann fange ich jetzt mal an. Ich weiß nicht, Wolfgang, wann hast du angefangen? Monat vorher. Wenn du zeitlichen Druck hast oder einen anderen Treiber, wenn du Familie hast, wenn du Kinder hast, dann ist da dein natureller Treiber. Ich sag nur eins, wenn du es nicht tust, arbeitest du sehr viel und du bist sehr müde und dann geht diese ganze Kette los. Du machst vielleicht keinen Sport mehr, nimmst zu, wirst ungesünder, isst vielleicht mal eben was Schnelles vom Subway nebenan und dann rollt die Kette los. Ich habe kein Subway nebenan. Vielleicht ist das mein Glück."
    },
    {
      "end": 2464400,
      "speaker": "B",
      "start": 2440720,
      "text": "Ja, ich würde trotzdem sagen, dass dir das in jedem Job passieren kann. Aber vielleicht, wenn du natürlich ein hundert Prozent remote arbeitest, internationales Umfeld, dass dir das noch mal leichter passieren kann, weil du mehr Möglichkeiten hast, ständig zu arbeiten. Aber grundsätzlich ist es, glaube ich, schon in jeder Firma auch möglich. Und das Problem ist, wenn du nicht aus dem Office nach Hause gehst und einfach bis elf jeden Abend arbeitest, hast du ein ähnliches Problem, Stimme ich dir zu."
    },
    {
      "end": 2475660,
      "speaker": "A",
      "start": 2464560,
      "text": "Besonders wenn du im Büro sitzt und deine Kollegen gehen nach und nach und auf einmal kommt der Hausmeister und macht einen Kontrollgang. Vielleicht denkst du dann mal darüber nach, vielleicht sollte ich mal nach Hause gehen. Zu Hause kommt halt kein Hausmeister vorbei."
    },
    {
      "end": 2503780,
      "speaker": "B",
      "start": 2475660,
      "text": "Jetzt gehen wir mal davon aus, dass du Selbstdisziplin hast und nicht zu viel arbeitest. Wie gehst du denn sicher, dass die Leute trotzdem wissen, dass du Arbeit machst? Gerade wenn es darum geht, vielleicht irgendwie Karriere zu machen, Beförderungen, andere Jobpositionen angeboten zu bekommen In einer klassischen Firma, Du sitzt im Office, die Leute sehen dich um neun am Abend noch arbeiten, denken cool, der macht sehr viel, wird befördert. Wie machst du das dann im Remote Setup?"
    },
    {
      "end": 2523500,
      "speaker": "A",
      "start": 2503780,
      "text": "Ja, das ist richtig. Im Remote Setup wird man fürs LinkedIn und Twitter scrollen dann nicht so, nicht so belobt wie im Büro. Das stimmt schon, denn man sagt ja Out of sight, out of mind. Also wenn du nicht gesehen wirst, bist du einfach nicht in den Köpfen von den Leuten. Und da stellt sich halt schon mal die Frage, okay, beeinflusst das die Karriere positiv oder negativ?"
    },
    {
      "end": 2528700,
      "speaker": "B",
      "start": 2523500,
      "text": "Das heißt, du schickst alle zehn Minuten irgendwo eine Slack Message in irgendwelchen Channels, damit du gesehen wirst."
    },
    {
      "end": 2626240,
      "speaker": "A",
      "start": 2528700,
      "text": "Vier und zwanzig sieben, meine Güte, schläft dieser Mensch eigentlich? Klack, da gibt es auch so Bots inzwischen. Ich bin da vielleicht ein bisschen altmodisch. Auf der einen Seite sage ich, okay, deine Arbeit muss sich zeigen, aber leider zeigt sich gute Arbeit nicht alleine. Also nur gute Arbeit machen bringt nichts, bringt auch im Büro nichts. Da musst du leider auch die Überkommunikation wählen und auch deine Erfolge feiern. Du hast ein Projekt abgeschlossen, ähnlich wie du es einem Lebenslauf machen würdest. Wenn du deinen Lebenslauf aktuell jetzt einmal updaten würdest, dann würdest du auch sagen, okay, du hast Projekt A gemacht und Projekt A hatte als Resultat eine fünf und zwanzig prozentige Kost, Einsparungen in den AWS Kosten oder sowas, also eigentlich datengetriebene Erfolgskriterien von einem Projekt. Und so machst du es natürlich dann auch in Remote. Wir zum Beispiel haben intern eine sehr große Blogging Kultur. Im Wiki hat jedes Team eigentlich seinen eigenen Wiki Space und in diesem Wiki Space gibt es zum Beispiel einen Blog und da werden zum Beispiel Projekte, auch wenn die abgeschlossen sind, immer kommuniziert. Sowas kannst du super machen. Du kannst vielleicht einfach nur die sogenannten kleinen Wins von deinem Team in eurem Department Channel teilen. Das mache ich auch zum Beispiel. Nehmen wir mal an, irgendjemand hat bei einer Investigation festgestellt, dass wir irgendwelche Logs doppelt speichern durch eine Miss Konfiguration. Ist ein cooles Finding. Warum schreibt man sich das nicht auf und teilt das am Ende der Woche einfach in einem Department Channel und dank dieser Person. Also einfach Sichtbarkeit schaffen ist vielleicht jetzt nicht eine Stack Message, jene zehn Minuten, aber Überkommunikation ist notwendig, weil du bist ja nicht sichtbar. Also dein LinkedIn Scrollen im Büro gibt es ja so nicht."
    },
    {
      "end": 2641850,
      "speaker": "B",
      "start": 2626240,
      "text": "Jetzt bist du auch Engineering Manager. Stellst du das in irgendeiner Form für dein Team sicher, dass das Team oder deine Leute gesehen werden? Oder sagst du, das ist schon der Aufgabenbereich von den Leuten selbst und ich erwähne das im One On, aber den Rest müssen schon sie selbst machen."
    },
    {
      "end": 2683910,
      "speaker": "A",
      "start": 2642160,
      "text": "Ich denke, das ist der Aufgabenbereich von den Leuten, aber natürlich helfe ich denen dabei. Nehmen wir mal als Beispiel, wenn mich irgendwie einer aus einer höheren Management Riege oder sowas fragt, wie ist denn der Stand bei diesem Projekt oder das, was wir vorhaben? Dann mache ich in der Regel einen Dreier oder Vierer Chat auf, hol die Person aus meinem Team direkt damit rein und zeigt Sichtbarkeit, also Credits dahin, wohin sie auch wirklich gehören. Denn ich denke immer noch, Engineering Manager ist eine überflüssige Position in einer guten Firma, in einer perfekten Firma, in einer perfekten Welt. Mit einem perfekten Team ist ein Engineering Manager immer nur Overhead, weil jeder Engineer oder jedes Teammitglied Eigeninitiative zeigen kann und die Kommunikation und ihre Wins auch teilen kann."
    },
    {
      "end": 2685750,
      "speaker": "B",
      "start": 2683910,
      "text": "Warum braucht es dich denn überhaupt noch?"
    },
    {
      "end": 2702610,
      "speaker": "A",
      "start": 2686070,
      "text": "Das ist eine sehr gute Frage, weil wir einfach nicht in einer perfekten Organisation, nicht in einer perfekten Welt leben. Wir sind alle unperfekt, wir sind alle Menschen und jeder steckt so tief in seinem Projekt drin und ab und zu brauchst du auch jemanden, der irgendwie das große Ganze sieht. Weiß ich jetzt nicht, ob ich das große Ganze immer im Blick habe und."
    },
    {
      "end": 2704810,
      "speaker": "B",
      "start": 2702610,
      "text": "Das ohne Kaffeemaschinen Chats."
    },
    {
      "end": 2745780,
      "speaker": "A",
      "start": 2704810,
      "text": "Ja, das ist nicht einfach. Aber tue ich das für meine Teammitglieder? Ja, tue ich. Ist denen das immer angenehm, ne, Weil wenn du nämlich auf einmal in einem Chatroom mit dem Chef, Chef Chef bist, dann achten die halt auch schon, oh, was sage ich denn hier, was nicht? Es ist aber auch so, dann sieht der Chef, Chef Chef auf jeden Fall mal den Namen von dieser Person und das, was die Person dann auch leistet. Also ich kriege ja nicht die Credits dafür. Ich mache ja nicht die reale Arbeit. Die Personen machen ja die reale Arbeit. Und das Lustige ist, wenn ich eine Frage krieg und ich bin nicht ein hundert Prozent im Thema, weil wenn du nämlich zwanzig Projekte leitest, dann kannst du nicht ein hundert Prozent im Thema sein. Was würde ich dann machen? Ich würde auch nur zu der Person gehen. Also warum soll ich der Middleman sein, Postbote spielen und die Hälfte der Information sowieso auf dem Weg verlieren."
    },
    {
      "end": 2752400,
      "speaker": "B",
      "start": 2745780,
      "text": "Aber würdest du das nicht in dem Office genauso machen? Würdest du nicht auch in dem Slack Channel das einfach scheren und die Leute mit reinholen?"
    },
    {
      "end": 2785430,
      "speaker": "A",
      "start": 2752870,
      "text": "Würde man im Office einen Select Channel haben? Also ja, ich würde. Moment, also all das, was virtuell stattfindet, würde ich auch so im Büro selbst machen. Die Frage ist aber eigentlich, das ist Ja nicht bürogebunden, sondern was jetzt hier bürogebunden wäre, wäre das Meeting, was du im Raum hast. Dann würdest du die Person vielleicht mal am Tisch holen, dann ist die Person vielleicht gerade mal irgendwie zu Mittag oder holt sich gerade einen Kaffee oder ist rauchen oder ähnliches. Also in einem Remote Setup über Zeitzonen hinweg hast du ja den Vorteil, dass die ganze Sache auch asynchron stattfindet kann, was dann im Büro ja eigentlich nicht so wäre."
    },
    {
      "end": 2799190,
      "speaker": "B",
      "start": 2785510,
      "text": "Ja, wobei du im Office ja genauso Slack Channels hast und wenn du eine größere Firma bist mit ein paar hundert Leuten, dann machst du es vielleicht auch über Slack, weil es einfach einfacher ist, weil die andere Person in einem anderen Gebäude sitzt und jetzt kein extra Meeting oder so aufsetzt."
    },
    {
      "end": 2823720,
      "speaker": "A",
      "start": 2799190,
      "text": "Ja, das ist richtig. Aber im Büro gibt es noch die Möglichkeit, dass du Meetings zusammen hast. Und das ist ja genau das, was ich initial sagte. Im Büro kannst du manche Sachen der Sichtbarkeit, ich sag mal, ausgleichen in einem hundertprozentigen Remote Setup. Nämlich nicht, wenn du öfters spät durchs Büro rennst am Chefbüro vorbei, dann sieht der Chef Ö der Mitarbeiter ist noch da, ich schau mal, wer das ist. Das geht remote technisch ja gar nicht. Das sind so kleine Ausgleichmomente."
    },
    {
      "end": 2832480,
      "speaker": "B",
      "start": 2823720,
      "text": "Da gibt es übrigens sogar eine Studie dazu, dass die Leute, die den Arbeitsplatz in der Nähe vom Chefbüro haben, automatisch eher befördert werden, weil sie mehr gesehen werden."
    },
    {
      "end": 2911380,
      "speaker": "A",
      "start": 2832800,
      "text": "Die kenne ich jetzt nicht, aber kann ich mir vorstellen. Das ist ein menschlicher Bias mit hoher Wahrscheinlichkeit. Aber in einem Remote Setup, wenn du nicht kommunizierst und wenn du dich nicht sichtbar machst, nennen wir es mal, dann bist du eigentlich nur einen Eintrag auf irgendeiner Payroll. Und das ist was ganz anderes, als wenn du ab und zu mal im Büro rumläufst oder ähnliches. So gern ich hätte, dass die Arbeit, die du machst, von selbst, ich sag mal, scheint so funktioniert die Welt leider nicht. Und das hat meines Erachtens nach auch nicht nichts mit Politik zu tun, sondern mit den Führungskräften. Denn die Führungskräfte müssen die Arbeit wertschätzen. Und wenn Person, die die Arbeit gemacht hat, es nicht selbst schafft, dann müssen die Führungskräfte meines Erachtens nach die Arbeit nehmen und Hey, Sabrina, hast du wirklich gut gemacht? Und dann vielleicht auch mal in einem All Hands Meeting oder sowas so Shoutouts machen oder so Kudos oder ähnlich. Natürlich kommt es dann immer darauf an, Eine der Managementfragen, die ich immer stelle, all meinen Mitarbeitern, wenn ich dieser Person Praise geben wollen würde, möchte die Person das in Public oder Private haben? Weil manche Leute mögen das ja nicht beim All Hands Meeting oder sowas sagen, hey Sabrina, hast du super gemacht, dann läuft die vielleicht ganz rot an und möchte das nicht. Sollte man natürlich vorher fragen, aber das ist ja eine leichte Übung."
    },
    {
      "end": 2918980,
      "speaker": "B",
      "start": 2911780,
      "text": "In Episode ein hundert dreizehn haben wir BRAG Documents besprochen. Du bist aber schon noch der Meinung, dass man die auch im Office braucht."
    },
    {
      "end": 3016020,
      "speaker": "A",
      "start": 2919300,
      "text": "Das sollte man sowieso machen, kontinuierlich. Das braucht man auch im Office, weil im Office Spiel menschlicher Bias noch eine viel größere Rolle, weil du da soziale Kontakte viel mehr aufbaust. Beispiel, wenn du und ich den gleichen Fußballverein mögen würden und wir wären Freunde im realen Leben, dann spielt der Bias im Büro eine größere Rolle als bei Remote, Weil natürlich kannst du dich auch über Fußball unterhalten, Remote und so weiter und so fort. Aber diese soziale Interaktion ist halt, ich will mal sagen, minimierter. Wenn du ein hundert Prozent arbeitest. Wenn du Hybrid bist, ist das was anderes. Vielleicht ist das auch so eine Art Schutzmechanismus für ein hundert Prozent Remote, dass du Arbeit in einem professionelleren Kontext siehst. Vielleicht muss nicht immer positiv sein, kann positiv sein. Im Endeffekt denke ich, es kommt auf eine Sache oder es bricht sich auf eine Sache runter in einem Remote Setup. Wenn du ein hundert Prozent remote arbeitest, dann ist die Eigeninitiative, die du an den Tag legen musst, essentiell. Du musst zum Großteil deiner Zeit proaktiv sein. Willst du eine Information haben, dann hol sie dir. Du musst Eigeninitiative zeigen, um das nach vorne zu treiben, an dem, was du da arbeitest. Du kannst dich nicht einfach zurücklehnen und warten, dass dir jemand Arbeit gibt oder dass dir jemand dein Problem ist. Du musst loslaufen, weil keiner weiß, also wenn ich das jetzt sage, dann klingt das komisch. Keiner weiß, dass du existierst. Du sitzt einfach in irgendwelchen Meetings rum und so weiter und so fort. Du musst wirklich proaktiv sein und die Probleme lösen. Meines Erachtens nach. Ein hundert Prozent Remote Arbeiten erfordert deutlich mehr Eigeninitiative und Proaktivität als im Büro."
    },
    {
      "end": 3046290,
      "speaker": "B",
      "start": 3016020,
      "text": "Okay, jetzt hast du da das Idealrezept präsentiert, wie man intern trotzdem wachsen kann in der Firma. Karriere machen kann. Wie sieht es denn übergeordnet aus? Glaubst du, dass Remote Jobs ein negatives Bild machen oder gibt es auch was Negatives nach außen, wenn du jetzt einen neuen Job anfängst und die sehen ein hundert Prozent remote, dass du irgendwie ein komischer Kerl bist, der im Keller wohnt und da nur remote arbeiten bist. Also siehst du auch irgendwelche negativen Punkte, die nach außen strahlen können, wenn du einen Remote Job machst, also einen ein hundert Prozent Remote Job machst?"
    },
    {
      "end": 3051370,
      "speaker": "A",
      "start": 3046370,
      "text": "Sehr gute Frage. Ich bin jetzt noch nicht so alt, als dass ich sagen kann, ich habe eine Karriere gemacht, du bist schon uralt."
    },
    {
      "end": 3053650,
      "speaker": "B",
      "start": 3051370,
      "text": "Bitte jetzt mach den mal nicht jünger als du bist."
    },
    {
      "end": 3094030,
      "speaker": "A",
      "start": 3053810,
      "text": "Also ich glaube, um die Frage zu beantworten, ich glaube, das kommt wirklich auf die Firma drauf an. Ich denke, es gibt Firmen, die du hast jetzt zehn Jahre remote gearbeitet, die stellen wir jetzt nicht ein, zumindest als Manager. Wo ich hingegen aber das Gegenteil sehe, ist, wenn du dich an einer Nische versuchst, global zu positionieren als Experte. Nehmen wir mal Brendan Greg, der ist Performance Engineer, das ist einer der besten Performance Engineers der Welt. Ich gehe stark davon aus, dass er von Remote Arbeiten Vorteil zieht. Oder nehmen wir mal Daniel Stenberg, Autor von Curl. Ich glaube, so viel Arbeit wie der zu Hause kriegt keiner hin. Also ich bin mir nicht sicher, ob der so produktiv im Büro wäre, weil er halt auch schon gewohnt ist, global zu arbeiten durch das Curl Open Source Projekt."
    },
    {
      "end": 3113980,
      "speaker": "B",
      "start": 3094340,
      "text": "Ja, bei Brandon Craig würde man jetzt denken, der glaubt sogar, das ist die Extrameile, nur weil er in meiner Zeitzone meine Arbeitszeiten akzeptiert, obwohl er remote für mich arbeitet. Wobei ich habe diesen Artikel nie gelesen. Also ich basiere jetzt meine Meinung nur auf deinen Erzählungen von seinem Artikel. Also es ist fast stille Post, würde ich mal sagen. Ich tue ihm wahrscheinlich jetzt ganz unrecht."
    },
    {
      "end": 3124780,
      "speaker": "A",
      "start": 3113980,
      "text": "Ja, weil Achtung, er sagt auch never complain about the hours. Also er hat das nie irgendwem vorgehalten, dass er oh, jetzt muss ich schon wieder um zwei Uhr nachts aufstehen."
    },
    {
      "end": 3141060,
      "speaker": "B",
      "start": 3125100,
      "text": "Also ja, für mich ist es einfach, wenn ich so einen Remote Job mache, für eine andere Firma, die in einer anderen Zeitzone arbeitet, muss ich einfach damit rechnen. Und das ist halt dann einfach meine neue Arbeitszeit kann ja auch positiv sein. Der Tag ist dann frei zur Verfügung, wenn ich es schaffe. Mit wenig Schlaf hat man sehr viel Zeit."
    },
    {
      "end": 3151170,
      "speaker": "A",
      "start": 3141060,
      "text": "Vielleicht hatte nicht mit wenig Schlaf zu tun. Du schläfst wahrscheinlich anders. Thema Eule und Lärche, hatten wir ja auch schon mal drüber gesprochen. Ich bin eher morgens aktiv und dafür abends früh müde. Du irgendwie genau andersrum."
    },
    {
      "end": 3156490,
      "speaker": "B",
      "start": 3151170,
      "text": "Hebner Supermorgen aktiv um elf, zwölf kannst du mich schon aktiv haben, gar kein Problem."
    },
    {
      "end": 3159130,
      "speaker": "A",
      "start": 3156570,
      "text": "In deutschen Krankenhäusern gibt es da schon Mittagessen, das ist ja klar."
    },
    {
      "end": 3187170,
      "speaker": "B",
      "start": 3159210,
      "text": "Ja, ich bin mehr so auf der spanischen Seite. Aber wenn wir jetzt gerade bei dem Thema sind, glaubst du, dass es in die andere Richtung negativ sein kann, dass man, wenn man heutzutage noch gar nie remote gearbeitet hat, also jetzt nicht ein hundert Prozent, aber gar keine Remote Erfahrung hat, weil das ja schon, wie wir jetzt auch besprochen haben, ein ganz anderes Arbeiten ist und ich muss vielleicht selbst organisiert sein, muss gewisse Sachen asynchron beherrschen, die ganze Kommunikation, also schon ein anderes Skillset, was man sich da aufbauen muss."
    },
    {
      "end": 3310310,
      "speaker": "A",
      "start": 3187490,
      "text": "Ich denke, dass jeder, der noch nicht remote gearbeitet hat, erst mal in diese Remote Arbeit reinkommen muss. Und das dauert jetzt ein paar Wochen, würde ich sogar sagen, bis Monate, bis du deinen Rhythmus gefunden hast, bis du deine Rituale hast, weil du musst auch einen strukturierten Arbeitsalltag aufbauen. Ich habe doof gesagt, relativ einfache Rituale. Ich mache jeden Tag zumindest morgens und mittags irgendwie das Gleiche, die mir ein bisschen Struktur geben. Das ist die eine Thematik. Aber ich glaube, viele Leute, die in der Corona Pandemie waren, hatten das zumindest so minimal. Ich denke, für Berufs Quereinsteiger kann das ein Problem werden aktuell oder auch für Junioren, die jetzt gerade reinkommen, weil du kennst ja diese ganzen Vorurteile. Der sitzt nur zu Hause, dann saugt er, dann putzt er die Wohn, dann räumt er noch die Spülmaschine, Der ist ja gar nicht produktiv. Und immer wenn ich den anschreibe, dann antwortet der auch gar nicht. Diese Art Kontrolle und so weiter und so fort. Man denkt ja, man arbeitet gar nicht mehr. Ich denke schon, dass man initial beweisen muss, dass man zu Hause auch richtig, richtig produktiv sein kann. Und ich denke auch, und das war bei mir ja auch so initial, dass man sich daran gewöhnen muss und dass man Grenzen setzen muss. Wenn ich arbeite, dann arbeite ich, dann kann ich jetzt hier nicht die ganze Zeit fünf Minuten meinem Hund spielen und so weiter und so fort. Natürlich kann ich das immer mal wieder tun, gar keine Frage. Und das ist ja auch der Vorteil von Remote Arbeit. Aber du musst ja selbst Grenzen, Grenzen setzen, weil du musst ja auch noch was schaffen. Also dich bezahlt ja jemand, um zu arbeiten. Dafür kriegst du ja Geld und nicht dafür, dass du zu Hause deine Wohnung putzt und dein Bett neu beziehst und allem drum und dran oder kontinuierlich dein Auto zur Werkstatt bringst. Sich da selbst Grenzen zu setzen und das auch zu lernen, ich glaube, und sich selbst die Struktur zu schaffen. Ich glaube, das kann schon Nachteil sein, wenn man das noch nie gelernt hat oder wenn man das jetzt alles neu lernen muss, weil wann war die Pandemie? Vor drei, vier, fünf Jahren. Und du sagtest ja auch gerade, dass viele Setups eher hybrid sind. Da würde man ja inzwischen ausgehen, dass jeder das inzwischen gelernt hat, dass wir diese initiale Produktivitätshürde genommen haben. Und wenn du jetzt kommst, du hast das noch nie gemacht. Ich will nicht sagen, dass dir das negativ angehaftet wird, aber es kann schon einen kleinen Hit geben, denke ich. Kannst du es nachvollziehen?"
    },
    {
      "end": 3376200,
      "speaker": "B",
      "start": 3310310,
      "text": "Ja, ich würde in gewisser Weise so ein bisschen als Qualitätssiegel sehen, wenn sich jemand wirklich durchgesetzt hat und wenn sich jemand wirklich bewiesen hat in dieser Remotekultur, dann ist es für mich so ein Qualitätssiegel, dass man eben selbstorganisiert ist, dass man eben diese ganzen Skills in irgendeiner Form gelernt hat. Das finde ich also schon als positives Signal, weil es kann ja auch in der ganz klassischen Nicht Remote Welt im Office genauso umsetzen. Ich würde sogar so weit gehen, wir hatten ja kürzlich gerade diese Episode zu Multitenant, wo wir drüber gesprochen haben, Multitenant ist das bessere Single Tenant, würde ja sogar so die Remote Arbeitsweise ist eigentlich die bessere Office Arbeitsweise, weil alle Dinge, die ich im Remote Setup noch viel intensiver machen muss, die essentiell sind im Remote Setup, diese Überkommunikation, diese asynchrone Kommunikation, dass ich viele Dinge aufschreibe, dass ich alles konkreter vielleicht plane. Die Dinge kann ich ja alle im Office Setup genauso machen und machen dann vielleicht mein Office Setup auch wesentlich effizienter und besser schlussendlich."
    },
    {
      "end": 3422300,
      "speaker": "A",
      "start": 3376280,
      "text": "So habe ich das noch gar nicht gesehen. Klingt aber positiv. Ich muss mal drüber nachdenken, ob ich das so unterschreiben würde. Ein paar Elemente kann ich aber nachvollziehen, die du sagst, nehmen wir mal Meetings. Es ist super einfach, sich in Meetings in einem Remote Setup Kamera aus zurückzulehnen. Oder vielleicht ist man ja gar nicht am Computer, vielleicht macht man da irgendwas anderes. So, dann ist die erste okay, warum bist du denn jetzt überhaupt in diesem Meeting, wenn du Kamera aus hast? Anscheinend partizipierst du ja gar nicht. Dann ist die Frage warum bist du überhaupt hier und warum, wenn du das nur zuhören möchtest? Dann hätte es auch eine E Mail sein können. Und im Büro Setup gibt es das natürlich auch. Du hast ein Meeting mit zehn Leuten, was sowieso schon eigentlich total strange wäre. Ein Meeting mit zehn Leuten und du sitzt in der zweiten Reihe, Arme zusammengeschränkt, lehnt sich zurück und bist eigentlich mit deinem Kopf ganz woanders, aber nicht beim."
    },
    {
      "end": 3428380,
      "speaker": "B",
      "start": 3422300,
      "text": "Meeting oder vom offenen Laptop sitzend. Depend meine Lieblingsteilnehmer in Meetings."
    },
    {
      "end": 3486030,
      "speaker": "A",
      "start": 3429170,
      "text": "Ja, und dann ist ja schon die nächste Frage, da gibt es ja immer diese no Technology Meetings, wo du den Laptop zu Hause lässt. In einem Remote Setup geht es ja nicht, weil du nimmst ja mit Technik. So, das bedeutet, es ist super einfach, während des Meetings was anderes zu machen, im Chat zu gucken, E Mails zu lesen, coden, blablabla. Und du merkst das ja, wenn jemand nicht dabei ist. Ich bin ja auch ehrlich. Es ist super anstrengend, in jedem Meeting die Kamera anzuhaben und voll bei der Sache zu sein und wirklich aktiv ein aktiver Teilnehmer zu sein. Es ist anstrengend, aber wenn du es dreimal hintereinander hast, dann frage ich mich, warum nimmst du dieses Meeting wahr? Aber das macht den Unterschied. Kamera an, aktiv zuhören, teilnehmen. Und jetzt kamst du mit einer Challenger Frage Hör mal, Andy, welche Sachen hast du denn jetzt im Remote Setup vor, in der Episode zu erwähnen, die im Office Setup nicht passieren? Und das ist eine sehr gute Frage, denn auch diese Meeting Participation, von der ich gerade spreche, ich habe das Gefühl, im Office ist das erlaubt."
    },
    {
      "end": 3519440,
      "speaker": "B",
      "start": 3486350,
      "text": "Ich glaube, es ist remote genauso erlaubt. Remote musst du noch mehr Selbstdisziplin haben, um dich nicht ablenken zu lassen, weil der Bildschirm ist automatisch immer offen. Du siehst alle Notifications in dem Meeting kannst du vielleicht den Laptop noch zuklappen und bist weniger abgelenkt. Aber Laptop zuklappen bei einem Online Meeting ist schwierig. Das heißt, du müsstest die Notifications abschalten, aktiv Du musst sie aktiv ausblenden. Also du musst noch mal extremer werden in deinen Habits, würde ich sagen, Remote und online. Und daher auch mein Vergleich, dass es das bessere Office ist, das Remote Setup."
    },
    {
      "end": 3593650,
      "speaker": "A",
      "start": 3519440,
      "text": "Fass dir mal selbst an die Nase und vielleicht du, der uns gerade zuhört, auch, wann war das letzte Meeting, wo du einfach nichts beigetragen hast, wo du dich auch danach gefragt hast, warum war ich eigentlich hier? Und wann war das letzte Meeting, wo du die Kamera aus hattest und jeder hatte das von uns mal. Und für den Meeting Presenter, es ist unglaublich schwer, remote ein Meeting zu leiten mit Engagement. Und es ist total undankbar, ein Meeting zu leiten, wo fünf Leute da sind und niemand sagt was und niemand möchte ein solches Meeting leiten. Aber der Punkt wird kommen, da wirst du ein solches Meeting leiten und der Punkt wird kommen, da wirst du dieselbe Erfahrung haben und wirst sagen, scheiße, habe ich jetzt was falsch gemacht, habe ich was Falsches gesagt? War das alles langweilig? Und das meine ich. Es ist anstrengend, die Kamera anzuhaben. Es ist anstrengend, ein aktiver Teilnehmer am Meeting zu sein, aber jeder wünscht sich das und du wünschst dir das ja auch, wenn du ein solches Meeting leitest. Und das ist genau, wovon ich die ganze Zeit spreche mit dieser Proaktivität. Und du musst Energie an den Tag bringen und du musst aktiv dabei sein. Natürlich hat jeder Mensch mal eine Down Phase, das verstehe ich auch, aber ich habe schon Leute remote gesehen, da ist das dauerhaft der Fall."
    },
    {
      "end": 3627390,
      "speaker": "B",
      "start": 3593730,
      "text": "Jetzt möchte ich abschließend noch auf einen Punkt zurückkommen, den es meiner Meinung nach nur im Remote Setup gibt, und zwar die Isolation. Du hast schon kurz darüber gesprochen, weil das ist eigentlich der einzige Punkt. Um die Isolation muss man sich kümmern, wenn man im Remote Umfeld arbeitet. Im Office ist es einfach schwierig, Da sind immer andere Leute. Also du kannst dich zwar irgendwie mit Noise Cancellation Kopfhörer abschotten, aber du wirst trotzdem irgendwie Kontakt haben. Hast du da etwas gemerkt, dass du etwas aktiv ändern musst in deinem Lebensstil, um nicht die Isolation, um nicht zu isoliert werden, Wie sagt man denn da?"
    },
    {
      "end": 3629750,
      "speaker": "A",
      "start": 3627390,
      "text": "Um nicht Isolation zu spüren, um nicht."
    },
    {
      "end": 3631670,
      "speaker": "B",
      "start": 3629750,
      "text": "Zu vereinsamen, würde ich fast sagen."
    },
    {
      "end": 3669790,
      "speaker": "A",
      "start": 3631670,
      "text": "Ich habe das Glück, ich lebe mit einem Hund und mit meiner Frau hier in dieser Reihenfolge. Ja, beide leben hier, also auch meine Frau. Meine Frau lebt schon länger hier als mein Hund. Das ist korrekt und ich bin auch sehr glücklich, dass ich die habe. Wenn ich hier alleine leben würde, dann kann ich mir schon vorstellen, dass ich mich isoliert fühlen würde. Stell dir mal vor, du hast einen stressigen Arbeitstag, du sitzt die ganze Zeit vor deinem Rechner, arbeitest vielleicht nicht acht Stunden, sondern zehn oder elf. Ich mein, danach musst du sehr wahrscheinlich noch was zu essen kochen, was zu essen besorgen, da bist du auch müde, vielleicht kopftechnisch durch Und dann guckst du Netflix, dann hast du den ganzen Tag eigentlich niemanden gesehen. Und wenn meine Frau jetzt mal zum Beispiel irgendwie eine Woche oder zwei weg."
    },
    {
      "end": 3671470,
      "speaker": "B",
      "start": 3669790,
      "text": "Ist, dann hast du ja noch deinen."
    },
    {
      "end": 3696750,
      "speaker": "A",
      "start": 3671470,
      "text": "Hund, dann habe ich meinen Hund, aber Achtung, der redet jetzt nicht so viel mit mir. So, dann gehe ich mit dem Hund raus und so weiter. Aber du verstehst, also man vereinsamt schon so ein bisschen. Ich kann mir ein hundert Prozent vorstellen, Leute, die alleine wohnen, die ein hundert Prozent remote arbeiten, dass das schwierig ist und dass sie wirklich was ändern müssen. Ich habe jetzt für meinen Teil entdeckt, wenn ich einfach drei, vier Mal die Woche zum Sport gehe, da sehe ich sehr viele Leute, da quatsche ich auch sehr viel. Das gibt mir natürlich auch einen starken Ausgleich."
    },
    {
      "end": 3754890,
      "speaker": "B",
      "start": 3697140,
      "text": "Also ich würde sagen, die privaten Verbindungen sind bei mir auch wichtiger geworden, seitdem mehr remote abläuft und mehr businessorientiert ist. Und ich persönlich finde das eigentlich auch ganz angenehm, weil ja üblicherweise die Freundschaften oder soziale Connections außerhalb des Business Umfelds ja schon die besseren sind im Sinne von tiefergehend, vielleicht auch wertvoller. Und die bekommen dann eigentlich mehr Zeit und mehr Gewicht, als wenn ganz viele Business Connections, die jetzt vielleicht, würde jetzt nicht sagen unbedingt oberflächlicher, aber auf einer anderen Ebene zumindest bei mir stattfinden. Insofern ist es fast eine Verbesserung, aber man darf natürlich das Ganze auch nicht vernachlässigen, weil man muss mehr Zeit auch investieren in diese Dinge. Im Office kommen die automatisch bei der Kaffeemaschine und meistens private Connections muss man eher pflegen, vielleicht Zeit investieren, Sachen organisieren, da muss man noch aktiver werden. Also die fallen nicht passiv über einen Herrn. Und da ist vielleicht noch ein kleiner Unterschied."
    },
    {
      "end": 3781300,
      "speaker": "A",
      "start": 3754970,
      "text": "Bin ich ein hundert Prozent bei dir allein die Frage, hey, hast du mal wieder Zeit, um abends was essen zu gehen oder sowas? Also irgendwann stellt sie dir mal die Frage, Wieso fragst du eigentlich immer, wieso wirst du nie gefragt? Aber das ist auch so ein bisschen diese Proaktivität, von der ich ja auch gesprochen habe. Und machen wir uns mal nichts vor, wenn du proaktiv im Job bist, weil du ein hundert Prozent remote arbeitest, dann ist es ja eine Kleinigkeit. Einfach mal irgendwem eine WhatsApp oder Signal oder Telegram oder vielleicht auch einfach mal anrufen. Also ich meine, das dauert ja keine."
    },
    {
      "end": 3798420,
      "speaker": "B",
      "start": 3781460,
      "text": "Dreiig Sekunden, wobei da auch jede Person einfach anders ist und vielleicht andere Präferenzen hatte. Und manche sind auch froh, wenn sie weniger soziale Connections haben, muss man ja auch dazu sagen. Aber der Unterschied ist, würde ich mal sagen, merkbar zwischen voll remote und einem klassischen Office oder Hybrid Job."
    },
    {
      "end": 3822250,
      "speaker": "A",
      "start": 3798420,
      "text": "Und vielleicht, das habe ich jetzt für mich gemerkt, ab und zu mal Meetup zu besuchen abends ist ja auch schon wieder so eine Art soziale Kontakte. Aber da merke ich auch nach so einem Meetup Abend bin ich dann schon echt müde. Ich weiß nicht, ich muss mal mit einem Psychologen sprechen in Bezug auf, okay, was verändert sich denn da im Gehirn? Weil das würde mich schon mal interessieren, weil irgendwas hat sich verändert. Ich weiß es nicht. Kann auch einfach sein, dass ich älter geworden bin."
    },
    {
      "end": 3841660,
      "speaker": "B",
      "start": 3822250,
      "text": "Ich muss ja zugeben, dass grundsätzlich das Engineering Kiosk Alps Meetup in Innsbruck, dass ich das schon auch irgendwie gestartet habe, um gewisse Connections in der Businesswelt, die ich eben durch den Remote Shop weniger habe, in irgendeiner Form kompensieren kann. Also das war durchaus ein Punkt davon muss ich zugeben."
    },
    {
      "end": 3962490,
      "speaker": "A",
      "start": 3841660,
      "text": "Okay, das Meetup vom Engineering Queues existiert aufgrund von Selbstschutz. Auch interessant. Jetzt ist es aber so, machen wir den Sack mal hier zu, würde ich das wieder tun. Ein hundert Prozent remote arbeiten. Ja, unglaublich interessante Erfahrung, unglaublich viel gelernt. Der ganzen Thematik ist es für jeden was. Ich denke nicht, ich verstehe nicht, warum es der heilige Gral sein sollte. Zumindest in meiner Bubble habe ich so öfter mal das Gefühl, dass sehr viele Leute ein hundert Prozent remote arbeiten wollen. Wolfgang hatte mir im Vorgespräch das Gegenteil behauptet. In seiner Bubble ist es anders. Finde ich auch gut. Ich habe fast das Gefühl, dass es irgendwie sogar ein bisschen anstrengender ist, ein hundert Prozent remote zu arbeiten im Gegensatz zu dem Büro. Manche Leute sagen ja auch, wenn sie ein Hybrid Setup fahren, dass diese Personen oft im Büro dann gar nicht arbeiten, sondern die Zeit im Büro für die sozialen Kontakte und zur Synchronisation nutzen, was ja dann auch Art und Weise in der Arbeit ist. Es wird die ganze Sache dann irgendwie ad absurdum, finde ich aber okay. Aber das bedeutet ja auch, dass die richtige Arbeit dann remote stattfindet und die richtige Arbeit ist ja dann der harte Part, würde man sagen. Und ob man dann jetzt die Vorteile hat, weil man sich dann irgendwie einen Berufsweg oder sowas spart, das kann jeder für sich selbst entscheiden. Es gibt ja Leute mit einem minütigen Weg zur Firma, es gibt ja Leute, die fahren anderthalb Stunden eine Strecke. Also ich glaube, das variiert dann auch. Ich finde es auf jeden Fall sehr interessant. Mir hat es Möglichkeiten ermöglicht, die ich so zuvor noch nicht hatte. Ob man dann Zugriff auf mehr Arbeitgeber hat, weiß ich gar nicht, weil ich glaube, die Industrie geht auch ziemlich viel zu hybrid wieder zurück. Aber ich kann es jedem an Herz legen, mal die ganze Sache auszuprobieren, auf jeden Fall dann später zu sagen, ist was für mich oder nicht. Mich würde auch mal eure Meinung interessieren. Das, was ich jetzt gesagt habe, das kann man natürlich alles aus meiner Erfahrung. Springt doch mal in unsere Discord Community, Link findet ihr in den Shownotes und gebt mir doch mal eure Sichtweise, wie es ist, ein hundert Prozent remote zu arbeiten. Also vielleicht mache ich ja auch was falsch und vielleicht habt ihr ja Lösungen für ein paar Herausforderungen, die ich habe oder vice versa."
    },
    {
      "end": 3987140,
      "speaker": "B",
      "start": 3962490,
      "text": "Ja, dann würde ich sagen, vielen Dank für den Besuch im Engineering Kiosk Podcast. Lieber Andy. Es hat mich sehr gefreut, deine Insights zu hören und deine Einblicke in das volle Remote Setup. Ich bin immer noch der Meinung, remote ist das bessere Office. Klingt sehr komisch, wenn man den Satz so alleine sagt, aber wir haben ihn ja eh schon erörtert. Ich glaube, das wird die erste Episode, wo wir keine Links in den Shownotes haben. Das stimmt nicht."
    },
    {
      "end": 3994100,
      "speaker": "A",
      "start": 3987140,
      "text": "Wir haben den Tillpod sieben und fünfzig, Office ist nicht gleich Office und natürlich auch den Artikel von Brendan Greg in den Shownotes. Könnt ihr auch gerne mal nachlesen."
    },
    {
      "end": 3999580,
      "speaker": "B",
      "start": 3994100,
      "text": "Keine Episode ohne Show Notes. Vielen Dank fürs Zuhören und wir hören uns dann hoffentlich nächste Woche."
    },
    {
      "end": 4000860,
      "speaker": "A",
      "start": 3999580,
      "text": "Danke dir vorbei."
    },
    {
      "end": 4001260,
      "speaker": "B",
      "start": 4000860,
      "text": "Ciao."
    }
  ],
  "webhook_auth": false
}