{
    "acoustic_model": "assemblyai_default",
    "audio_duration": 603,
    "audio_url": "https://cloud.inlupus.at/s/i8XztGXWczpmkKe/download",
    "auto_chapters": false,
    "auto_highlights": false,
    "auto_highlights_result": {},
    "confidence": 0.9616179,
    "content_safety": false,
    "content_safety_labels": {
        "status": "unavailable"
    },
    "custom_topics": false,
    "disfluencies": false,
    "dual_channel": false,
    "entity_detection": true,
    "filter_profanity": false,
    "format_text": false,
    "iab_categories": true,
    "iab_categories_result": {},
    "id": "20f0919f-7ce8-4165-8649-fa04027a5222",
    "language_code": "de",
    "language_detection": false,
    "language_model": "assemblyai_default",
    "punctuate": true,
    "redact_pii": false,
    "redact_pii_audio": false,
    "sentiment_analysis": false,
    "speaker_labels": true,
    "speakers_expected": 4,
    "speed_boost": false,
    "status": "completed",
    "summarization": false,
    "throttled": false,
    "utterances": [
        {
            "end": 53120,
            "speaker": "A",
            "start": 4160,
            "text": "Willkommen zum Engineering Kiosk Adventskalender. Es ist mal wieder Zeit für ein neues Türchen. Und weil Weihnachten natürlich auch das Fest der Liebe genannt wird, dachten wir uns dieses Lass uns doch mal wieder etwas Liebe mit der deutschsprachigen Tech Podcast Szene teilen. Diese Episode ist eine solche Episode und sie kommt nicht von den Standard Engineering Kiosk Hosts Wolfgang oder mir, Mein Name ist Andy, sondern wir lassen uns den Engineering Kiosk mal für einen Tag aus der Hand nehmen. Heute übernimmt ein befreundeter Podcast das Mikro und bringt ihm ein paar neue Perspektiven, ein anderes Thema und vielleicht den ein oder anderen Gedanken, der über unsere eigene Bubble hinausgeht. Wir denken da draußen gibt es großartige Tech Podcasts, die unbedingt mehr Aufmerksamkeit verdienen und wir denken Wissen, Inspiration und gute Geschichten sollte man am besten teilen. Also zurücklehnen, neugierig sein heute mit Tsujivin und Dirk vom Tillpot. Los geht's. Viel Spaß."
        },
        {
            "end": 58430,
            "speaker": "B",
            "start": 54790,
            "text": "Hallo und willkommen bei einer etwas anderen Folge von Tilpot."
        },
        {
            "end": 63510,
            "speaker": "C",
            "start": 58430,
            "text": "Hallo Dirk. Hallo Sujivan. Wer sind wir eigentlich und wenn ja, wie viele?"
        },
        {
            "end": 68430,
            "speaker": "D",
            "start": 64310,
            "text": "Also wir machen den Tilpot seit November zwei tausend zwanzig das heißt, wir sind."
        },
        {
            "end": 71470,
            "speaker": "C",
            "start": 68430,
            "text": "Jetzt fünf Jahre alt. Genau, genau."
        },
        {
            "end": 74470,
            "speaker": "B",
            "start": 71470,
            "text": "Und wir sind ein, man könnte sagen Generationen Podcast."
        },
        {
            "end": 80070,
            "speaker": "D",
            "start": 74470,
            "text": "Ja, genau. Ich bin die Elterngeneration und du bist die Kindgeneration. Jetzt brauchen wir nur noch die Enkelgeneration."
        },
        {
            "end": 81790,
            "speaker": "C",
            "start": 80070,
            "text": "Genau. Genau."
        },
        {
            "end": 85100,
            "speaker": "B",
            "start": 81790,
            "text": "Und wir kommen auch beide aus dem Ruhrpott, zumindest ursprünglich."
        },
        {
            "end": 88570,
            "speaker": "D",
            "start": 86610,
            "text": "Du kommst aus Lateinisch, Castrop Rauxel."
        },
        {
            "end": 91170,
            "speaker": "B",
            "start": 88570,
            "text": "Genau. Und du kommst aus Deutsch von Eickel."
        },
        {
            "end": 94370,
            "speaker": "D",
            "start": 91890,
            "text": "Aber ich sende aus der Schweiz, weil ich dadurch noch ausgewandert bin."
        },
        {
            "end": 112090,
            "speaker": "B",
            "start": 94450,
            "text": "Genau. Wir kennen uns ja schon eine Weile. Wir sind und zwar aus der Open Source Bubble und das soll auch Thema der Folge sein. Kurzer Hintergrund noch zu Wir sind beides Buchautoren und im Endeffekt behandeln wir im TPOD Sachen wie DevOps, Container, Technologien, Technikthemen."
        },
        {
            "end": 113690,
            "speaker": "C",
            "start": 112090,
            "text": "Aber auch nicht Technikthemen."
        },
        {
            "end": 113890,
            "speaker": "D",
            "start": 113690,
            "text": "Genau."
        },
        {
            "end": 120370,
            "speaker": "C",
            "start": 113890,
            "text": "Leadership, Self Improvement, System Engineering und Till steht für Things I learned, eigentlich für."
        },
        {
            "end": 127690,
            "speaker": "D",
            "start": 120370,
            "text": "Today I learned, aber wir sind von einem lieben Kommentatoren aufgefordert von Things I learned nennen zu können oder nennen zu."
        },
        {
            "end": 136850,
            "speaker": "C",
            "start": 127690,
            "text": "Dürfen oder nennen zu müssen. Das dürft ihr schneiden, Wolfgang. Genau."
        },
        {
            "end": 158850,
            "speaker": "B",
            "start": 136850,
            "text": "Gut, wir sind ja in einem Software Engineering Podcast zu Gast und da dachten wir, es ist mal eine gute Möglichkeit, mal nicht über das Engineering von Software direkt zu sprechen, sondern mehr so indirekt. Und zwar wie man bei Open Source Projekten eben mitmachen kann, ohne Code Contribution zu machen, weil weder ich noch du sind großartige Programmierer."
        },
        {
            "end": 175590,
            "speaker": "D",
            "start": 158850,
            "text": "Ich habe schon gesagt, ich bin ein guter Skript, aber ein schlechter Programmierer. Von daher beschränke ich mich auf das Drumherum. Und zum Beispiel kann man in Softwareprojekten Bugs tracken. Also wenn man Fehler findet, wäre es total cool, wenn man die auch meldet, weil wenn andere Leute das Problem auch haben, erhöht das die Wahrscheinlichkeit, dass der Bug auch gefixt wird."
        },
        {
            "end": 175950,
            "speaker": "B",
            "start": 175590,
            "text": "Genau."
        },
        {
            "end": 178030,
            "speaker": "C",
            "start": 175950,
            "text": "Wie oft machst du das, wenn ich einen Fehler finde?"
        },
        {
            "end": 178510,
            "speaker": "D",
            "start": 178030,
            "text": "Eigentlich immer."
        },
        {
            "end": 200290,
            "speaker": "B",
            "start": 178590,
            "text": "Ja, bei mir kommt es ein bisschen darauf an, was das für eine Software auch ist. Also bei größeren oder bei kleineren. Es kommt auch noch mal ein bisschen drauf an, womit ich viel gestartet bin. Waren vor allem Oberbegriff, fragt man das so Support, Foren, Chat, Anwenderunterstützung vielleicht. Genau, weil da gibt es ja auch noch sehr, sehr viele Sachen. Früher waren es halt klassisch Foren, heute sind es eher so Subreddits vielleicht noch oder irgendwelche kruden Discords."
        },
        {
            "end": 208530,
            "speaker": "C",
            "start": 202930,
            "text": "Pan intended, also krudes Discord hat der Engineering Kiosk."
        },
        {
            "end": 222850,
            "speaker": "B",
            "start": 210690,
            "text": "Aber da gibt es auch verschiedene Formen, wie man helfen kann. Das eine ist halt ganz normal auf Englisch, sagen wir jetzt mal, aber es kann ja auch hilfreich sein, mal deutschen nativen Support zu leisten, in welcher Form auch immer, zum Beispiel auf Deutsch oder auf Esperanto oder sowas."
        },
        {
            "end": 228210,
            "speaker": "D",
            "start": 223410,
            "text": "Ich glaube, das darf man nicht vernachlässigen. Viele Leute sind nicht so flüssig in Englisch, wie die Leute, die in der IT arbeiten."
        },
        {
            "end": 231250,
            "speaker": "C",
            "start": 228530,
            "text": "Und selbst in der IT gibt es viele, die nicht so gut in Englisch sind."
        },
        {
            "end": 235130,
            "speaker": "D",
            "start": 231250,
            "text": "Von daher sind die auf nativen Support oder für nativen Support sehr häufig dankbar."
        },
        {
            "end": 248770,
            "speaker": "B",
            "start": 235130,
            "text": "Genau, das kommt ja auch ein bisschen darauf an, was für eine Software das ist. Wir beide kommen ja auch aus der Ubuntu Ecke, aus der deutschen Ubuntu Community, muss man dazu sagen. Und da war eben alles auf Deutsch und für Endanwender, was natürlich was anderes ist, als wenn wir über Kubernetes sprechen."
        },
        {
            "end": 257570,
            "speaker": "D",
            "start": 248930,
            "text": "Ja, genau. Aber der native Support hat sich halt durchgezogen und wir halten auch viele Vorträge oder geben Workshops auch in unserer Muttersprache und nicht in fremden Sprachen, die wir."
        },
        {
            "end": 258450,
            "speaker": "C",
            "start": 257570,
            "text": "Nicht so gut beherrschen."
        },
        {
            "end": 260200,
            "speaker": "D",
            "start": 258690,
            "text": "Und das wird auch dankbar an."
        },
        {
            "end": 278670,
            "speaker": "B",
            "start": 260830,
            "text": "Das ist auch ein guter Punkt, nämlich Vorträge und Blogposts kann man auch eben bei Open Source Projekten gut mitmachen. Da kannten wir uns ja auch durch, nicht nur durch den Ubuntu Kontext, sondern von Task Ware, wo wir beide oder mehr du als ich involviert waren eben genau mit Non Code Contributions."
        },
        {
            "end": 303210,
            "speaker": "D",
            "start": 278670,
            "text": "Genau, dazu kann man dann auch noch sagen, dass sehr häufig fehlt an Event Organizern, also an Leuten, die Events vorbereiten. Also jetzt im Kontext Software Engineering Meetups organisieren oder auf Open Source vielleicht Workshops organisieren oder Workshop Rooms durchplanen. Da kann man Open Source, damit kann man Open Source Software auch unterstützen."
        },
        {
            "end": 317130,
            "speaker": "B",
            "start": 303210,
            "text": "Genau, das darf man auch irgendwie nicht unterschätzen, weil gerade präsent zu sein kann viel ausmachen. Ich habe auch viel Standpersonal, Standbetreuung gemacht, wo Leute halt kommen und einfach nur ihre Sorgen loswerden. Das heißt ja auch schon viel habe ich auch schon gemacht."
        },
        {
            "end": 329220,
            "speaker": "D",
            "start": 317130,
            "text": "Zur Standbetreuung wäre vielleicht zu sagen, dass es sehr, sehr cool wäre, wenn man sich vor dem Stand aufhält, hinter dem Stand, hinter dem Notebook sitzt und so aussieht, als würde man nicht angesprochen werden wollen, weil dann braucht man auch keine Standbetreuung machen."
        },
        {
            "end": 349700,
            "speaker": "B",
            "start": 330260,
            "text": "Genau, Events organisieren kann man natürlich vor Ort machen, da ist natürlich ein gewisser Teil. Es gibt aber natürlich auch viele Sachen, Remote Sachen, die man machen kann, sollte man auch nicht unterschätzen, weil manchmal gibt es ja auch je nach Projekt so Office Hours oder sowas, wo man Fragen stellen kann und sonst so, einfach um die Eintrittshürde auch für bestimmte Leute auch niedriger zu setzen."
        },
        {
            "end": 364960,
            "speaker": "D",
            "start": 350120,
            "text": "Ja, das haben wir auch schon gemacht. Jetzt nach Corona ist ja jeder einigermaßen fit darin, von zu Hause aus an irgendwelchen Videokonferenzen oder Webmeetings teilzunehmen. Die brauchen auch Organisationen, die brauchen Programm und das hilft dem Open Source Projekt, dass man unterstützen möchte natürlich auch."
        },
        {
            "end": 377000,
            "speaker": "B",
            "start": 364960,
            "text": "Jetzt haben wir eigentlich ja schon diverse Sachen abgedeckt, Backtracking, Support, Foren, Chats, Vorträge und Blogposts, Dokumentation und Events. Hast du noch einen weiteren Punkt, der vielleicht mal außerhalb der Rallye ist?"
        },
        {
            "end": 399330,
            "speaker": "D",
            "start": 377080,
            "text": "Ja, habe ich total. Also als die openrhein Ruhr noch da war, hat die Birgit, die dort häufig vor Ort war, die hat Stricktuxe gemacht, die hat ein Strickmuster gehabt, mit dem man einen Tux, also einen Linux Pinguin stricken konnte und hat den da mit den Leuten zusammengestrickt und hat das Strickmuster zur Verfügung gestellt und man konnte sie auch bei ihr sogar käuflich erwerben, das weiß ich gerade nicht. Und hat damit natürlich auch die damalige Open Rhein Ruhr unterstützt."
        },
        {
            "end": 403650,
            "speaker": "B",
            "start": 399330,
            "text": "Das ist echt eine coole Idee und das bleibt halt auch hängen. Das muss man auch dazu sagen."
        },
        {
            "end": 419210,
            "speaker": "D",
            "start": 403650,
            "text": "Ja, und wo wir gerade dabei sind, was wir jetzt in unserem Skript hier nicht haben, ist, wisst ihr eigentlich, wie wenig Fotos es von Veranstaltungen gibt? Wie wäre es eigentlich, wenn ihr mal einfach euer Handy zückt und Fotos von der Veranstaltung macht und das zu irgendeinem Bilderdienst hochladet und später zur Dokumentation des Events beitragt."
        },
        {
            "end": 422250,
            "speaker": "B",
            "start": 419290,
            "text": "Natürlich die Leute fragen, ob man fotografiert werden möchte."
        },
        {
            "end": 424010,
            "speaker": "C",
            "start": 422330,
            "text": "Unbedingt. Unbedingt, genau."
        },
        {
            "end": 447430,
            "speaker": "B",
            "start": 424010,
            "text": "Genau. Alles, was wir jetzt genannt hatten, waren im Endeffekt Non Code Contributions. Aber auch für Sachen wie Bugs oder Support oder auch Dokumentation, die zusammenhängen, gibt es auch diverse Sachen, die wofür Technikkenntnisse natürlich hilfreich sind. Je mehr man machen kann, desto besser. Und im Endeffekt wollen wir nur noch mal so sagen, ja, Git können kann schon ganz gut sein."
        },
        {
            "end": 462790,
            "speaker": "D",
            "start": 447670,
            "text": "Genau. Und zusätzlich zu Git kann man sich auch die drei großen Plattformen angucken, die Git Repositories anbieten, also GitHub, GitLab und codework beispielsweise. Und sich da ein bisschen zurechtzufinden, um auch Issues aufzumachen oder auch auf Issues zu reagieren, ist bestimmt kein Fehler."
        },
        {
            "end": 481490,
            "speaker": "B",
            "start": 462870,
            "text": "Was man dann ja auch eben angucken kann, ist sowas wie CI, CD Pipelines oder sonst was. Wenn es kleinere, auch größere Projekte sind, wo Scripting Kenntnisse hilfreich praktisch sind, wenn man kein großer Coder ist, also für so Leute wie dich und mich, kann man da natürlich auch nochmal diverse Sachen automatisieren helfen, ohne jetzt am Projekt selbst großartig mitarbeiten zu müssen."
        },
        {
            "end": 497360,
            "speaker": "D",
            "start": 481650,
            "text": "Generell, wir haben es jetzt nicht explizit erwähnt, aber Technikkenntnisse helfen natürlich schon. Man kann ja auch die Infrastruktur hosten oder mit betreiben und solche Sachen. Aber wir wollten uns gerade mal eben plus minus darauf beschränken, Non Coding und Non Technical Contributions to oder zu Open Source Projekten zu nennen."
        },
        {
            "end": 514480,
            "speaker": "B",
            "start": 497360,
            "text": "Aber wie es so ist, die Grenze ist schwimmend. Wie nennt man das? Fließend, fließend, schwimmen sind doch alles bürgerliche Kategorien. Genau. Und das war's, glaube ich. Effektiv haben wir was vergessen."
        },
        {
            "end": 525180,
            "speaker": "D",
            "start": 514560,
            "text": "Nein, im großen Ganzen tue Gutes und rede darüber. Wenn du eine Software gut findest, empfiehlt sie doch auch anderen Leuten. Das hilft dem Projekt auch. Das ist das Kleinste, was man tun kann, um Open Source Projekt zu unterstützen."
        },
        {
            "end": 530460,
            "speaker": "B",
            "start": 525180,
            "text": "Genau. Es können auch schlimme Sachen passieren, so dass man gute Leute kennenlernt, die man eigentlich gar nicht mag, so wie ich dich."
        },
        {
            "end": 544940,
            "speaker": "D",
            "start": 531820,
            "text": "Genau, der Podcast ist eigentlich ein einziger Hass Podcast, den wir da zusammen haben, aber das müsst ihr euch selber anhören. Zum Beispiel wie man, auch da werden wir darüber sprechen, wie man Open Source oder Innersource in Unternehmen machen kann und nach vorne treiben kann."
        },
        {
            "end": 554310,
            "speaker": "B",
            "start": 545180,
            "text": "Genau, das sollten wir nämlich dann mal in der nächsten oder einer der nächsten Folgen von Tilpot entsprechend mal mit behandeln. Und in dem Sinne, danke fürs Zuhören."
        },
        {
            "end": 557030,
            "speaker": "C",
            "start": 554310,
            "text": "Happy Weihnachten und guten Rutsch. Tschüss."
        },
        {
            "end": 576150,
            "speaker": "A",
            "start": 557190,
            "text": "Tschüss, Hier ist wieder Andi vom Engineering Kiosk. Das war es auch schon wieder mit dem heutigen Adventskalendertürchen, präsentiert von unseren Freunden aus der deutschsprachigen Tech Podcast Szene. Wenn dir gefallen hat, was du gehört hast, hör unbedingt doch mal dort rein. Supportet die Leute, die gute Inhalte machen. Die Links zum Episodenthema, aber auch zu dem Podcast findet ihr natürlich wie immer."
        },
        {
            "end": 576990,
            "speaker": "C",
            "start": 576150,
            "text": "In den Show Notes."
        },
        {
            "end": 596710,
            "speaker": "A",
            "start": 576990,
            "text": "Und wenn du Lust hast, dich mit ganz vielen Gleichgesinnten auszutauschen, schau doch mal in unserer Engineering Kiosk Discord Community vorbei. Dort hängen Entwickler und Entwicklerinnen, Architektinnen, Datenmenschen und Tech Nerds aller Art rum, genau wie du, genau wie Wolfgang, genauso wie ich. Ihr wisst schon, was wir meinen. Wir hören uns bei der nächsten Episode wieder. Bis dahin, frohe Weihnachten und eine wunderbare Adventszeit."
        },
        {
            "end": 597310,
            "speaker": "B",
            "start": 596710,
            "text": "Bis bald."
        }
    ],
    "webhook_auth": false
}