{
    "acoustic_model": "assemblyai_default",
    "audio_duration": 872,
    "audio_url": "https://cloud.inlupus.at/s/bykYNLHAfTbwYJP/download",
    "auto_chapters": false,
    "auto_highlights": false,
    "auto_highlights_result": {},
    "confidence": 0.9595962,
    "content_safety": false,
    "content_safety_labels": {
        "status": "unavailable"
    },
    "custom_topics": false,
    "disfluencies": false,
    "dual_channel": false,
    "entity_detection": true,
    "filter_profanity": false,
    "format_text": false,
    "iab_categories": true,
    "iab_categories_result": {},
    "id": "923df9ec-e556-440e-bb2b-a60686d9e61a",
    "language_code": "de",
    "language_detection": false,
    "language_model": "assemblyai_default",
    "punctuate": true,
    "redact_pii": false,
    "redact_pii_audio": false,
    "sentiment_analysis": false,
    "speaker_labels": true,
    "speakers_expected": 2,
    "speed_boost": false,
    "status": "completed",
    "summarization": false,
    "throttled": false,
    "utterances": [
        {
            "end": 14640,
            "speaker": "A",
            "start": 6560,
            "text": "Du bist hier im Engineering Kiosk gelandet und zwar im Engineering Kiosk Adventskalender. Leider hat dieser Kalender nichts mit Schokolade zu tun."
        },
        {
            "end": 16399,
            "speaker": "B",
            "start": 14960,
            "text": "Doof finde ich auch."
        },
        {
            "end": 32050,
            "speaker": "A",
            "start": 16400,
            "text": "Na gut, machst du nix. Als Alternative bieten wir ein wenig Wissen an. Ein Thema kurz und knapp in ein paar Minuten und das Ganze bis Heiligabend. Präsentiert von Knecht Ruprecht und Krampus. Ach scheiße falsche Zeile. Präsentiert von Wolfi. Los geht's."
        },
        {
            "end": 32530,
            "speaker": "B",
            "start": 32050,
            "text": "Viel Spaß."
        },
        {
            "end": 839040,
            "speaker": "B",
            "start": 34850,
            "text": "So, wer war von euch heute schon mal auf Hacker News? Wenn nicht, kann ich das nur schwer News y Combinator Com und dort mal in die Show Kategorie zu schauen, denn dort findet man wirklich die absolut neueste Hipster Technologie. Ich persönlich bin ja weniger anfällig, aber es gibt ja durchaus Leute, die da sich ständig herumtreiben und und auch wirklich die neuesten Dinge gerne ausprobieren und dann vielleicht auch in Produktion bringen. Jetzt fragt man sich natürlich, wenn man weniger Erfahrung hat mit Technologien, wie entscheidet man denn, ob eine Technologie eigentlich gut ist? Woher weiß man denn das, ob es jetzt nur ein Hacker News Hype ist oder wirklich eine stabile Technologie, die man wirklich in einem Projekt, das man produktiv bringen will, einsetzen kann? Und genau über eine Hilfestellung möchte ich heute sprechen, die einem bei dieser Entscheidung unterstützt. Und zwar ist es das Tech Radar. Ursprünglich von thoughtworks entwickelt, ist es ja mittlerweile eigentlich ein Standard im Engineering und wird wirklich von ganz vielen Firmen auch eingesetzt. Also Zalando, Porsche, Spotify, alle großen Firmen verwenden dieses Tool in irgendeiner Form, um sich zu koordinieren und eben um den Spagat zu schaffen zwischen dieser Hacker News driven Development Seite und einer fundierten, oldschool langweiligen Technologie Seite. Die Technologie, die wirklich gut funktioniert. Was ist jetzt so ein techradar? Im Prinzip kann man sich das wie ein klassisches Radar vorstellen. Also es gibt Punkte auf diesem Radar. Jeder Punkt ist eine Software, ein Tool oder was so auf Hacker News eben gerade in ist und geschrieben wird oder eben auch vor langer, langer Zeit mal irgendwann auf Hacker News ein Thema war. Und es gibt Quadranten, also thoughtworks hat es damals in vier Quadranten eingeteilt, also so vier Flächen dieses Radar. Dort gibt es Techniken. Weiterer Quadrant ist Tools, Plattformen und der vierte Quadrant ist Sprachen und Frameworks. Jetzt ein Radar kennt man ja diese pulsierenden Ringe, das gibt es natürlich in diesem Radar auch. Und zwar gibt es vier Ringe in dem Tech Radar also in dem Fall vier Ringe, die sie knechten, nicht nur einen. Und diese Ringe beschreiben, wie erwachsen eine Software oder ein Tool ist. Und zwar gibt es vier Ringe. Adopt, Trial, Assess und HOLD. Schauen wir uns das im Detail mal an. Also diese Quadrantentechniken, das sind Methoden, Prozesse, das wäre zum Beispiel Infrastructure as Code, CI, CD Pipelines, Trunk Based Development, also alles, was so auf einem Meta Level sich abspielt. In dem Quadranten Tools haben wir alles, was an Tools so herumschwirrt, also Build Tools, Deployment Tools, Security Tools wäre zum Beispiel jetzt Docker, Grafana, solche Tools, die man da dementsprechend verwenden. In Quadranten Plattformen geht es um diese ganzen Dinge wie Cloud Hosting Provider, Big Data Provider oder Infrastruktur. Also Klassiker wäre dann natürlich AWS, Google, bigquery, Apache, Kafka. Und der letzte Quadrant ist Sprachen und Frameworks. Das ist glaube ich selbsterklärend, also typescript, View, Spring Boot, tensorflow, alles was Sprachen an sich sind, wie Rust und natürlich dann auch komplexere Libraries, Bibliotheken, Frameworks, die man darunter einordnet. Jetzt haben wir die vier Quadranten, die da in einem Kreuz angeordnet sind. Und dann gibt es diese Ringe. Und umso tiefer diese Punkte zum Kern wandern, umso wichtiger, umso erwachsener sind sie. Also ganz außen ist HOLD, was bedeutet abwarten. Das ist so wirklich das Red Light. Also diese Technologie sollte man aktuell nicht verwenden, ist super experimentell und es wird wirklich davon abgeraten, die zu verwenden. Assess beobachten ist also eine neue Technologie. Es gibt noch keinen Proof, sie wurde noch nicht in großen Projekten verwendet, nur in kleinen Projekten. Ist eher so experimentell angesehen, kann man mal in einem Sandbox Projekt verwenden, aber auf keinen Fall in kritischen Projekten. Wenn man noch mehr in die Tiefe wandert, geht man in den Trial Ring. Also man kann das ausprobieren, da wurde schon bewiesen, dass das Ganze funktioniert. In Pilotprojekten hat sich schon bewährt, diese Technologie, aber haben noch ein gewisses Risiko natürlich. Und im Kern, wenn man ganz tief geht, dann hat man Adopt, also einsetzen. Und diese Tools und Software und Methoden, die liefern wirklich Value. Das ist eigentlich ein quasi Standard, das ist eine Recommendation, also es empfiehlt man für neue Projekte in der Firma. Da gibt es vielleicht auch schon Trainings in der Firma, da kann man sich Hilfe holen. Man muss auch gar nicht irgendwie beim Management anfragen, darf ich jetzt diese Technologie verwenden, sondern man kann einfach loslegen. Das ist die Standardtechnologie, die in der Firma eingesetzt wird und unterstützt wird. Und dieses ganze Tech Radar gibt mir dann ein Bild über die Firma oder über einen Markt, was es an Tools gibt und wie erwachsen die eingeschätzt werden in den jeweiligen Bereichen. Und üblicherweise wandert eben ein Tool oder eine Software oder eine Methode von außen nach innen und wird immer wichtiger. Es ist aber auch ein Radar, es ist kein Katalog, das heißt irgendwann verschwinden diese Punkte auch wieder am Radar, weil sonst hätte man da viel zu viele Punkte. Also es ist immer nur ein Augenblick zum Beispiel über ein halbes Jahr oder aktuelles Jahr in der Firma, was wird wirklich eingesetzt und was ist gerade als Experiment vorhanden und wo testet man gerade. Also man kann sich das wirklich als grafisches Bild vorstellen. Meistens gibt es da noch eine Erläuterung dazu, aber sie ist grundsätzlich sehr einfach gehalten, kann man auch ausdrucken. Das ganze wurde erfunden eigentlich in thoughtworks zwei tausend acht in dieser Beratungsfirma, weil der CTO da Rebecca Parson damals ein Tool gefehlt hat, um den Überblick zu bekommen. Also sie hat immer Updates bekommen, sie hat auch so ein Technology Advisory Board gehabt, die sie upgedatet haben, aber es hat ja bisschen so die Übersicht gefehlt bzw. Hat dann Darren Smith die Idee gehabt, diese Updates könnte man ja auch niederschreiben, visualisieren in so einem Tech Radar und thoughtworks ist ja eigentlich auch ziemlich bekannt, dass sie sehr viel nach außen tragen, dass sie sehr transparent sind und darum haben sie zwei tausend zehn auch das ganze veröffentlicht und seitdem gibt es einen halbjährlichen techradar Report, der so einen Snapshot abbildet, also eine Momentaufnahme von dem Markt, Was gibt es für Technologien in den jeweiligen Bereichen, wo ist gerade hippe Technologie, was sollte man ausprobieren, was ist vielversprechend, wo kann man investieren, wo sollte man lieber die Finger davon lassen. Also all das kommt in dem Report vor. Es gibt ein paar Seiten, da gibt es auch noch eine Erläuterung dazu zu dem eigentlichen Radarbild und wenn man sich einen schnellen Überblick verschaffen will über aktuelle Technologien, ist es ideal. Und nachdem das so ein ideales Bild ist, haben sich auch viele Firmen überlegt, wir könnten das ja auch intern verwenden. Also ich habe schon erwähnt, Zalando war eine der ersten Firmen, die das auch sehr groß announced haben, dass sie das intern verwenden. Die haben das auch publik gemacht. Es gibt auch andere Beratungsfirmen, Adesso zum Beispiel, Software AG, es gibt andere Trend Reports, DB, Systel Digital, Trend Radar oder o'reilly zum Beispiel hat ein Trendradar. Also viele haben das aufgenommen, weil es eben einfach eine superschnelle Visualisierung ist von dem aktuellen Technologiestand. Und als Firma kann ich das natürlich intern nutzen, weil ich mein Portfolio managen kann, also an Technologien, die ich verwende aktuell in der Firma. Das heißt, es gibt automatisch dem Tech Management Informationen in die Hand, die sie verwenden können in der tagtäglichen Entscheidungsfindung. Das Ganze ist natürlich auch ein Kommunikationswerkzeug und Alignment Werkzeug, weil alle Teams wissen natürlich transparent, was wird in der Firma eingesetzt, was darf ich einsetzen. Also es gibt gewisse Leitplanken, an denen ich mich orientieren kann Und auch da wieder, wenn ich jetzt in einer Entscheiderrolle bin oder auch im Team, kann ich sehr schnell entscheiden, was kann ich eigentlich verwenden oder was gibt es in den jeweiligen Quadranten aktuell in der Firma. Das ermöglicht natürlich auch eine gewisse Autonomie. Ich habe schon erwähnt, wenn es in Adopt zum Beispiel drin ist, dann kann ich dieses Ding einfach verwenden und brauche nicht lang herumfragen, ob ich wirklich diese neue Sprache Rust jetzt irgendwo einsetzen darf, sondern wenn die einfach schon etabliert ist bei mir in der Firma, dann ist es ganz klar. Andernfalls wird man dann vielleicht empfohlen nur für einen Testbetrieb, nur für einen kleinen Piloten, aber nicht für ein großes Projekt, was in Produktion gehen soll. Ein anderer großer Vorteil ist, dass es eine methodische Evaluierung ist. Also ich habe einen Prozess, wie kommt denn neue Technologie zu mir in die Firma rein. Also ich starte da mit Proof of Concepts, habe dann Pilotprojekte, habe vielleicht eine RFC Diskussion. Das heißt, es geht nicht darum, wer schreit am lautesten, sondern üblicherweise gibt es einen Prozess, der ist definiert, Ich kann dort Sachen einreichen und jeder weiß in einer Firma, wie man denn mit neuen Technologien umgehen muss, kann, darf und wie man die auch in die Breite bringt. Zusätzlich bietet das Ganze natürlich auch noch einen Vorteil, dass das ein Wissensaustausch ist. Das heißt, ich kann schnell, auch wenn ich mich in einem Bereich nicht so gut auskenne, ich kann reinschauen in das Tech Radar, was gibt es denn in dem jeweiligen Quadranten, was wird bei uns in der Firma verwendet, was darf ich einsetzen, was wird gepflegt, wo finde ich andere Leute, die sich da auch auskennen. Meistens ist da ja kurz beschrieben, wie weit ist die Technologie, was kann ich damit tun? Und wenn ich jetzt diese Momentaufnahme auch noch historisch aufbewahre, was ich ja üblicherweise mache, dann bekomme ich am Ende eine große Datenbank, Zalando nennt es auch techradar Compendium, wo einfach alle Technologien aufgelistet sind, auch historisch, wo ich dann wirklich nachschauen kann, wie haben sich die entwickelt, was gibt es in den jeweiligen Bereichen und welche Technologie macht Sinn bei mir im Team. So ein techradar kann aber auch noch viel mehr bewirken und zwar wird es ganz gern im Recruiting und im Employer Branding verwendet. Das heißt also nicht nur intern in der Firma, sondern auch extern nach außen. Das heißt, ich kann eine gewisse Transparenz nach außen zeigen, also für Kandidat innen zeigen, welche Technologie verwenden wir, wie gehen wir mit Technologie um? Das heißt, ich kann zeigen, wir haben einen professionellen Prozess, wir schauen in die Zukunft, wir evaluieren neue Technologie, wir sind nicht zurückgewandt, sondern wir sind offen für Neues. Und ganz oft bekommt man ja in Interview solche Verwendet ihr schon Rust und wo verwendet ihr Rust? Das kann man jetzt natürlich teilweise schwer beantworten bzw. Man weiß es nicht und der Kandidat, die Kandidatin muss es auch glauben. Wenn es natürlich einen offiziellen transparenten Report gibt, kann man einfach nachschauen, okay, wie weit ist denn Rust schon in dieser Firma? Wie weit ist es eingesetzt? Wird es in der Zukunft eingesetzt? Ist es schon weiter in den Ringen nach innen gewandert? Also will die Firma in Zukunft es einsetzen? Also gerade für die interessierten Kandidat Innen ist es sehr, sehr hilfreich und ganz allgemein Employer Branding nach außen. Das kennen wahrscheinlich viele, wenn man auf einer Tech Konferenz ist und Leute einen Vortrag halten, dann haben die halt meistens ein, zwei Slides über die Firma, von der sie sind, um eben auch Employer Branding zu machen und und eventuell neue Kandidatinnen anzusprechen. Was macht man üblicherweise? Man hat eine Slide, wie toll die Firma ist, wie viel Geld die Firma macht, wie viel User die Firma hat und so weiter. Aber was natürlich bei Tech Leuten noch mehr zieht, wenn man da ein Tech Radar einfach an die Leinwand wirft, Ich kann mit einem Bild Ich bin modern, ich kümmere mich um neue Technologien und gleichzeitig welche Technologien setzen wir ein? Also anstatt zu Das ist unser Tech Tag und dann auflisten Es ist Java, es ist Docker, es ist irgendeine Cloud XY kann man dieses Ding an die Wand werfen, jeder findet vielleicht irgendeine Technologie, die einen interessiert, man hat gleich eine Connection zu dieser Firma und das Ganze macht es natürlich auch viel sympathischer. Also auch da, anstatt dieser klassischen Business Folie, ein Techradar ist ideal und man kann sich immer noch mit so einer Folie abheben von der ganzen Konkurrenz. Wie macht man jetzt so ein Tech Radar? Ist relativ einfach. Thoughtworks bietet sogar ein eigenes Tool an, um so ein Tech Radar zu machen, ist in den Shownotes verlinkt. Aber man kann natürlich auch eine beliebige Open Source Software verwenden. Auch Zalando hat das Ganze mal Open Source gestellt. Ist jetzt alles kein Hexenwerk. Es gibt auch JavaScript Libs, die dann sowas interaktiv im Browser darstellen, weil auf der Webseite macht sich natürlich sowas auch ganz gut. Das heißt, von der technischen Seite ist es kein Problem, Man muss eher dann intern den Prozess aufsetzen, wie gehe ich denn mit neuer Technologie um? Und das ist vielleicht auch ein guter Punkt, wo man dann mit alle Stakeholder diskutieren kann, wie gehen wir denn mit neuer Technologie um und wie sieht unsere Tech Kultur aus? Und mich fragen ja oft Leute, was macht denn eine gute Tech Kultur aus? Und ich würde sagen, ein Tech Radar ist auf jeden Fall ein Zeichen, wenn man das sinnvoll implementiert und auch lebt, dass man eine gute Tech Kultur hat, weil es ist eine professionelle Herangehensweise. Man hat kein Hacker Driven Development, aber man lässt trotzdem neue Technologien zu und hat einen sauberen Prozess, wie man die neuen Technologien einführt Und kostenlos mit dabei ist noch eine einheitliche Kommunikation innerhalb der Firma und auch außerhalb der Firma, wenn es um Employer Branding und Recruiting geht. Und damit hoffe ich, dass es vielleicht dank dir auch noch mehr Tech Radars in Zukunft im Internet geben wird. Bin gerade kürzlich über neues Radar gestolpert. Von der Cloud Native kommt Computation Foundation, die ein Radar anbietet. Über diese ganze CNCF Landscape. Ist natürlich auch verlinkt in den Shownotes. Und damit genießt noch den Dezember, nicht vergessen, ist eine ruhige Zeit."
        },
        {
            "end": 866720,
            "speaker": "A",
            "start": 840320,
            "text": "Danke Wolfi für diese Episode. Das war's für heute von uns. Wenn dir das, was du gehört hast, gefallen hat, würden wir uns natürlich immer über Feedback freuen. Entweder über ein positives Review auf der Podcast Plattform deiner Wahl, einen Daumen hoch auf Social Media oder eine Anekdote in unserer Discord Community. Ich bin mir sicher, du findest schon einen Weg. Wir freuen uns auch, wenn du diesen Podcast abonnierst und einfach bei der nächsten Episode wieder einschaltest. Wir hören uns bald, schöne Weihnachtszeit und Tschüss."
        }
    ],
    "webhook_auth": false
}