{
    "acoustic_model": "assemblyai_default",
    "audio_duration": 742,
    "audio_url": "https://cloud.inlupus.at/s/A2SnQ7APyrbHmag/download",
    "auto_chapters": false,
    "auto_highlights": false,
    "auto_highlights_result": {},
    "confidence": 0.96660644,
    "content_safety": false,
    "content_safety_labels": {
        "status": "unavailable"
    },
    "custom_topics": false,
    "disfluencies": false,
    "entity_detection": true,
    "filter_profanity": false,
    "format_text": false,
    "iab_categories": true,
    "iab_categories_result": {},
    "id": "f82f74cc-bc85-4805-beb7-c888096fadf6",
    "language_code": "de",
    "language_detection": false,
    "language_model": "assemblyai_default",
    "punctuate": true,
    "redact_pii": false,
    "redact_pii_audio": false,
    "sentiment_analysis": false,
    "speaker_labels": true,
    "speakers_expected": 4,
    "speed_boost": false,
    "status": "completed",
    "summarization": false,
    "throttled": false,
    "utterances": [
        {
            "end": 53140,
            "speaker": "A",
            "start": 3760,
            "text": "Willkommen zum Engineering Kiosk Adventskalender. Es ist mal wieder Zeit für ein neues Türchen. Und weil Weihnachten natürlich auch das Fest der Liebe genannt wird, dachten wir uns dieses Lass uns doch mal wieder etwas Liebe mit der deutschsprachigen Tech Podcast Szene teilen. Diese Episode ist eine solche Episode und sie kommt nicht von den Standard Engineering Kiosk Hosts Wolfgang oder mir. Mein Name ist Andi, sondern wir lassen uns den Engineering Kiosk mal für einen Tag aus der Hand nehmen. Heute übernimmt ein befreundeter Podcast das Mikro und bringt ihm ein paar neue Perspektiven, ein anderes Thema und vielleicht den ein oder anderen Gedanken, der über unsere eigene Bubble hinausgeht. Wir denken da draußen gibt es großartige Tech Podcasts, die unbedingt mehr Aufmerksamkeit verdienen und wir denken Wissen, Inspiration und gute Geschichten sollte man am besten teilen. Also zurücklehnen, neugierig sein. Heute mit Stefan und Sven vom Zero Day Podcast. Los geht's, viel Spaß."
        },
        {
            "end": 64640,
            "speaker": "B",
            "start": 60880,
            "text": "Zero Day der Podcast für Informationssicherheit und Datenschutz."
        },
        {
            "end": 87680,
            "speaker": "B",
            "start": 75040,
            "text": "Einmal im Monat und manchmal auch für eine individuelle Adventsfolge setzen sich der Stefan und der Sven zusammen, um aktuelle News und allgemeine Themen rund um IT Security und Privacy zu reden. Hallo Stefan."
        },
        {
            "end": 88320,
            "speaker": "C",
            "start": 87680,
            "text": "Hi Sven."
        },
        {
            "end": 107100,
            "speaker": "B",
            "start": 105740,
            "text": "Das war schon mal die erste Minute."
        },
        {
            "end": 119670,
            "speaker": "C",
            "start": 107740,
            "text": "Immerhin. Einen wunderschönen guten Morgen, einen wunderschönen guten Abend, einen wunderschönen gute Nacht. Wann immer ihr uns auch gerade hört in dieser wunderbaren Adventszeit, in diesem wunderbaren Adventskalender. Ich bin der Stefan, da drüben sitzt der Sven. Hi Sven."
        },
        {
            "end": 120790,
            "speaker": "B",
            "start": 119750,
            "text": "Hi Stefan."
        },
        {
            "end": 121910,
            "speaker": "C",
            "start": 121030,
            "text": "Was machen wir hier?"
        },
        {
            "end": 163950,
            "speaker": "B",
            "start": 121910,
            "text": "Ja, wir sind der Zero Day Podcast. Wir berichten seit neun Jahren und über ein hundert folgen mittlerweile über Themen aus IT Security, Datenschutz, manchmal auch so Technik allgemein. Wir sind ein nicht kommerzielles Projekt. Wir machen das als Hobby, weil uns das Thema interessiert, weil wir Spaß dran haben und weil es mittlerweile zu unserem gemeinsamen Hobby geworden ist. Und wir versuchen euch mit aktuellen News auf dem Laufenden zu halten. Dinge, die vielleicht nicht so die große Runde in der Presse gemacht haben, aber trotzdem interessant sind und haben auch in jeder Folge ein Thema, mit dem wir uns halt etwas intensiver beschäftigen. Und ja, warum meinen wir was dazu sagen zu können, Stefan?"
        },
        {
            "end": 191930,
            "speaker": "C",
            "start": 164430,
            "text": "Warum wir meinen, etwas dazu sagen zu können? Vielleicht weil wir beide seit, also kombiniert glaube ich locker dreiig vierzig Jahren, fünfzig Jahre. Also wenn wir uns beide zusammenrechnen, kommen wir locker wahrscheinlich auf sechzig Jahre Erfahrung in der IT Security, haben zwangsläufig weil wir unser Leben lang schon mit IT rummachen. Mein erster Rechner war ein C, mein erstes Programm habe ich geschrieben, da konnte ich noch nicht mal wirklich schreiben, wenn man ehrlich ist."
        },
        {
            "end": 197210,
            "speaker": "D",
            "start": 192010,
            "text": "Ja, wenn du da anfängst, dann kommt das mit den sechzig Jahren wahrscheinlich sogar hin. Mein erster war auch ein C und."
        },
        {
            "end": 209350,
            "speaker": "C",
            "start": 197850,
            "text": "Von daher, wir haben sehr viel Erfahrung, aber wir haben auch sehr viel Motivation, immer noch tatsächlich uns den Themen anzunehmen, wobei wir Themen wählen, an denen wir existieren, explizit Interesse haben."
        },
        {
            "end": 210190,
            "speaker": "D",
            "start": 209430,
            "text": "Ja, genau."
        },
        {
            "end": 238390,
            "speaker": "B",
            "start": 210190,
            "text": "Das ist das Schöne an einem Hobby Podcast. Wir freuen uns natürlich, wenn wir eine größere Reichweite haben, aber in erster Linie machen wir das, weil wir da Bock zu haben und nehmen die Themen, die halt auch uns interessieren, wo wir halt was dazulernen wollen. Mittlerweile haben wir auch beide einen beruflichen Hintergrund in dem Bereich. Du bist da wieder so ein bisschen raus, aber mit deiner Qualitätssicherung bist du trotzdem noch zumindest so ein bisschen im Hacking Bereich unterwegs und Sicherheitslücken oder zumindest Fehler in Programmen finden."
        },
        {
            "end": 257250,
            "speaker": "C",
            "start": 238470,
            "text": "Auch im Bereich Datenschutz bin ich zwangsläuf noch durch die Qualitätssicherung unterwegs, weil Testdaten sollten niemals Realdaten sein und es gibt auch durchaus ab und zu mal Systeme, die geprüft werden müssen, wo du die Anforderung hast, dass die Testdaten, die du generierst, bestimmte Kriterien nicht erfüllen dürfen, weil diese zu nah an der Realität wieder dran sind."
        },
        {
            "end": 270370,
            "speaker": "B",
            "start": 257730,
            "text": "Naja, ich bin mittlerweile seit zehn Jahren Cyber Security Consultant, habe also vor zehn Jahren auch mein Hobby zum Beruf gemacht. Ist nicht immer eine gute Idee, aber in meinem Fall klappt das recht gut."
        },
        {
            "end": 315010,
            "speaker": "B",
            "start": 272190,
            "text": "Insofern meinen wir ein bisschen Wissen da zu haben und wir wollen mit unserem Podcast, der richtet sich vor allen Dingen auch an Privatanwender in erster Linie. Ich meine, ich habe auch mal ein Thema ISO sieben und zwanzig tausend eins gemacht, aber in erster Linie haben wir viele Folgen, wo es darum geht, wie surft man sicher im Netz, wie kann man sein Heimnetz absichern. Am Anfang hatten wir auch ganz viele Grundlagen, Sachen, was ist ein Router und so weiter, wie funktioniert WLAN. Mittlerweile setzen wir bei unseren Hörern so ein bisschen technisches Verständnis voraus, dass wir am Anfang immer noch den Anspruch hatten, alles zu erklären, was wir an Fremdwörtern sagen. Mittlerweile gehen wir davon aus, dass unsere langjährigen Hörer zumindest auch ein bisschen wissen, wovon wir reden und wir nicht mehr."
        },
        {
            "end": 317250,
            "speaker": "D",
            "start": 315010,
            "text": "Alles bis ins kleinste Detail erklären müssen."
        },
        {
            "end": 328050,
            "speaker": "C",
            "start": 317490,
            "text": "Ich meine, das bringt uns auch noch zu unserem nächsten Punkt, den wir haben, nämlich warum zum Henker tun wir den ganzen Kram oder warum nimmt man sich überhaupt so ein trockenes, wenn man ehrlich ist, IT Security, komplett trockenes Thema IT."
        },
        {
            "end": 331950,
            "speaker": "B",
            "start": 328050,
            "text": "Security, Datenschutz, sorry, Thema Datenschutz."
        },
        {
            "end": 339950,
            "speaker": "C",
            "start": 332830,
            "text": "Wenn du in einer Besprechung sitzt, wo es um irgendein Thema geht und du willst das so richtig bomben lassen, erwähne Datenschutz."
        },
        {
            "end": 346910,
            "speaker": "C",
            "start": 341710,
            "text": "Frag einfach danach, ob die Datenschutzrisikoabwägungen auch gemacht wurden. Reicht völlig hin."
        },
        {
            "end": 466430,
            "speaker": "B",
            "start": 347070,
            "text": "Man muss auch sagen, wir betrachten Datenschutz jetzt nicht so als juristisches Thema. Das ist auch etwas, was mich in zunehmendem Maße in IT Security, aber auch vor allen Dingen auch im Datenschutz stört. Datenschutz geht bei mir so um dieses grundsätzliche Verständnis, meine Daten, ich will nicht, dass sie überall verkauft, getrackt und sonst was werden. Und mehr aus diesem Aspekt betrachten wir das, als dass wir jetzt mit der DSGVO argumentieren, warum irgendeine Aktion jetzt nicht gesetzeskonform gewesen wäre bei der IT Security, auch wo in zunehmendem Maße mit der NIS oder anderen Gesetzgebungen argumentiert wird. Also ich muss sagen, ich weiß ziemlich genau, warum ich in dieses Loch gefallen bin mit der IT Security. Das hatte so zwei Punkte in meinem Leben, die mich damit zusammengebracht haben. Der eine war, ich hatte so um die Jahrtausendwende rum eine private Webseite, das war ein Motorradforum für unsere Region hier um Braunschweig rum mit wenigen hundert Benutzern. Ich hatte da so eine Portalsoftware installiert, die es fertig gab als Open Source, hab die aber heftigst angepasst an meine Bedürfnisse und konnte sie deswegen auch irgendwann nicht mehr aktualisieren, weil dann alle meine Anpassungen weg gewesen wären. Und das ging eine Zeit lang gut und dann irgendwann hat sich mein Provider bei mir gemeldet, da sind böse Seiten auf deinem Server, mach mal was dagegen. Und dann habe ich halt gemerkt, dass mit zunehmendem Alter der Software Schwachstellen bekannt geworden sind, es auch kriminelle Hacker sich zunutze gemacht haben, um da reinzugehen. Ich meine, die suchen sich ja nicht aus, ich will jetzt dieses Motorradforum hacken, sondern die suchen im Internet, welche Webseiten haben Schwachstellen, die ich kenne und ausnutzen kann. Da war ich dann halt immer gleich vorne dabei. Und dann wurden in Bereichen meiner Webseite Phishing Seiten installiert für paypal und andere Systeme. Das waren ganz einfache Phishing Seiten, die einfach die Formularinhalte dann per Mail an."
        },
        {
            "end": 467790,
            "speaker": "D",
            "start": 466430,
            "text": "Den Angreifer gesendet haben."
        },
        {
            "end": 476510,
            "speaker": "B",
            "start": 467870,
            "text": "Irgendwann wurden diese Mailadressen von den Angreifern abgeschaltet und ich bekam die dann gebounced auf meinen Admin Account und habe mich immer gewundert, warum da so viele Paypal."
        },
        {
            "end": 478990,
            "speaker": "D",
            "start": 476590,
            "text": "Adressen und Accounts ankommen."
        },
        {
            "end": 495810,
            "speaker": "B",
            "start": 479230,
            "text": "Und so habe ich halt meine erste Lektion gelernt. Kein Ziel ist unwichtig gelöst genug, um nicht gehackt zu werden. Es wird nicht gehackt, weil du so ein interessantes Ziel bist, sondern es wird gehackt, weil du gerade irgendwo eine Tür offen stehen gelassen hast, von denen andere."
        },
        {
            "end": 497290,
            "speaker": "D",
            "start": 495810,
            "text": "Wissen, wie sie da reinkommen."
        },
        {
            "end": 524599,
            "speaker": "B",
            "start": 497850,
            "text": "Das zweite war, als ich noch jung war und wenig Geld hatte, habe ich mir dann auch öfter mal einen Keygen besorgt oder eine Raubkopie von einer Software, die ich haben oder spielen wollte. Und das dümpelte in so einem Archiv bei mir auf der Platte rum. Und einige Jahre später, wenn ich mal einen Virenscanner drüber gemacht habe, neuen Rechner aufgesetzt und so weiter, neue Windows Version, habe ich dann gesehen, wie viel Müll."
        },
        {
            "end": 526439,
            "speaker": "D",
            "start": 524599,
            "text": "Ich mir damit eingefangen habe, wie viel."
        },
        {
            "end": 553770,
            "speaker": "B",
            "start": 526439,
            "text": "Spyware da drin war, wie viel Malware allgemein, hat mich auch davon abgebracht, jemals wieder irgendwelche illegale Software zu benutzen, weil das Risiko einfach zu groß ist. Du bist da in den Händen von Kriminellen und die nutzen das teilweise halt auch aus. Ja, und so bin ich zu dem Thema gekommen. Ich habe es immer noch nicht durchgespielt, deswegen bin ich dabei geblieben. Und es ist halt etwas, wo man ständig was Neues dazulernt. Das ist das Schöne."
        },
        {
            "end": 577540,
            "speaker": "C",
            "start": 554010,
            "text": "Das ist tatsächlich das Schönste daran. Wir hören niemals auf zu lernen. Und das Schönste für mich ist eigentlich, wenn ich heutzutage dann Menschen treffe, die jünger sind als ich und bereits mehr vergessen haben, als ich jemals lernen kann, weil, ne, ehrlich, das ist für mich tatsächlich das Schönste, weil man weiß, okay, das Thema wird niemals aussterben und Leute wie wir werden nie irgendwie ganz verschwinden, auch wenn manchmal versucht, es wird uns ganz gerne in eine Ecke zu drücken, aber ohne Erfolg."
        },
        {
            "end": 584020,
            "speaker": "B",
            "start": 577700,
            "text": "Ja, und bei dir? Was hat dich das Thema gebracht oder warum machst du das hier seit neun Jahren mit mir?"
        },
        {
            "end": 645190,
            "speaker": "C",
            "start": 584660,
            "text": "Vielschichtig, vielschichtig. In Anbetracht dessen, dass gerade die Zeit wegrennt, springe ich kurz durch meine Historie durch. Als Kind wurde mir der folgenschwere Satz gesagt, du darfst alles tun, aber lass dich nicht dabei erwischen. Das kam von meinem Vater. Von meiner Mutter wurde mir gesagt, wenn du das machst und ich dich dabei erwische und dann bitte irgendeine beliebige Aktion da dran packen, hat auch Spuren hinterlassen. Dann sagte mir irgendwann mein Onkel, man könne ja eventuell, wenn man es hinkriegen könnte, über einen gewissen Zaun zu kommen, Geld verdienen. Das hat auch Spuren hinterlassen. Ich habe das Geld verdient tatsächlich. So hat das bei mir angefangen, dass ich quasi angefangen habe, physische Sicherheitsmaßnahmen zu umgehen. Ursprünglich noch für meinen persönlichen Benefit. Wir reden hier von heutzutage ein paar Euro, also kleinere Eurobeträge. Später dann allerdings tatsächlich just for fun, weil es sind die besten Rätsel der Welt. Also für mich Informationssicherheit, physische Sicherheit und auch Datenschutz sind für mich einfach knifflige Rätsel und ich liebe Rätsel über alles."
        },
        {
            "end": 649150,
            "speaker": "B",
            "start": 646030,
            "text": "Du kommst eher so aus der Social Engineering Ecke."
        },
        {
            "end": 654710,
            "speaker": "C",
            "start": 650590,
            "text": "Ich komme eher aus der Social Engineering und Physical Security Ecke."
        },
        {
            "end": 671910,
            "speaker": "B",
            "start": 654710,
            "text": "Ja, mittlerweile, wie gesagt, neun Jahre, ein hundert sieben und zwanzig Folgen haben wir mittlerweile. Wir haben letzten Monat gerade die Millionen Downloads durchbrochen. Es gibt ein gewisses Interesse an dem Thema, das merken wir und das freut uns auch, weil wenn wir es hier nur alleine für uns machen würden, wäre."
        },
        {
            "end": 672780,
            "speaker": "D",
            "start": 671910,
            "text": "Es halt auch ein bisschen doof."
        },
        {
            "end": 696690,
            "speaker": "C",
            "start": 673330,
            "text": "In Anbetracht dessen, dass normale Aufnahmelängen bei uns so zwei bis, naja, drei Stunden plus vielleicht noch ein bisschen gehen, müssen wir uns leider schon an dieser Stelle verabschieden, da wir unsere Zeit wie so oft überschritten und überrissen haben. Wir wünschen euch noch einen wundervollen Jahresabschluss, habt ganz viel Spaß und Freude und hört mal rein bei uns. Bis dann. Ciao."
        },
        {
            "end": 730040,
            "speaker": "A",
            "start": 697970,
            "text": "Hier ist wieder Andy vom engineerq. Das wars auch schon wieder mit dem heutigen Adventskalendertürchen, präsentiert von unseren Freunden aus der deutschsprachigen Tech Podcast Szene. Wenn dir gefallen hat, was du gehört hast, hör unbedingt doch mal dort rein. Supportet die Leute, die gute Inhalte machen. Die Links zum Episodenthema, aber auch zu dem Podcast findet ihr natürlich wie immer in den Shownotes. Und wenn du Lust hast, dich mit ganz vielen Gleichgesinnten auszutauschen, schau doch mal in unserer Engineering Kiosk Discord Community vorbei. Dort hängen Entwickler und Entwicklerinnen, Architektinnen, Datenmenschen und Tech Nerds aller Art rum, genau wie du, genau wie Wolfgang, genauso wie ich."
        },
        {
            "end": 731320,
            "speaker": "D",
            "start": 730040,
            "text": "Ihr wisst schon, was wir meinen."
        },
        {
            "end": 735960,
            "speaker": "A",
            "start": 731320,
            "text": "Wir hören uns bei der nächsten Episode wieder. Bis dahin, frohe Weihnachten und eine wunderbare Adventszeit."
        },
        {
            "end": 736560,
            "speaker": "C",
            "start": 735960,
            "text": "Bis bald."
        }
    ],
    "webhook_auth": false
}