{
  "acoustic_model": "assemblyai_default",
  "audio_duration": 4584,
  "audio_url": "https://cloud.inlupus.at/s/rkDEGrRHm3pMGg2/download",
  "auto_chapters": false,
  "auto_highlights": false,
  "auto_highlights_result": {},
  "confidence": 0.9642523,
  "content_safety": false,
  "content_safety_labels": {
    "status": "unavailable"
  },
  "custom_topics": false,
  "disfluencies": false,
  "entity_detection": true,
  "filter_profanity": false,
  "format_text": false,
  "iab_categories": true,
  "iab_categories_result": {},
  "id": "30c4b640-8be0-4039-988c-29bbf027953a",
  "language_code": "de",
  "language_detection": false,
  "language_model": "assemblyai_default",
  "punctuate": true,
  "redact_pii": false,
  "redact_pii_audio": false,
  "sentiment_analysis": false,
  "speaker_labels": true,
  "speakers_expected": 3,
  "speed_boost": false,
  "status": "completed",
  "summarization": false,
  "throttled": false,
  "utterances": [
    {
      "end": 62070,
      "speaker": "A",
      "start": 3120,
      "text": "Du hast eingeschaltet und bist bei einer weiteren Episode des Engineering Kiosks gelandet. Ein Podcast rund um die Themen Engineering, Kultur, Open Source, Menschen, Technologie und alle anderen Bereiche, die damit in Verbindung stehen. Heute geht es mal um Steuern und andere öffentliche Gelder und um Behörden. Aber wir bleiben bei Software. Wir sprechen mit Johannes von der Free Software Foundation Europe über das Thema Public Money, Public Code. Wirklich, wir stellen die doch nicht ganz so einfache Was ist daran so schwierig, dass öffentlich finanzierte Software und Inhalte für die Allgemeinheit zugänglich gemacht werden sollten, um digitale Souveränität und Gemeinwohl zu fördern? Es geht also um Software, die im Auftrag von Behörden erstellt und auch als Open Source veröffentlicht werden könnte. Es geht um die bevorzugte Nutzung von Open Source Lösungen gegenüber proprietärer Software. Wir sprechen über den aktuellen Stand zu diesem Thema, über Vergabeverfahren, über Erfolgsstorys und welche Lösungen bereits existieren, über bürokratische Hürden und darüber, wie andere Länder in Europa das Ganze handhaben. Los geht's, viel Spaß."
    },
    {
      "end": 77990,
      "speaker": "A",
      "start": 67750,
      "text": "Wir Deutschen sind ja bekannt dafür, dass wir relativ viel meckern und man sagt auch, wenn wir nicht meckern, ist das eigentlich schon ein Kompliment. Ich weiß jetzt gerade nicht, wie es bei den Österreichern ist."
    },
    {
      "end": 79150,
      "speaker": "B",
      "start": 78070,
      "text": "Warst du schon mal in Wien?"
    },
    {
      "end": 87850,
      "speaker": "A",
      "start": 79150,
      "text": "Ich habe immer so Reels auf Instagram gesehen, wenn man da einen Kaffee bestell kriegt man wird man da auch angemoppert, so ähnlich wie in der Düsseldorfer Altstadt, wenn man Kölsch bestellt."
    },
    {
      "end": 90210,
      "speaker": "B",
      "start": 87850,
      "text": "Ja, das solltest du mittlerweile wissen von mir."
    },
    {
      "end": 250690,
      "speaker": "A",
      "start": 90290,
      "text": "Okay, aber ein Thema, worüber Deutsche ziemlich oft irgendwie meckern, ist die Steuern sind zu hoch. Gut, vielleicht ist Populismus oder so. Und Steuern, das ist auch so ein bisschen heute so, ich sag mal, das Thema zumindest am Rande, denn es geht nämlich um Software. Es geht nämlich um Software, die vielleicht auch durch Steuern bezahlt wird. Wenn wir über Software reden, dann kommen wir um Open Source oder Public Code ja eigentlich nicht drumherum. Und ich bin mir ein hundert Prozent sicher, dass ein Großteil der Software, die in Behörden angewandt wird, auch auf Open Source basiert. Deswegen würde ich mich mal aus dem Fenster lehnen und sage, der deutsche Staat und auch der österreichische Staat kann ohne Open Source nicht ordentlich agieren bzw. Die Software kann nicht agieren, die dazu benutzt wird. Dennoch wird sehr viel Spezial Software oder proprietäre Software für Behörden, für Länder und für die Regierung geschrieben. Und da brodelt es bei mir so ein bisschen drin, denn ich sage mir so, ich Zahl Steuern. Ich zahle sie auch gerne, aber ich möchte natürlich auch, dass meine Steuern gut angewandt werden. Und als Informatiker frage ich mich natürlich, warum kann die Software, die ich mitbezahle, nicht auch Open Source? Das Stichwort heißt dazu Public Money Public Code. Und die Kernfrage ist, was ist denn daran so schwierig? Das ist nämlich das Thema dieser Episode. Und weil ich bei weitem nicht in einer Behörde arbeite und der Wolfgang auch nicht, haben wir uns jemanden eingeladen, der sich damit echt schon lange beschäftigt und auf den Konferenzen rumtourt und auch wirklich aktiv involviert ist in der ganzen Thematik. Deswegen herzlich willkommen, Johannes Neder. Hallo Johannes, jetzt habe ich schon gesagt, du beschäftigst dich damit die ganze Zeit und du beschäftigst dich nicht nur beruflich damit, sondern du wohnst auch in der Hauptstadt sozusagen. Kannst du mal kurz rübergehen zum Bundestag und anklopfen. Hey Jungs, was ist denn mal mit Public Money Public Code? Du bist bei der Free Software Foundation Europe aktiv als Senior Project Manager im Bereich Policy. Du bist unter anderem Koordinator der Initiative Public Money Public Code, unter anderem auch für die Webseite publiccode EU. Verlinken wir auch in den Shownotes. Wir haben dich mehr oder weniger gefunden über Konferenz Talks, die du gemacht hast. Da bist du sehr umtrieb. Du hältst Talks zum Thema nachhaltige Beschaffung freier Software, zum Thema Openwashing, proprietäre als freie Software ausgeben. Du hast die Tage auf der frostcon, die Tage gut, auch schon wieder ein halbes Jahr her, ein Resümee über ein hundert Tage schwarz rot gegeben. Also wenn man dich mal googelt, gefühlt dreht sich alles bei dir um freie Software."
    },
    {
      "end": 251650,
      "speaker": "C",
      "start": 251010,
      "text": "Das ist richtig."
    },
    {
      "end": 259250,
      "speaker": "B",
      "start": 252050,
      "text": "Du hast aber noch nie in der Verwaltung gearbeitet, oder? Weil der Andi schon so gesagt hat, wir haben ja noch nie in der Verwaltung gearbeitet oder waren Beamten, du aber auch nicht."
    },
    {
      "end": 276310,
      "speaker": "C",
      "start": 259330,
      "text": "Das klang jetzt ein bisschen so, was Andi anmoderiert hat, aber tatsächlich habe ich auch noch nie in der Verwaltung gearbeitet, habe also nur aus unserer zivilgesellschaftlichen Sicht da ein paar Einblicke mittlerweile gewinnen können, richtig? Na okay. Ich habe mal für einen Bundestagsabgeordneten gearbeitet. Ich weiß nicht, ob das zählt in früherer Zeit."
    },
    {
      "end": 279950,
      "speaker": "B",
      "start": 276310,
      "text": "Dein Background ist auch nicht Informatik, wenn ich das richtig verstehe, oder?"
    },
    {
      "end": 296250,
      "speaker": "C",
      "start": 279950,
      "text": "Ne, ich bin eigentlich Historiker und Germanist, habe aber schon gleich nach dem Studium im Prinzip, habe auch schon meine Abschlussarbeit über Open Access geschrieben, also auch jetzt nicht so ein richtig germanistisches Thema, also freies Publizieren, wissenschaftliches Publizieren und bin dann relativ schnell in der Digitalpolitik gelandet."
    },
    {
      "end": 300170,
      "speaker": "B",
      "start": 296410,
      "text": "Okay, also das Open begleitet dich schon ziemlich lange, wenn ich das richtig verstehe."
    },
    {
      "end": 302090,
      "speaker": "C",
      "start": 300170,
      "text": "Ja, absolut. Genau. Open und frei."
    },
    {
      "end": 315330,
      "speaker": "B",
      "start": 302970,
      "text": "Dann starten wir gleich mal in das Thema rein. Public Money, Public Code. Kannst du mal erklären, was dahintersteckt, was das Ziel ist, was es überhaupt bedeutet, außer dass Andy gerne seine Steuergelder besser angelegt sehen würde?"
    },
    {
      "end": 369100,
      "speaker": "C",
      "start": 315330,
      "text": "Wollen wir noch einen Schritt zurückgehen und erst mal vielleicht noch zwei Sätze zu freier Software sagen, weil das ist ja so die Voraussetzung eigentlich für das, worüber wir sprechen. Also ihr merkt schon, ich spreche gar nicht so gern von Open Source, sondern ich spreche von freier Software. Viele andere sagen dazu Open Source. Das sind eigentlich zwei Begriffe, die das Gleiche meinen. Wir bei der Free Software Foundation Europe legen den Schwerpunkt eher auf die Freiheiten, die man bekommt bei Software, die jeder verwenden, verstehen, analysieren, verbreiten und verbessern darf. Also diese vier verwenden, verstehen, verbreiten, verbessern, das ist Open Source, das ist freie Software. Wir sagen dazu freie Software, was glaube ich ganz wichtig ist, so um ein kleines Missverständnis schon von vornherein auszuräumen. Es geht dabei gar nicht um kommerziell oder nicht kommerziell oder professionell versus ehrenamtliche Software, sondern sowohl Open Source als auch freie Software meint beides das Gleiche, nämlich Software, die diese vier Freiheiten bietet. Und wenn eine von den Freiheiten nicht da ist, dann sagen wir dazu proprietäre Software."
    },
    {
      "end": 438780,
      "speaker": "B",
      "start": 429100,
      "text": "Jetzt hast du kurz professionell und ehrenamtlich gesagt. Also ehrenamtlich kann natürlich auch professionell sein, oder? Also professionell siehst du, als wenn eine Firma dahinter steckt oder wenn die Leute bezahlt werden."
    },
    {
      "end": 449120,
      "speaker": "C",
      "start": 438780,
      "text": "Ganz genau. Aber wie gesagt, diese Unterscheidung spielt gar keine Rolle, sondern es gibt viele, viele Firmen auch die Freisoftware entwickeln und es gibt auch viele Menschen, die das im Ehrenamt machen oder beides Gleichzeitig kommt alles vor."
    },
    {
      "end": 452400,
      "speaker": "A",
      "start": 449280,
      "text": "Aber kann man die Wörter wirklich austauschbar benutzen?"
    },
    {
      "end": 453360,
      "speaker": "C",
      "start": 452560,
      "text": "Absolut, ja."
    },
    {
      "end": 460000,
      "speaker": "A",
      "start": 454080,
      "text": "Warum gibt es dann diese zwei Worte? Also warum gibt es diese? Warum hebt man die mentale Hürde dafür?"
    },
    {
      "end": 498140,
      "speaker": "C",
      "start": 460000,
      "text": "Also freie Software ist der ältere Begriff, den gibt es schon seit mittlerweile über vier. Oh Gott. Also auf jeden Fall schon seit den er Jahren. Irgendwann hat sich dann eine Gruppe von Menschen überlegt, dass es einen Begriff geben sollte, der also nicht so sehr auf diese Freiheiten fokussiert, die ich erwähnt habe, sondern eher auf den Entwicklungsprozess und darauf, wie das gemacht wird und wie der Entwicklungsprozess dabei ist. Und da ist eben dieser Open Source Begriff entstanden. Am Anfang gab es dann auch viele Streitigkeiten, welcher Begriff der bessere ist. Inzwischen ist das eigentlich aber in der Community weitgehend beigelegt und wir verwenden eben diesen Begriff freie Software. Gemeint ist genau das Gleiche."
    },
    {
      "end": 542130,
      "speaker": "A",
      "start": 498300,
      "text": "Ich habe mal irgendwo aufgeschnappt, dass man nur Software als Open Source Software bezeichnen sollte, die auch unter einer von der OSI zertifizierten Open Source Lizenz gestellt sind. Und jetzt weiß ich nicht, ob das Spitzfindigkeit ist oder ob das auch für freie Software gilt, weil wenn ich jetzt einfach eine Software habe, die ich einfach ins Internet stelle und keine Lizenz daran packe, ist das dann nicht auch freie Software? Weil man kann ja irgendwie schwer nachhalten, welche Art von Intellectual Property gilt jetzt, Das ist ja von anderen Ländern auch irgendwie schwierig und so gilt das jetzt aus Deutschland, weil ich die Software aus Deutschland veröffentlicht habe und so weiter. Also kannst du dazu was sagen?"
    },
    {
      "end": 593280,
      "speaker": "C",
      "start": 542210,
      "text": "Sehr gute Frage und wichtig, dass du das sagst. Also tatsächlich werden diese Freiheiten, die Freisoftware bietet, immer durch eine Lizenz eingeräumt. Also wenn du Software programmierst und du willst die als freie Software veröffentlichen, dann musst du eine Lizenz beilegen. Und tatsächlich ist diese Lizenzliste, die die Open Source Initiative, also die OSI oder es gibt auch noch von unserer Schwesterorganisation, der Free Software Foundation, eine Lizenzliste und vom Debian Project, die sind verbindlich. Also die sind sozusagen die Gralshüter der freien Software Lizenzen. Diese Lizenzen, die dort gelistet sind, die sind genau überprüft und die gewährleisten auch diese vier Freiheiten. Und wenn du es ohne Lizenz veröffentlichst, naja, dann räumst du eben niemandem das Recht zur Nutzung ein oder du schreibst irgendwas dazu, jeder darf es nutzen, aber dann ist es halt auch sehr unklar. Deswegen ist es schon gut, diese Lizenzen zu nutzen, die eben da aufgelistet sind und dann ist es auch frei Software."
    },
    {
      "end": 617380,
      "speaker": "B",
      "start": 593280,
      "text": "Also ich bin da auch ganz deiner Meinung, dass man da das vielleicht als bisschen breiter sieht, weil es gibt ja auch die ganze Stallman Bewegung und dann gibt es ja noch Free und Libre Open Source Software und so weiter. Also ich war da auch schon so in Diskussionen von so Hardcore Nerds. Eigentlich geht es ja um, was dahinter steckt und weniger um den eigentlichen Begriff. Also finde ich schön, dass das alles bisschen zusammenwächst."
    },
    {
      "end": 651480,
      "speaker": "C",
      "start": 617380,
      "text": "Naja, vor allem wenn man mit Politikern und Politikerinnen anfängt zu reden oder mit Entscheidungstragenden und fängt dann an, solche Begrifflichkeiten auseinanderzudefinieren, dann gehen, glaube ich, die Türen sofort zu. Also ist schon eigentlich ganz gut, diese Debatte da eigentlich gar nicht, zumindest in der politischen Debatte gar nicht zu führen. Wir sagen, naja, es ist ja auch am Ende so, es gibt zum Beispiel Fahrtgefährte mit vier Rädern mit Gummireifen drauf. Manche sagen dazu PKW, andere sagen dazu Kraftfahrzeug. Gemeint ist aber ein motorisiertes Fahrzeug mit vier Rädern und so ähnlich ist das mit Freie Software und Open Source auch. Gemeint sind die vier Freiheiten."
    },
    {
      "end": 660440,
      "speaker": "B",
      "start": 651480,
      "text": "Okay, gut, dann haben wir das definiert. Jetzt haben wir viel über Open gesprochen und dein Spezialgebiet Open, aber in Public Money Public Code kommt Open gar nicht vor."
    },
    {
      "end": 742840,
      "speaker": "C",
      "start": 662680,
      "text": "Kommt nicht vor, ist aber tatsächlich der Kern, um den es geht. Also Public Money Public Code. Was meinen wir damit? Also wir als Free Software Foundation Europe haben uns diesen Begriff, diesen Claim vor ein paar Jahren, ich glaube vor acht Jahren mittlerweile ausgedacht. Eigentlich arbeiten wir schon seit viel längerer Zeit genau an diesem Thema. Also seit zwei tausend eins gibt es die FSFE, das ist die Abkürzung für Free Software Foundation Europe und seitdem setzen wir uns dafür ein, dass in der öffentlichen Verwaltung, und darum geht es, freie Software eingesetzt wird. Das ist ein Thema, was immer wichtiger wird mit der zunehmenden Digitalisierung. Und da eben die öffentliche Beschaffung, also das, was die öffentliche Verwaltung einkauft an Software eine erhebliche volkswirtschaftliche Wirkung hat, also bis zu sieben und zwanzig Prozent des Umsatzes von Softwareunternehmen Studien zufolge wird durch die öffentliche Hand beschafft. Deswegen ist es aus unserer Sicht so wichtig, dass dort eben freie Software beschafft wird. Dafür setzen wir uns schon lange ein. Wir haben eben überlegt, wie erklären wir das ganz gut mit einem einfachen Begriff und sind dann irgendwann nach längerem Überlegen auf diesen Begriff Public Money Public Code gekommen. Das ist eine einleuchtende Forderung. Wenn Public Money eingesetzt wird für Software, also wenn öffentliches Geld, wenn Steuermittel eingesetzt werden für Software, dann soll auch der Code freie Software sein, unter einer freien Softwarelizenz stehen und eben dadurch von jedem benutzt, verbreitet, verbessert und analysiert werden können."
    },
    {
      "end": 779060,
      "speaker": "A",
      "start": 743000,
      "text": "Heißt das jetzt ganz plakativ, weil du hast gerade gesagt, dass freie Software in Behörden und Co. Eingesetzt wird. Ich versuche jetzt gerade mal ein bisschen zu verstehen, wie wird denn das öffentliche Geld dann angewandt. Und ich rede jetzt gar nicht von Spezialentwicklung, ich rede jetzt nur von die Einführung von openoffice oder libreoffice oder ähnliches in einer Behörde. Das wäre ja dann der Einsatz von Open Source. Das bedeutet dann, dass das Public Money dafür verwendet wird, dieses Projekt durchzuführen, zu evaluieren, ob libreoffice mit Microsoft Excel und so weiter competen kann oder ist das? Habe ich das falsch verstanden."
    },
    {
      "end": 848790,
      "speaker": "C",
      "start": 779220,
      "text": "Das, was du jetzt sagst, ist ja, glaube ich, erstmal der erste Schritt nach Markterkundungsstudie oder sowas. Uns geht es am Ende schon darum, also momentan, vielleicht muss man dann einen Schritt zurückgehen. Der Status quo, wie es momentan läuft, ist, Staat geht hin, nimmt Steuermittel in die Hand und beschafft davon Lizenzen von proprietärer Software. Also das wissen wir alle, wo die herkommt, was die großen Hersteller sind, muss ich jetzt gar nicht nennen, die dann diese Software liefern. Aber da kauft der Staat eben Lizenzen und bekommt damit ein Paket, wo alles mit dabei ist, Maintenance Support, Leistungen, Garantien. Und der Staat könnte eben auch genau dieses Geld, und das sind ganz enorme Summen, in die Hand nehmen und könnte statt Lizenzen zu kaufen, selber entwickeln, tätig werden oder auch Firmen beauftragen, diese Maintenance Produktentwicklung, Maintenance Support mit freier Software zu machen. Hätte den Vorteil, hätte verschiedene Vorteile, aber ein ganz großer Vorteil und der wichtigste wahrscheinlich ist, dass man sich damit aus der, aus der Abhängigkeit von diesen Herstellern proprietär Software, in der sich die öffentliche Verwaltung im Moment befindet, lösen kann und eine Kontrolle über die Infrastrukturen, auf die man als Staat, auf die unsere ganze Gesellschaft angewiesen ist, gewinnen kann."
    },
    {
      "end": 878780,
      "speaker": "A",
      "start": 848790,
      "text": "Ich frage mich gerade, wie kann man es plakativ formulieren, für was das Steuergeld jetzt sei es in Österreich oder in der Schweiz oder in Deutschland, ist ja völlig egal, wo, in fast in jedem Land, wo Steuern gezahlt werden, halt angewandt wird. Ich meine, das ist ja auch so, so verstehe ich die ganze Initiative, dass auch wenn Spezialsoftware entwickelt wird im Auftrag des Landes, im Auftrag des Bundes, dass diese Software dann im Endeffekt auch öffentlich verfügbar gemacht wird und dann als freie Software ist das Verständnis richtig?"
    },
    {
      "end": 889510,
      "speaker": "C",
      "start": 878940,
      "text": "Genau. Es betrifft alle Bereiche, es betrifft die Eigenentwicklung, es betrifft die Beauftragung von neuer Software und es betrifft auch die Anschaffung von Software, die schon auf dem Markt ist. Das alles soll unter freien Softwarelizenzen stehen."
    },
    {
      "end": 904220,
      "speaker": "A",
      "start": 889900,
      "text": "Kann man eigentlich sagen, dass dies gegebenenfalls auch ein mögliches Finanzierungsproblem für die angewandten Open Source Projekte lösen könnte? Denn ich meine, wer zum Beispiel kann besser Support liefern als die Entwicklerriege hinter libreoffice?"
    },
    {
      "end": 926030,
      "speaker": "C",
      "start": 904300,
      "text": "Ja, natürlich. Also für die Unternehmen, die Freisoftware machen, steht da natürlich auch ein Geschäftsmodell dahinter. Also die leben ja davon, dass sie Freisoftware produzieren und sie wollen davon leben, wenn sie dann eben dafür von der öffentlichen Hand bezahlt werden, nicht nur vielleicht einzelne Features zu entwickeln, sondern auch die Software zu mainten, auch Support zu machen, dann ist das gut für sie und dann ist das gut für die Software, die dabei entsteht."
    },
    {
      "end": 941070,
      "speaker": "B",
      "start": 926030,
      "text": "Du hast ja schon kurz erwähnt, dass hier oder dass diese ganze Initiative in der Free Software Foundation gegründet wurde. Kannst du ganz allgemein noch was zur Free Software Foundation sagen? Was macht ihr da sonst so, wenn wir schon einen Spezialisten jetzt da haben?"
    },
    {
      "end": 949790,
      "speaker": "C",
      "start": 941070,
      "text": "Genau, also in der Free Software Foundation Europe, das ist wichtig, denn wie gesagt, es gibt auch die FSF, die Free Software Foundation ist unsere Schwesterorganisation, die aus den USA kommt, aber wir sind die."
    },
    {
      "end": 954510,
      "speaker": "B",
      "start": 949790,
      "text": "FSFE, Ihr habt nichts miteinander zu tun direkt. Also ihr seid jetzt keine Tochter in."
    },
    {
      "end": 984450,
      "speaker": "C",
      "start": 954510,
      "text": "Dem Sinne, sondern ihr seid unabhängige Organisation. Ganz genau. Und wir setzen uns als FSFE, als gemeinnütziger Verein, das sind wir nämlich dafür ein, wir wollen Menschen im selbstbestimmten Umgang mit Technik unterstützen. Dahinter steht so der Gedanke, dass Software in allen Aspekten unseres Lebens tief verankert ist und freie Software gibt eben allen das Recht, Programme für jeden Zweck zu verwenden, zu verstehen, zu verbreiten und zu verbessern. Deswegen setzen wir uns für freie Software ein. Das machen wir schon seit zwei tausend eins und."
    },
    {
      "end": 1005080,
      "speaker": "C",
      "start": 985970,
      "text": "In dem Rahmen machen wir ganz verschiedene Aktivitäten, die auch weit über Public Money Public Code hinausgehen. Wir sind im Bereich Öffentlichkeitsarbeit tätig, im Bereich politische Interessenvertretung und leisten auch rechtliche Unterstützung. Public Money Public Code betrifft eher die ersten beiden Bereiche, die ich gerade erwähnt habe, also Öffentlichkeitsarbeit und politische Interessenvertretung."
    },
    {
      "end": 1006510,
      "speaker": "B",
      "start": 1005150,
      "text": "Und wie finanziert ihr euch?"
    },
    {
      "end": 1024790,
      "speaker": "C",
      "start": 1006670,
      "text": "Wir finanzieren uns vorwiegend zum allergrößten Teil aus Spenden, haben auch viele, viele, viele kleine Spender, die uns monatlich einen kleinen Beitrag spenden, auch einige Firmen, die uns unterstützen. Und daneben gibt es immer wieder dann auch öffentliche Grants, die wir öffentlich geförderte Projekte durchführen uns auf die bewerben."
    },
    {
      "end": 1052980,
      "speaker": "B",
      "start": 1024790,
      "text": "Jetzt hast du schon erwähnt, ihr macht Öffentlichkeitsarbeit und probiert natürlich dieses Thema voranzubringen, aber ihr macht ja auch Monitoring, ihr hab natürlich auch einen guten Überblick, wie es aktuell ist. Und dein Vortrag auf der frostcon war ja auch in diesem Bereich angesiedelt. Also wenn du jetzt den Stand zusammenfassen müsstest, wo stehen wir denn aktuell in Deutschland primär, wo du jetzt zu Hause bist? Also wie gut stehen wir da eigentlich in dem Bereich oder wie schlecht vielleicht weiß nicht, ob man es gut oder schlecht nennen kann."
    },
    {
      "end": 1318110,
      "speaker": "C",
      "start": 1053060,
      "text": "Ja, vielleicht noch, weil du jetzt nach Deutschland Für uns ist wichtig, wir arbeiten nicht nur in Deutschland, auch in Österreich, auch in der Schweiz, aber eben auch in ganz Europa mit einem breiten Europa Begriff. Also da gehören auch die Nicht EU Europastaaten dazu. Ich bin allerdings tatsächlich ganz besonders auf Deutschland fokussiert und habe hier viel zur Situation in Deutschland gemacht, zur politischen. Da lässt sich so ein bisschen zusammenfassend sagen, vielleicht wenn man jetzt zurückschaut, die Ampel, die hatte ja sehr ambitionierte Ziele für Public Money Public Code im Koalitionsvertrag. Es ist bekannt, warum das nicht geklappt hat. Immerhin wichtige Sachen, die aus dieser Zeit erreicht worden sind. Es wurde das Zentrum für digitale Souveränität in Deutschland eingerichtet und gegründet. Da kommen wir, glaube ich, nachher bestimmt noch drauf zu sprechen, was das macht, das Zendis in Abkürzung auch entwickelt. Open Desk, eine souveräne Arbeitsplatzlösung für die öffentliche Verwaltung oder opencode als öffentliche Hosting Plattform für Freisoftware für die öffentliche Verwaltung. Genau. Also das sozusagen als ein Projekt aus der Ampelzeit, was aber auch schon vorher angestoßen worden war, was auf jeden Fall wichtig ist, dass es das jetzt gibt. Die gegenwärtige Regierung, die hat sich im Koalitionsvertrag ambitionierte Ziele für freie Software vorgenommen, aber welche das genau sind und auch wie die erreicht werden sollen, ist leider bis heute völlig unklar. Wir haben als FSFE vor der Wahl schon unsere Erwartungen formuliert. Das ist zum einen Wir haben gefordert, dass Public Money Public Code festgeschrieben und umgesetzt werden muss. Wir haben gefordert, dass es eine sichere langfristige Finanzierung für freie Software für die öffentliche Verwaltung geben muss. Das bedeutet nicht, dass wir mehr Geld ausgeben müssen, sondern wir müssen natürlich umschichten von den proprietären Softwares Lizenzen, die jetzt beschafft werden, hin zu Freisoftware. Und daneben muss es auch so was wie eine sichere Finanzierung für Kerninfrastrukturen die kritisch sind, geben und auch für solche Projekte wie Zendis, was zuletzt sehr unterfinanziert gewesen ist. Dritte Wir brauchen Kompetenzen in der Verwaltung, was freie Software angeht und dabei muss auch die Zivilgesellschaft einbezogen werden, die da eben einen wichtigen Beitrag leisten kann. Und der Fortschritt sollte viertens messbar gemacht werden. Denn bisher gibt es gar keine Statistiken dazu, wie viel Freisoftware eigentlich in der öffentlichen Verwaltung, Verwaltung schon eingesetzt ist. Das heißt, wenn wir darüber reden, wie ist der Stand in Deutschland, ich glaube in Österreich und der Schweiz wird das gar nicht viel anders sein, dann stochern wir so ein bisschen im Dunkeln, weil es eben keine Statistiken gibt. Wir können nicht sehen, wie schnell wir eigentlich in die Richtung vorangehen oder ob wir stagnieren oder vielleicht uns sogar zurückentwickeln. Du hattest vorhin schon, oder ich glaube, Andy hatte vorhin schon diese Tage Analyse, die ich im Sommer vorgestellt habe, für die FSFE erwähnt, wo wir die ersten ein hundert Tage der Bundesregierung bewertet haben. Die Kernpunkte davon waren, und das ist auch bis heute, würde ich sagen, noch so festzustellen, Es sind zwei wichtige Chancen vergeben worden, schon in der Legislatur, jetzt mit dem Haushalt zwei tausend fünf und zwanzig und auch dem Vergabebeschleunigungsgesetz, wo man hätte deutlich mehr in Richtung Public Money, Public Code reinschreiben können. Das ist nicht passiert. Stattdessen hat die Regierung sich ein digitalpolitisches Großprojekt vorgenommen unter dem Titel Deutschland Stack. So heißt auch eine Abteilung im neu gegründeten Digitalministerium. Da geht es darum, einen Stack für die digitalen Infrastrukturen der öffentlichen Verwaltung zu definieren und bereitzustellen, um digitale Souveränität, auch das ein Begriff, über den wir bestimmt noch später reden werden, um digitale Souveränität für Deutschlands öffentliche Verwaltung zu gewährleisten. Die Frage für uns ist, und das ist völlig unklar, wie viel freie Software wird eigentlich in diesem Stack drin sein? Geraten wir da von einer Abhängigkeit, nämlich der von hauptsächlich US amerikanischen Big Tech Unternehmen, in die nächste Abhängigkeit durch einen proprietären Stack, der dann vielleicht von europäischen Unternehmen hergestellt wird, aber eben doch proprietär ist und deswegen wieder eine Abhängigkeit bedeutet. Deswegen, es gab jetzt zuletzt so eine Konsultation vom deutschen Digitalministerium zum Deutschland Stack, zu den ersten Überlegungen, die sich das Ministerium da gemacht hat. Und da haben wir auch teilgenommen und haben unsere Forderungen dort reingegeben und die sind zum einen auch dieser Stack, dieser Deutschland Stack sollte ein hundert Prozent aus freier Software bestehen, denn nur dadurch lässt sich digitale Souveränität aus unserer Sicht wirklich erreichen. Es muss dort mit den europäischen Partnern zusammengearbeitet werden. Also Deutschland Stack, das klingt ja schon so ein bisschen nach einem gewissen Silodenken. Und es ist auch die Frage, wenn wir jetzt einen Deutschland Stack machen, also wir wollen ja europäische Lösungen auch haben."
    },
    {
      "end": 1320590,
      "speaker": "B",
      "start": 1318350,
      "text": "Frankreich hatte sicher einen Spaß auch in Deutschland."
    },
    {
      "end": 1393670,
      "speaker": "C",
      "start": 1322190,
      "text": "Ja, kann man sich ja mal überlegen, wie da aus Frankreich drauf dann geschaut wird und ob dann ein Produkt übernommen wird, was Deutschland Stack heißt oder wie auch die Zusammenarbeit dann stattfinden kann. Da hätte man sich sicher besseren Namen überlegen können. Also ich habe spontan so auch an demail denken müssen, was ja vielleicht einigen noch im Ohr ist, was ja auch so ein nationales Framing war. Wir haben auch gefordert, auch da wieder langfristige sichere Finanzierung und eine Einbindung der Zivilgesellschaft, denn bisher ist das eine reine oder vorwiegend Behördengeburt. Ein bisschen Wirtschaft konnte sich bisher dabei beteiligen, aber wir finden es eben auch sehr wichtig, dass die Zivilgesellschaft von Anfang an dabei ist und dass so ein Stack auch von Anfang an darauf ausgerichtet ist, dass er nachher nachgenutzt werden kann. Denn wenn er nur für die öffentliche Verwaltung produziert wird wird und auch nur für die öffentliche Verwaltung gedacht ist, dann bleiben, glaube ich, wichtige Dimensionen, die möglich sind außen vor. Digitale Souveränität wird natürlich auch in der Wirtschaft gebraucht und auch die freiwillige Ortsfeuerwehr, der Verein nebenan, die nächste freie Schule vielleicht braucht digitale Souveränität und die sollten alle diesen Stack nachnutzen können. Das finden wir ganz wichtig. Und man sollte diese Stakeholder eben auch als Zivilgesellschaft einbinden in das Konzipieren des Stacks."
    },
    {
      "end": 1411770,
      "speaker": "B",
      "start": 1393670,
      "text": "Wie seid ihr denn eingebunden eigentlich in das Ganze? Also habt ihr da irgendwie einen guten Kontakt? Sprechen da Leute auch mit euch wirklich darüber oder ist es so komplett eine Einbahn und ihr sendet da so eure Forderungen und ob das irgendwo ankommt oder gibt es da wirklich einen Dialog auch mit euch als FSFA?"
    },
    {
      "end": 1492470,
      "speaker": "C",
      "start": 1411770,
      "text": "Es gibt natürlich solche Möglichkeiten wie jetzt diese Konsultation, das ist öffentlich, da kann sich jeder beteiligen, auch Privatleute, auch Vereine Und da haben wir uns natürlich beteiligt. Das kann man auch nachlesen. Auf opencode hat das stattgefunden, auf dieser öffentlichen Code Plattform konnte man kommentieren. Wir haben aber tatsächlich es ist dann ganz hilfreich, so was, was wir mit dieser Tage Kritik gemacht haben, wo wir öffentlich etwas kritisieren, merken wir oft, dass danach auch ein Türchen aufgeht und wir es dann leichter haben, vielleicht danach einen Gesprächstermin im Ministerium zu bekommen. So haben wir schon auch Kanäle dann, um mit Menschen im Ministerium, mit Menschen in der Verwaltung auch direkt zu sprechen und uns auszutauschen und unsere Position, unsere zivilgesellschaftliche Sicht da direkt einzuspeise. Das ist nicht immer, aber oftmals hilfreicher, als wenn man groß auf den Putz haut öffentlich und sagt, hier läuft alles falsch. Manchmal muss man das auch machen. Manchmal braucht es auch diese Watchdog Rolle, ganz öffentlich zu sagen, hier, das geht vollkommen in die falsche Richtung. Aber oftmals ist es auch sehr hilfreich, eben diese Hintergrundkanäle zu haben und da wird uns schon auch zugehört. Die Frage ist natürlich, wie viel von dem, was wir da reinbringen, wird am Ende auch umgesetzt. Wir wissen natürlich, dass viel andere Lobby gibt, die ganz andere Positionen dort anbringt. Wir haben langen Atem, wir bleiben dran, wir haben festes Ziel vor Augen und arbeiten weiter daran, dass wir dort auch Gehör finden."
    },
    {
      "end": 1556880,
      "speaker": "A",
      "start": 1492470,
      "text": "Bevor ich jetzt gleich die Kernfrage aufwerfe, die mich schon sehr beschäftigt, frage ich mich, also ich finde das total toll, dass da super viel sich gerade bewegt. Du hast das Zendis genannt, du hast den Deutschland Stack genannt, lass uns nicht über den Namen streiten, aber ich frage mich gerade, ich finde das alles toll, aber ich höre auch da bewegt sich einfach mal gar nichts. Und ein hundert Tage sind drei Monate. Ich habe gerade mal geguckt, ich habe mich daran erinnert. Ich wollte gerade mal Wie viel Tage hat denn eine Legislaturperiode? Ich meine vier Jahre. Also wie viel effektive Arbeitstage für die Politiker, die das alles vorantreiben? Da würde ich mal fast sagen, da ist ja noch ein bisschen Zeit, aber verwalten wir uns da jetzt schon nicht wieder zu Tode. Wir haben gerade erst mal fünf neue Behörden gegründet, irgendwas für digitale Souveränität, Deutschland Stack und so weiter. Warum kann man nicht ganz einfach sagen und ganz einfach ist sehr simplifiziert. Ich nehme mir eine Behörde und tausche mal Microsoft Word und Excel gegen libreoffice aus. Also ich sage mal, wie jede Firma agil, Wir fangen irgendwo mal klein an und versuchen mal weiterzugehen. Warum geht das nicht?"
    },
    {
      "end": 1628380,
      "speaker": "C",
      "start": 1556880,
      "text": "Ja, gute Frage, Weiß ich auch nicht. Also eigentlich geht es, glaube ich, es gibt ja auch durchaus Institutionen, Behörden, die das vormachen. Die zeigen, man kann da vorangehen, auch in anderen Ländern. In Deutschland wäre es sicherlich gut, wenn das Digitalministerium sich zum Beispiel entscheiden würde, Open Desk einzusetzen im Haus. Diese Lösung wird von Zendes entwickelt. Es ist freie Software, sie steht zur Verfügung und es wäre ganz gut, wenn das Digitalministerium dort als, wie soll man sagen, als Vorbild vorangehen würde. Warum das nicht passiert, keine Ahnung, das kann ich nicht so richtig sagen. Natürlich sind Umstellungen immer mit Komplexitäten verbunden. Das ist jetzt nichts, was man von heute heute auf morgen macht. Aber es gibt ja auch Beispiele für gelungene Migration. Man weiß inzwischen, wie man solche Projekte angehen muss. Also Beispiel Schleswig Holstein geht da gerade sehr schnell voran und hat gerade jetzt vermeldet, achtzig Prozent der Arbeitsplätze von Microsoft Produkten auf libreoffice umgestellt zu haben. Das war gerade was, was der Digitalminister Dirk Schröter dort gegenüber Heiß Lautbad hat, Mitte November. Das zeigt also, es geht, wenn man es gut plant, wenn man das gut vorbereitet und wenn man vor allem den Willen hat, das auch zu machen. Aber das ist natürlich die, ist der Willen da."
    },
    {
      "end": 1637060,
      "speaker": "A",
      "start": 1628460,
      "text": "Das österreichische Bundesheer hat gerade auch alles im Sommer auf libreoffice umgestellt. Deswegen Gratulation Wolfgang an euer Bundesheer, dass."
    },
    {
      "end": 1642060,
      "speaker": "B",
      "start": 1637060,
      "text": "Unser Bundesheer mal Vorreiter ist. Das hätte ich mir auch nicht annähernd vorstellen können."
    },
    {
      "end": 1679380,
      "speaker": "C",
      "start": 1642380,
      "text": "Ja, ist auf jeden Fall ein gutes Beispiel. Auch das Bundesheer, was da zwei tausend ein und zwanzig glaube ich, gestartet ist, in dieses Projekt die Arbeitsplätze auf libreoffice umzustellen und das gut vorbereitet hatte. Also die haben viele Tutorials gemacht für die Mitarbeitenden, haben viel Knowledge eben auch verbreitet, haben die Benutzer innen mitgenommen, hatten vielleicht den Vorteil, dass sie keine Makros migrieren mussten, weil der Einsatz von Makros dort verboten war. Aber sowas kann eben schon insgesamt als Best Practice dienen. Und wenn mehr Institutionen das machen, dann sehen andere wiederum, das geht. Es ist gar nicht so schwer, wir können es tun und dann wird es auch woanders gemacht. Also von daher gutes Beispiel."
    },
    {
      "end": 1690170,
      "speaker": "B",
      "start": 1679850,
      "text": "Wobei man ja auch sagen muss, dass sie zwei tausend acht schon mal gescheitert sind. Also da wollten sie openoffice einsetzen, aber immerhin haben sie es jetzt geschafft und es sind doch Arbeitsplätze. Also schon ein gutes Beispiel."
    },
    {
      "end": 1696890,
      "speaker": "A",
      "start": 1690250,
      "text": "Ich wollte gerade fragen, wie es eigentlich der Stadt München mit dem Linux Desktop geht, aber ich glaube, damit mache ich mir keine Freunde."
    },
    {
      "end": 1748380,
      "speaker": "C",
      "start": 1698010,
      "text": "Ich kann aber auch einen Satz dazu sagen. Also da ist ja dieses Limox Projekt, also dieses Linux für die öffentliche Stadt, für die öffentliche Verwaltung. München ist ja aus politischen Gründen dann abgesägt worden und das war ein großer Aufreger. Man muss sagen, München ist mittlerweile wieder zurück bei freier Software und sie machen ganz viel in dem Bereich und das ist auch wirklich beeindruckend, was da passiert. Also die haben auch so kreative Ideen, dass sie zum Beispiel ein Sabbatical zur Entwicklung von freier Software ermöglichen. Also teilweise Stunden freistellen bei ihren Mitarbeitern für die Mitarbeit an freier Software. Sie machen ganz viel Inhouse Entwicklung. Sie haben ein tolles Open Source Portal, heißt es glaube ich, wo sie diese Entwicklung auch showcasen. Was ganz wichtig ist, sehen auch wieder andere. Was macht München? Das geht. Sie finanzieren auch. Sie machen Sponsorings für freie Software, die sie einsetzen. Das ist auch total wichtig. Also da passiert ganz viel. München ist auch ein gutes Beispiel."
    },
    {
      "end": 1751620,
      "speaker": "A",
      "start": 1748780,
      "text": "Kommen wir mal zur Kernfrage, die mich die ganze Zeit umtreibt."
    },
    {
      "end": 1753380,
      "speaker": "B",
      "start": 1751620,
      "text": "Jetzt hast du schon wieder eine Kernfrage."
    },
    {
      "end": 1783970,
      "speaker": "A",
      "start": 1753380,
      "text": "Nee, nee, jetzt kommt die eigentliche Kernfrage. Gerade habe ich die nur geteasert. Was ist daran so schwer? Was ist an Public Code, Public Money so schwer? Also ich meine, im Endeffekt hat der Staat oder der Bund doch Geld. Die haben eine Anforderung, die müssen eine Software kaufen. Meines Erachtens nach oder meines Wissens nach gibt es da sowas wie ein Vergabeverfahren. Man muss eine Ausschreibung machen und da muss man sich drauf bewerben Und ich glaube, es gibt auch eine der Günstigste muss gewinnen oder muss genommen werden und so weiter und so fort."
    },
    {
      "end": 1786050,
      "speaker": "B",
      "start": 1784530,
      "text": "Bestbieter, vermute ich mal."
    },
    {
      "end": 1787650,
      "speaker": "A",
      "start": 1786450,
      "text": "Was ist Bestbieter?"
    },
    {
      "end": 1790250,
      "speaker": "B",
      "start": 1787890,
      "text": "Das beste Angebot. Es muss nicht immer nur der Preis sein."
    },
    {
      "end": 1811770,
      "speaker": "A",
      "start": 1790250,
      "text": "Weiß ich nicht. Gute Frage. Was ist daran so schwer? Also warum können wir, warum kann nicht einfach. Ich meine, die haben ja auch eine interne IT oder die meisten Behörden, da werden wohl auch Experten sitzen, die dann sehr wahrscheinlich auch die Software später maintainen müssen oder ähnliches. Oder denke ich da einfach zu simplifiziert und du sagst mir jetzt, Andi, in deiner Welt möchte ich gerne leben?"
    },
    {
      "end": 1812570,
      "speaker": "C",
      "start": 1812170,
      "text": "Ach."
    },
    {
      "end": 2020540,
      "speaker": "C",
      "start": 1815290,
      "text": "Naja, zum einen ist es natürlich, es muss irgendwo das Problem erkannt sein und es muss der Wille da sein, dieses Problem zu bearbeiten. Das ist etwas, das hätten wir schon vor vielen Jahren tun können. Also seit spätestens zwei tausend neunzehn ist bekannt, Deutschland ist nicht digital souverän in Deutschland, für Deutschland gesprochen zum Beispiel. Trotzdem waren jetzt alle entsetzt als Trump zum zweiten Mal ins Amt gekommen ist und sich abgezeichnet hat, auch diese Abhängigkeiten als Druckmittel verwendet werden können, waren alle ganz entsetzt und haben jetzt wieder festgestellt, oh, wir sind nicht digital souverän. Das hätte man also auch viel früher erkennen können und hätte dann entsprechend handeln können. Also dieses Umdenken braucht es erstmal diese Problemerkennung auf politischer Ebene bei den Entscheidungstragenden. Ich glaube, in den IT Häusern, aus den öffentlichen IT Häusern ist da schon sehr oft viel Problembewusstsein da. Und zum Zweiten braucht es natürlich ein Umdenken bei der Beschaffung. Also Freie Software Ökosysteme funktionieren anders als der Kauf von proprietären Lizenzen. Das habe ich ja vorhin schon kurz angeteasert. Also bei proprietären Lizenzen macht man eben eine Ausschreibung. Es bewerben sich irgendwelche Unternehmen drauf oder wenige Unternehmen, die das wahrscheinlich können bei solchen Ausschreibungen, Ausschreibungsvolumina von am Ende mehreren Milliarden Euro. Das ist klar, dass dann auch der gesamte europäische Markt eigentlich schon von vornherein ausgeschlossen ist und der Staat erwirbt dann eben Lizenzen. Und hinter diesen Lizenzen verbirgt sich alle Leistungen, die man dafür bekommt, sowas wie Entwicklung, Maintenance, Betrieb, Support, Garantieleistung, aber eben auch viele Leistungen, die man nicht braucht, irgendwelche Features, die man gar nicht haben will und andere Features bekommt man dafür nicht. So, davon jetzt umzudenken zu einer Ausschreibung für freie Software, die auf dieses freie Software Ökosystem zugeschnitten ist, bedeutet, man kauft keine Lizenzen, sondern man muss eben Entwicklungsleistungen, Maintenance, Hosting, Support ausschreiben. Das funktioniert also ein bisschen anders und dafür hat man aber auch die Möglichkeit, genau das Produkt zu bekommen, das man braucht und den Support, den man braucht. Aber es setzt eben ein Umdenken und Umlernen in den öffentlichen Verwaltungen, auch in den Vergabeabteilungen voraus. Ein Problem, was sich da so stellt, weil du Warum ist es so schwierig? Ich glaube, es ist so, dass in unserem Behördensystem niemand dafür belohnt wird, Neues zu wagen und neue Wege zu beschreiten, die nicht von oben vorgegeben sind. Das ist also so ein Grundproblem. Deswegen brauchen wir eigentlich an der Stelle schon eine Vorgabe von oben, eine Veränderung, wo es eine Vorgabe gibt, ganz klar Free Software first. Es muss freie Software prioritär beschafft werden. Gibt einen interessanten Prozess, weil wir gerade über Vergabe sprechen, nämlich auf der europäischen Ebene. In der EU wird seit diesem Jahr daran gearbeitet, die europäischen Vergaberichtlinien neu zu fassen Und da soll zum ersten Mal so was wie strategische Vergabekriterien mit einfließen. Also Wolfi, wie du vorhin schon gesagt hast, momentan ist es eher so lowest bit, also der niedrigst Bietende gewinnt oder der vielleicht das beste Angebot. Meistens ist es schon lowest bid, also meistens fließen da gar nicht viele andere Kriterien ein und es werden eben auch viele Hersteller durch die Volumina a priori ausgeschlossen. Durch diese Vergaberechtsreform. Auf europäischer Ebene soll es jetzt eben so werden, dass dort auch strategische Erwägungen mit einfließen können. Ob da jetzt unbedingt digitale Souveränität und eben auch digitale Souveränität durch freie Software ein Kriterium sein wird, das ist momentan noch nicht ganz klar. Da arbeiten wir dran, auch auf europäischer Ebene. Und das ist aber etwas, was sehr, sehr wichtig sein wird, dabei dieses ganze Vergabewesen so zu bearbeiten und so zu verändern, dass wir in Zukunft digital souveräne Produkte, die eben durch freie Software digital souverän sind, beschaffen können."
    },
    {
      "end": 2078040,
      "speaker": "A",
      "start": 2020540,
      "text": "Gibt es denn auch irgendwie Fachleute, die Gremien beraten, die dann diese Vergabekriterien erstellen, wie man zum Beispiel die ganze Sache mit Open Source zu handhaben hat? Du sagtest ja gerade, der Umgang mit Open Source oder wie Open Source produziert, hört sich jetzt so maschinell an, aber erstellt wird, ist anders als proprietäre Software und so weiter und so fort. Da gibt es ja Unterschiede, da stimme ich ja zu. Aber gibt es denn auch Experten, ich sag mal so wie, weiß ich nicht, Linus Torvalds oder irgendwelche großen Leute, die halt vielleicht sozial kompetenter sind als Linus, aber die halt dann auch mit da reingehen und sagen, okay, wir helfen euch jetzt mal, wir kommen aus dieser ganzen Open Source Ecke, wir helfen euch jetzt mal, die ganze Sache vielleicht besser zu verstehen und auch mal gegenzuchecken, welche Kriterien für nachhaltige Open Source Beschaffung denn überhaupt sinnlich sind oder ähnliches. Oder sagst du, dass so wie wir alle Open Source betreiben, ist nicht behördenkompatibel? Kann ja auch sein, dass wir das Problem sind."
    },
    {
      "end": 2229040,
      "speaker": "C",
      "start": 2078200,
      "text": "Ach, ich glaube, das Problem liegt da nicht auf der Seite. Es gibt viele gute Anbieter auf dem europäischen Markt, die hervorragende freie Software machen und diese Lösungen kommen ja auch ganz genau schon zum Einsatz. Wenn man zum Beispiel auf Open Desk schaut, dann besteht das ja aus lauter sehr bewährten Komponenten. Sowas wie Nextcloud ist da dabei, dann sind das alles Komponenten, die schon wirklich bewährt sind und state of the art sind. Also ich glaube, daran liegt es nicht. Beratung ist da, glaube ich, notwendig. Ich glaube, es ist gut, dass es solche Institutionen wie das ZENDIS gibt, die da ein Stück diesen Weg begleiten können. Es wäre durchaus sehr, sehr wichtig, dass der Bund und auch die öffentliche Verwaltung sich da weiter darüber hinaus noch auch eigene Kompetenzen aufbaut. Ich glaube, es gibt in der Zivilgesellschaft durchaus Organisationen, die das leisten können. Wir selber haben beispielsweise, um ein Beispiel zu geben, haben das ZENDES, also Zentrum für digitale Souveränität, letztes Jahr beraten über einen längeren Zeitraum in der Gründungsphase, in der Ausschreibungsphase von Open Desk. Und solche Transfers zu ermöglichen von Wissen, das eben in den Freisoftware Ökosystemen und in der Zivilgesellschaft vorhanden ist, in die öffentliche Verwaltung, das ist wichtig und das muss eben auch zugelassen werden und ermöglicht werden. Und da muss der Staat proaktiv hingehen und muss nachfragen. Es gibt auch andere Player, weil du nach Kriterien gefragt hast und andere Stakeholder, die sich da schon Gedanken gemacht haben. Ich selber habe einen Talk gehalten zwei tausend vier und zwanzig auf der frostcon, wo es ganz genau dauert, geht die föderale IT Kooperation in Deutschland. Die FITKO beschäftigt sich auch sehr intensiv mit dem wie kann man denn tatsächlich freie Software bekommen bei Ausschreibungen und auch solche, die gut ist und nachhaltig ist, wenn man freie Software haben will. Also was für Kriterien muss man da in Ausschreibungen reinmachen, hat sich die FITKO Gedanken darüber gemacht. Es gibt die Open Source Business Alliance, die OSB A, also einen Wirtschaftsverband, der sich genau über solche Fragen Gedanken schon gemacht hat. Es gibt also da durchaus Stimmen, die da sind. Und das ist ganz gut, wenn die eben auch noch stärker in den Kompetenzaufbau auf Seiten der öffentlichen Verwaltung, auf Seiten des Bundes und der Länder und der Kommunen mit reingeholt werden. Am Ende wird es halt nicht funktionieren, wenn wir jetzt als Zivilgesellschaft zu jeder Vergabestelle einzeln hinlaufen müssen und denen sagen müssen, hier übrigens, so und so geht das, oder die fragen uns halt individuell einzeln an und wollen was von uns wissen. Das können wir dann gerne mal machen, aber bei so und so viel ein hundert Kommunen und so und so viel Bundesländern und dann eben auch Ländern in Europa, wo überall Vergaben ist, klar, es braucht eigentlich eine zentral implementierte Steuerung von solchen Prozessen. Man muss also den Knowledge Transfer eigentlich eher von oben her implementieren, aber dabei auf die Zivilgesellschaft und das, was da existiert, zurückgreifen."
    },
    {
      "end": 2303510,
      "speaker": "B",
      "start": 2229040,
      "text": "Ich habe eine sehr schöne oder positive kleine Story von uns in Tirol. Der Lawinenwarndienst hat ein großes Projekt angesucht und hat dann in dem Projektantrag schon hineingeschrieben, die Software muss Open Source sein. Dann wurde der Projektantrag genehmigt, sie haben das Geld bekommen und ab diesem Zeitpunkt war dann fix, es muss Open Source sein, weil das Projekt war ja so genehmigt, dass die Software Open Source sein muss. Das heißt, man konnte im Nachhinein danach gar nicht mehr diskutieren oder das irgendwie raus verhandeln, dieses Open Source. Was dann aber natürlich schon zu Problemen geführt hat bei den Dienstleistern, weil die teilweise wirklich überfordert waren in dieser Nische, würde ich fast sagen, die wollten dann teilweise halt kein Open Source machen oder die hatten vielleicht eine Lösung, die passend war, aber nicht Open Source. Aber es war dann schwarz auf Weiß. Also es war dann ein fixes Kriterium und ein Must Have und das hat dann eigentlich ganz gut funktioniert, auch wenn es natürlich zu Reibereien führt im Endeffekt. Aber meine Frage ist dann, und ich weiß nicht, ob du mir die beantworten kannst rein rechtlich, aber kann ich nicht ein Must Have Kriterium in meine Anforderungen reinschreiben? Open Source Must have Oder ist es dann irgendwie marktverzerrend oder so, wenn ich wirklich eine Open Source Software wirklich haben will und zwar nur eine Open Source Software und alle andere ausschließe automatisch?"
    },
    {
      "end": 2397980,
      "speaker": "C",
      "start": 2303510,
      "text": "Ja klar, also das geht schon. Es gibt auch wissenschaftliche Stimmen, die schon bestätigt haben, dass das möglich ist. Es geht ja auch hier gar nicht darum, bestimmte Technologien zu bevorzugen, sondern es geht darum, strategisch zu beschaffen. Also genau das, was auch bei dieser EU Vergabereform passiert. Und wenn eben ein strategisches Ziel ist, Souveränität und Herstellerunabhängigkeit zu erreichen, dann ist Vorrang für freie Software eben der beste Weg, weil Freisoftware diese Souveränität gewährleisten kann. Also warum sollte das dann nicht möglich sein? Also die Frage ist natürlich, finden sich dann Dienstleister, die das machen bzw. Wollen das die Firmen, die vielleicht auch bisher proprietär produziert haben, könnte man nachfragen. Ich glaube aber, das ist eigentlich gar nicht die entscheidende Frage, sondern können wir es uns als Gesellschaft leisten, diese Abhängigkeiten, in denen wir jetzt sind, fortzuschreiben. Und Dienstleister und Hersteller, die jetzt schon seit Jahrzehnten mit proprietären Produkten und mit proprietären Geschäftsmodellen unterwegs sind, die werden ja eigentlich durch Public Money Public Code gar nicht nicht benachteiligt oder ausgeschlossen, sondern ganz im Gegenteil, die können ja auch selber freie Software entwickeln. Das erfordert natürlich eine gewisse Anpassungsbereitschaft, gerade wenn das Geschäftsmodell jetzt in der Vergangenheit war, den Staat und andere Kunden in einer gewissen Abhängigkeit zu halten. Aber eigentlich gibt es gerade im Kontext von Public Money Public Code wirklich gute Geschäftsmodelle und auch Chancen für Hersteller, die bisher proprietär Software gemacht haben. Denn mit dem Staat haben sie einen echt guten Ankerkunden, der extrem viel Geld in der Hand hat und das einsetzen kann. Und das ist auch wirklich eine Chance für Firmen, die bisher proprietar Software gemacht haben, dann umzustellen und zu sagen, wir wollen jetzt eben auch freie Software auf den Markt bringen und an diesen Ankerkundenstart verkaufen."
    },
    {
      "end": 2408460,
      "speaker": "B",
      "start": 2397980,
      "text": "Weißt du zufällig, ich hab jetzt auch nicht sehr viel Einblick in dieses österreichische Bundesheerprojekt, aber sind die schon an den Start gegangen? Wir wollen wirklich eine Open Source Lösung oder war das eine klassische Ausschreibung?"
    },
    {
      "end": 2409300,
      "speaker": "C",
      "start": 2408700,
      "text": "Keine Ahnung."
    },
    {
      "end": 2417160,
      "speaker": "B",
      "start": 2409300,
      "text": "Oder kennst du vielleicht auch Projekte in Deutschland, die wirklich schon so an den Start gegangen sind mit dem Ziel, es muss eine Open Source Software sein?"
    },
    {
      "end": 2486360,
      "speaker": "C",
      "start": 2417240,
      "text": "Naja, ich habe ja vorhin schon Schleswig Holstein erwähnt, das ist ja in Deutschland ein bisschen das Leuchtturm Bundesland, was da viel früher als andere schon sich auch eine Open Source Strategie gegeben hat, ich glaube zwei tausend dreizehn, und wo von Anfang an klar war, wir wollen durch freie Software, also Open Source Strategie heißt es, aber wir wollen eben durch freie Software unsere digitale Souveränität steigern und verbessern und diese Unabhängigkeit bekommen, diese Herstellerunabhängigkeit bekommen. Da war das also von Anfang an klar. Was da ganz interessant ist, ist das eine Strategie, die ist unter grüner Ägide verabschiedet worden und sie hat aber den, ich würde sagen, den Transfer jetzt zu einem CDU geführten Digitalministerium, zum CDU geführten Haus nicht nur überlebt, sondern ist auch sehr, sehr ambitioniert von dem christdemokratischen Minister jetzt fortgeführt worden. Und das ist wirklich ein gutes Zeichen zu sehen, dass also auch an solchen Stellen Freisoftware nicht eine Frage von Parteipolitik mehr ist, sondern dass durch die Bank hinweg Parteien erkannt haben, das ist ein Weg, den wir gehen sollten und den wir gehen müssen. Das ist wirklich ein gutes Zeichen. Aber ich glaube, dort war von Anfang an ja, wir wollen dort auf freie Software setzen und wir wollen jetzt also nicht in irgendeine Richtung marschieren, sondern am Ende wollen wir diese Unabhängigkeit durch freie Software haben. Und das kriegen sie, glaube ich, auch."
    },
    {
      "end": 2542320,
      "speaker": "A",
      "start": 2486360,
      "text": "Wolfgang hat das gerade so formuliert, als wenn das Pflichtkriterium von Open Source mit in der Ausschreibung drin steht, dann hat sich das so angehört, als benachteiligt man Firmen und du, Johannes, hast ja gerade auch zu Recht gesagt, okay, das bedarf Anpassungen von proprietären oder Softwarebuden, dann wieder Open Source zu machen, wenn man sich dann nicht anpasst, frage ich mich gerade und sehr böse ist das nicht eigentlich ein Scam Modell, den Staat mit seiner proprietären Software dann so als Geisel zur Abhängigkeit zu nehmen? Also ich meine, die denken sie ja natürlich sehr an sich und ich muss zugeben, wenn ich den Staat als Kunden habe, dann ist das eine halbe Gelddruckmassnahme, besonders wenn ich weiß, die sind abhängig von mir. Deswegen ist das nicht eigentlich, wenn man jetzt böse denkt, zu einem enorm großen Vorteil für das Land oder für den Bund, ein Open Source Kriterium als Pflichtkriterium zu markieren, um gerade nicht in Geiselhaft genommen werden zu können bei proprietärer Software."
    },
    {
      "end": 2600850,
      "speaker": "C",
      "start": 2542320,
      "text": "Ja klar. Also ich würde sagen, vielleicht ist es ein bisschen hart formuliert zu sagen, es ist ein Scam Modell. Ich glaube, es gibt einfach gewachsene proprietäre Ökosysteme. Es sind auch viele kleine Firmen, kleinste Firmen, die irgendwelche Fachverfahren, vielleicht zwei Fachverfahren dem Staat anbieten, die sie seit dreiig Jahren weiterentwickeln als proprietäres Modell und wo auch wirklich der Umsatz von der Firma davon abhängt, ist natürlich jetzt für eine Firma auf den ersten, für so eine Firma auf den ersten Blick viel einfacher, als einfach so weiterzumachen, als jetzt sich zu ändern, umzustellen, zu sagen, wir machen das jetzt als freie Software. Aber nochmal, also die Frage ist ja nicht, was will die Firma und was das Geschäftsmodell der Firma? Und da sollte nicht die Abhängigkeit oder Unabhängigkeit unserer öffentlichen Verwaltung davon abhängen, sondern die Frage ist strategisch, wie sollte sich unsere Verwaltung digitalpolitisch von ihren digitalen Infrastrukturen her aufstellen. Und da braucht es eben dieses freie Software Kriterium. Ganz klar."
    },
    {
      "end": 2640740,
      "speaker": "A",
      "start": 2601330,
      "text": "Ich bin da ein hundert Prozent bei dir. Ich bin in der glücklichen Lage, mich nicht politisch korrekt ausdrücken zu müssen. Deswegen kann ich so arg aggressiv formulieren, Aber ich bin noch brutaler. Und ich sage, wenn du eine Firma hast, die proprietäre Software für zwei Ämter baut und das ihr Geschäftsmodell ist, dann muss ich zugeben, dann hat der Unternehmer vielleicht seinen Job nicht verstanden, die Kunden zu diversifizieren bzw. Kann da einen besseren Job machen. Oder es ist in der Selbstständigkeit, würde man sowas Scheinanstellung oder so, wie heißt das nochmal? Scheinselbstständigkeit, Scheinselbstständigkeit gegebenenfalls nennen, wenn man immer nur einen Kunden hat und trotzdem auf seine eigene Rechnung agiert. Also vielleicht gehört diese Firma dann doch eher in den Bund oder ähnliches integriert."
    },
    {
      "end": 2689880,
      "speaker": "C",
      "start": 2641220,
      "text": "Also für den ich wechsle wieder. Die Perspektive für die öffentliche Verwaltung ist die wie bekommen sie die besten Lösungen? Und ja, ist halt die Frage, bekommen sie die besten Lösungen, wenn sie sich von solchen Geschäftsmodellen abhängig machen und von solchen Anbietern abhängig machen, die dann die einzigen sind, die diese drei Fachverfahren herstellen, die auch keine Konkurrenz haben, die also auch keine Anreize haben, ihr Produkt laufend zu verbessern. Ich weiß nicht, wer schon mal in der Behörde, in der Verwaltung auf den Bildschirm geschaut hat, wo dann so ein Fachverfahren läuft, der sieht ja auch oft, dass das jetzt nicht die, oftmals nicht die allermodernsten Lösungen sind. Ich glaube schon, dass es für den Staat dann im Nachgang natürlich auch für die Bürgerinnen und Bürger, die ja auch oft dann mit staatlicher IT zu tun haben, wenn sie irgendwelche Bürgerdienste nutzen, digitale, dass es für die alle gut ist, dass sie bessere Lösungen bekommen, auch wenn der Staat sich entscheidet, auf freie Software zu setzen."
    },
    {
      "end": 2697640,
      "speaker": "C",
      "start": 2691400,
      "text": "Dass sich da eben dann auch die besseren durchsetzen, die tatsächlich dann das bessere Produkt haben und das aktuell halten können."
    },
    {
      "end": 2701240,
      "speaker": "A",
      "start": 2697800,
      "text": "Also mich musst du hier nicht überstimmen, ist mir klar."
    },
    {
      "end": 2770330,
      "speaker": "A",
      "start": 2703000,
      "text": "Wir sprechen jetzt gerade von der kleinen Butze, die zwei Behörden hat und du hast auch gerade schon das Volumina dieser Ausschreibungen erwähnt, dass gegebenenfalls viele deutsche Firmen oder europäische Firmen da wahrscheinlich gar nicht mithalten können. Und eine Newsmeldung, die diesen Sommer durch die Presse ging, war die deutsche Bundeswehr bzw. Die IT der deutschen Bundeswehr, die mit Google Cloud einen Vertrag über eine Air Gap Lösung abgeschlossen hat, über, ich glaube, echt viel Geld, weil ich glaube, dass Google eine Control Plane in eigenen Datacentern betreibt. Ich weiß ungefähr, was das nur so halb bedeutet und was das für ein Engineering Aufwand ist, eine Control Plane noch mal rauszuziehen. Aber da wird es ja mit hoher Wahrscheinlichkeit um ein Volumina gehen, weil was ich glaube, keine einzige europäische Firma steuern kann, oder also auch nicht so eine Schwarz Gruppe oder so eine Stackit oder Hetzner oder was weiß ich nicht, wer da Ich möchte jetzt Hetzer nicht mit Google Cloud vergleichen. Ich glaube, der Featureumfang ist schon ein bisschen anders. Aber wie können solche großen Ausschreibungen denn überhaupt aus Deutschland, Österreich, Schweiz oder Europa bedient werden in einer solchen Größe? Weil wer konkurriert noch mit Google Cloud? Das muss man ja mal ganz ehrlicherweise sagen."
    },
    {
      "end": 2901780,
      "speaker": "C",
      "start": 2770330,
      "text": "Also zunächst mal muss ich sagen, vielleicht zu dem konkreten Beispiel Bundeswehr muss man natürlich sagen, dass jetzt jetzt in der aktuellen, auch sicherheitspolitischen Lage ausgerechnet dieses Bundeswehr IT Systemhaus BWI auf diese proprietäre Google Cloud setzt. Das ist in hohem Maße irritierend. Und wenn das dann klar ist, trotzdem durch den US Cloud Act besteht dort Zugriff für Dienste aus den USA, für Stellen aus den USA, das wird sich auch nicht verhindern lassen. Außerdem gibt es dann immer die Gefahr, dass es eben doch abgeschaltet werden kann, dass keine Updates mehr geliefert werden. Also so wird man auf jeden Fall nicht digital souverän, was die Frage nach der Verfügbarkeit von Lösungen und auch von Dienstleistern angeht. Also zum einen, es gibt ein großes Ökosystem, was entwickelt, was beitragen kann, Lösungen anbieten kann, hosten und supporten kann. Ein Stück weit ist auch hier die Will man aus strategischen Erwägungen diese digitale Souveränität durch freie Software bekommen, dann muss man eben auch Ausschreibungen so machen, dass europäische Player da die freie Software anbieten, eine Chance haben, drauf zu bieten. Es geht vielleicht auch nicht von heute auf morgen, dass man dann irgendwie so ein drei komma acht Milliarden Auftrag an eine deutsche freie Softwarefirma vergeben kann. Aber wie gesagt, muss man eben Ausschreibungen so machen, dass man das bekommt, was man eben strategisch eigentlich will. Und klar ist, wenn die Nachfrage steigt, dann wird auch das Angebot entstehen. Deswegen ist ja Public Money Public Code so wichtig, weil der Staat eben die Möglichkeit hat, als Ankerkunde Marktanreize zu setzen und auch den Markt damit zu entwickeln. Dadurch entsteht mehr Angebot und die Lösungen werden auch für viele andere interessante klar ist ganz vom Prinzip her. Es gibt eben viele kleine und mittelständische Unternehmen in Deutschland und in Europa. Viele von denen machen übrigens auch freie Software. Wenn Public Money Public Code sich durchsetzt, dann ist es eine Riesenchance ganz genau für diesen so aussehenden europäischen Markt und deutschen Markt, weil der eigentlich vorwiegend mit freie Software die Chance hat, etwas von dem Vorsprung im öffentlichen Sektor aufzuholen, den durch jahrzehntelange Abhängigkeit und viele, viele, viele Milliarden, die da, die da geflossen sind, diese Big Tech Anbieter vorwiegend aus den USA dort sich erarbeiten konnten."
    },
    {
      "end": 2916420,
      "speaker": "B",
      "start": 2901860,
      "text": "Jetzt wenn du sagst, der Markt muss sich weiterentwickeln und er hat sich ja ein bisschen weiterentwickelt, du hast schon Zentis erwähnt und die Open Code Plattform. Kannst du da noch mal zwei Sätze dazu sagen, was das eigentlich ist, wer die betreibt, woher das eigentlich kommt, um das auch bisschen einzuordnen?"
    },
    {
      "end": 3047730,
      "speaker": "C",
      "start": 2916580,
      "text": "Ja genau, das ist auch interessante, interessante Frage. Also es gab ja schon, wie vorhin erwähnt, zwei tausend neunzehn ein Gutachten, eine Studie, die festgestellt hat für Deutschland jetzt Deutschland ist nicht digital souverän. Das trifft glaube ich auf fast alle europäischen Länder in der Form zu. Und eine der Entscheidungen, die man dann getroffen hat, ist zum einen soll in Deutschland dieses Zentrum für digitale Souveränität des Zentris gegründet werden. Zum anderen wir brauchen souveräne Software, freie Software, die in den Verwaltungen eingesetzt werden kann. Wir brauchen einen souveränen Arbeitsplatz. Es ist klar so mit der zunehmenden Cloudifizierung mit Microsoft drei hundert was da damals am Horizont aufschieben, mittlerweile auch schon an vielen Stellen leider im Einsatz ist, der Weg führt für viele in die Cloud und deswegen sollte es auch eine Cloud Lösung sein, dieser souveräne Arbeitsplatz. Und man hat sich überlegt, da eben auch nicht etwas vom Scratch neu zu entwickeln, sondern auf bewährte Komponenten zuzugreifen, bewährte Lösungen, die schon im Einsatz sind und hat sich dann da so ein Portfolio zusammengesteckt, wo ich will jetzt gar nicht alle einzeln aufzählen, auch weil ich dann bestimmt jemanden vergesse. Einen habe ich ja vorhin schon erwähnt, welche Komponenten da drin sind, aber das kann man ja auf der Seite von Open Desk auch nachschauen. Was die dann gemacht haben, ist diese Komponenten zu integrieren miteinander, sodass sie zusammenarbeiten, dass man beispielsweise Termine erstellen kann in dem einen Teil und die werden dann automatisch im Kalender angezeigt oder das Mailprogramm verschickt dann Einladungen dazu, also eine Integration ermöglicht. Und das Ganze läuft eben auf Servern und wird von den Mitarbeitenden in der Verwaltung über den Browser aufgerufen, also eine Cloud Anwendung. Mittlerweile ist es ganz gut im Einsatz, ich glaube also, oder sogar noch mehr Arbeitsplätzen mittlerweile. Die ganz aktuellen Zahlen habe ich nicht. Es könnte natürlich noch viel mehr sein, aber es sind auch durchaus wichtige Institutionen wie zum Beispiel das Robert Koch Institut dabei, die Open Desk nutzen. Natürlich könnte Open Desk noch sehr viel weiter im Einsatz sein und es ist auch wichtig, dass sich noch weiter verbreitet und auch mehr genutzt wird, denn es ist eben zum ersten Mal so, dass damit eine freie Softwarelösung bereitsteht, die es den öffentlichen Verwaltungen ermöglicht, sich gegen zum Beispiel Microsoft drei hundert fünf und sechzig oder gegen eine Google Cloud zu entscheiden. Das war bisher gar nicht möglich, sich gegen solche Big Tech proprietären Lösungen zu entscheiden. Und zum ersten Mal besteht die Möglichkeit, die sollte genutzt werden, das ist ganz wichtig."
    },
    {
      "end": 3054530,
      "speaker": "B",
      "start": 3047810,
      "text": "Die ist aber finanziert vom Bund. Also das war wirklich eine Initiative vom Bund und nicht von euch zum Beispiel."
    },
    {
      "end": 3250100,
      "speaker": "C",
      "start": 3054530,
      "text": "Also das ZENIS ist finanziert gewesen bisher vom Bund. Das soll also auch soll sich in Zukunft selbst tragen durch die Lizenzierung von Open Desk oder durch den Einsatz von Open Desk, durch die Vermarktung davon. Der Code kommt aus vielen Projekten, wo er schon vielfach im Einsatz war davor, aber er ist davor auch schon ein Stück weit integriert worden von, und das ist jetzt ganz interessant, von einem norddeutschen öffentlichen IT Haus, der Dataport, die das Ganze auch als souveränen Arbeitsplatz schon konzipiert hatten ab zwei tausend ein und zwanzig glaube ich, und das unter dem Namen definix an den Start gebracht haben. Das Problem war nur D Phoenix, also sie haben das auch integriert. Defoenix war leider nicht freie Software. Sie haben zwar freie Software Komponenten genutzt und haben auch damit geworben, das basiert auf Open Source, das ist ganz offen, aber wenn man dann gesucht hat, den Quellcode oder auch nach Anleitung, wie man sich das Ganze selber deployen kann, selber installieren kann, dann wurde man irgendwie auf die Repositories der Komponentenhersteller verwiesen. Aber es gab eben diesen ganzen Clue Code gab es nicht, diese Integrationen gab es nicht, Es gab keine Anleitung, wie ich das jetzt in meinem Kubernetes Cluster deployen kann vielleicht. Und das war auch so gewollt, denn die wollten eigentlich selber der Betreiber davon sein und niemand anderes sollte das nutzen können. Und das ist so ein klassischer Fall von dem, was wir Open Washing nennen. Also es gibt in dem Fall besonders hart, weil es ein öffentlicher Anbieter auch noch ist, aber das ist etwas, was leider immer wieder passiert, dass eben irgendwelche Hersteller hergehen und haben proprietäre Software und versuchen diese der öffentlichen Verwaltung oder auch anderen, aber sagen wir mal vorwiegend der öffentlichen Verwaltung zu verkaufen und erzählen ihnen, das ist ganz offen, das ist Open Source oder das ist based on Open Source oder so etwas. Und wenn man dann genauer hinschaut, dann ist es das gar nicht, also findet sich der Code nicht oder es gibt irgendwelche Lizenzen, die irgendwelche Hinzufügungen haben oder die ein bisschen anders heißen oder steht, darf nur zu dem und dem Zweck eingesetzt werden. Und das ist ein Riesenproblem, weil wenn der Staat dann, da sind wir jetzt so in der Implementierung von Public Money Public Code, also wenn wir wirklich in diese Richtung schon unterwegs sind und der Staat hat gesagt, ja, ich will freie Software beschaffen, ich will auf diese Art und Weise digital souverän werden, ich schreibe das auch so aus und dann kommen solche Hersteller her und solche Anbieter und hier ist ein offenes Produkt, hier ist ein Based on Open Source Produkt und der Staat sagt, ja cool, das will ich haben, das nehme ich und bekommt aber eigentlich was Proprietäres, was ihn in die nächste Abhängigkeit bringt, wie zum Beispiel in dem Fall in die Abhängigkeit von Daten, dann ist das ein Riesenproblem und unterminiert eigentlich dieses Bestreben nach Public Money Public Code und nach digitaler Souveränität durch freie Software. Was dann aufgefallen ist, also dass eben dort Open Washing stattfindet, verschiedenen Journalisten, aber auch uns als Free Software Foundation Europe. Und wir haben dann eben eine Reihe von Fragen an das Bundesministerium geschickt und haben das öffentlich gemacht, dass dort so ein Open Washing stattfindet, dort diese vermeintlich souveräne Arbeitsplatzlösung eigentlich proprietary ist. Naja, es gab viel hin und her danach. Das Ergebnis ist am Ende, dass defoenix mittlerweile verschwunden ist, also dieses Produkt gibt es nicht mehr und das Zendis hat den Code übernommen und hat ihn eben jetzt tatsächlich als freie Software veröffentlicht. Das ist eben was, was wir als FSFE auch ab und zu machen, dass wir so eine Watchdog Rolle einnehmen. Und wenn wir sehen, dass etwas sehr deutlich in eine falsche Richtung geht, Und Open Washing ist was, was sehr deutlich in die falsche Richtung geht, dass wir dann den Finger in die Wunde legen, das öffentlich machen und auch sagen, so kann das nicht laufen. Und in dem Fall hat es eben."
    },
    {
      "end": 3253740,
      "speaker": "B",
      "start": 3250100,
      "text": "Sehr viel Erfolg gebracht, aber Dave Phoenix hat es dann freiwillig hergegeben, also die."
    },
    {
      "end": 3356300,
      "speaker": "C",
      "start": 3253740,
      "text": "Firma dahinter, das war ja auch mit öffentlichem Geld finanziert, was zum großen Teil auch aus dem Bundeshaushalt kam, über sehr sehr verworrene Kanäle über die Länder dann eben an die Dataport ausgereicht und sie konnten da nicht einfach dann freiwillig, konnten nicht machen, was sie wollten, sondern am letzten Ende G gab es dann schon einen gewissen Druck auch natürlich den Code zur Verfügung zu stellen. Genau das andere, was neben diesem Open Desk, was eben jetzt die freie Software Implementierung von diesem souveränen Arbeitsplatz ist, was es daneben noch gibt von Zendesk, ist das Open Code. Das ist also eine Code Plattform für die öffentliche Verwaltung. Man kann sagen so was ähnliches wie GitHub, aber es gehört eben nicht Microsoft, sondern es gehört der öffentlichen Verwaltung und die öffentliche Verwaltung kann darauf rechtssicher ihre Eigenentwicklung, eben auch das, was sie als freie Software Software beauftragt hat und veröffentlichen möchte, kann sie dort einstellen. Das ist auch eine ganz wichtige Sache, weil es auf eine Art und Weise so die Infrastruktur für digitale Souveränität durch freie Software ist, weil eben auch die Infrastruktur dann in der Hand der öffentlichen Verwaltung ist, dadurch, dass es eben dieses Open Code gibt und man kann damit eben auch eigene Entwicklungen showcasen. Also man kann zeigen, was gibt es schon alles, was passiert schon. Es passiert eben ganz viel. Es gibt dort viele Produkte, die die bereits veröffentlicht sind, so dass andere auch sehen, okay, es gibt ja schon gute Lösungen, ich kann die vielleicht auch in meiner Kommune, in meinem kommunalen Verband oder in meinem Land zum Einsatz bringen und was gut es gibt Kriterien dafür, was dort veröffentlicht werden darf auf opencode und was nicht. Und das ist eben momentan so, dass es also Lizenzvorgaben gibt, eine Liste von Freisoftware Lizenzen, unter denen die dort veröffentlichen Softwareprodukte stehen müssen, dass dort auch wirklich nur Freistoß Software publiziert werden kann."
    },
    {
      "end": 3395670,
      "speaker": "B",
      "start": 3356380,
      "text": "Ich glaube, sowas ist ja auch super geeignet, um dann vielleicht irgendwie Software zu finden, die so grob das macht, was ich eigentlich gerade brauche in meiner Verwaltung und dann vielleicht ja auch drauf komme, OK, vielleicht ist der Prozess in dem anderen Land doch gar nicht so unterschiedlich und vielleicht brauche ich nicht meine kleine Butze, die der Andi zuerst erwähnt hat, die mir genau meinen Flow genau runter programmiert. Not invented here Syndrom und vielleicht kann ich was anderes dann doch ganz einfach anpassen und es funktioniert am Ende auch. Oder wenn ich eine Kleinigkeit noch umstelle, meine im Flow. Ich glaube, das ist ja auch mit dieser neuen Länder, also sorry, bei uns sind es neun Länder, bei euch sind es wie viel? Achtzehn, neunzehn mit Mallorca, je nachdem was man immer mitzählt."
    },
    {
      "end": 3403510,
      "speaker": "A",
      "start": 3395910,
      "text": "Also offiziell sechzehn, sechzehn wirklich offiziell siebzehn, da gibt es auch die Mallorca drüben. Deswegen."
    },
    {
      "end": 3427760,
      "speaker": "B",
      "start": 3406470,
      "text": "Sogar für uns als Miniland, wir haben ja neun Länder und wir sind ja gesamt irgendwie kleiner als Bayern oder so oder zumindest NRW und wir haben da meistens auch immer neun Lösungen. Also gerade bei Corona hat es das auch wieder gegeben. Neun Länder haben neun Lösungen programmiert, weil ja das Testen, zum Beispiel die PCR Tests natürlich in jedem Land anders funktionieren, eh klar, sind ja ganz andere Tests."
    },
    {
      "end": 3513420,
      "speaker": "C",
      "start": 3427760,
      "text": "Und alles funktioniert anders, weil du gerade Corona erwähnst. Das ist ein super Beispiel dafür, wie diese Nachnutzung, die du gerade angesprochen hast, gut funktionieren kann. Also wenn man das von Anfang an richtig denkt, das funktioniert bei der Hundesteuer. Also Kommune A hat eine Hundesteuer Software entwickelt als freie Software und dann stellt Kommune B und C und acht fest. Bei mir funktioniert die Hundesteuer eigentlich gar nicht so viel anders. Ich kann die Software einfach nehmen, bisschen anpassen und habe dann eben ein gutes Produkt oder anpassen lassen. Bei der Corona Warn App jetzt ist das ein super Beispiel dafür, dass so was auch ganz gut funktionieren kann und warum es eben auch so wichtig ist, ein bisschen über den Tellerrand zu schauen und eben nicht nur an meine Kommune, an mein Land, an meine Nation, sondern europaweit oder grenzüberschreitend allgemein zu denken. Denn auch freie Software macht halt auch wirklich nicht an Grenzen halt Und man hat damals sollte zuerst proprietär entwickelt werden, durch zivilgesellschaftlichen Druck, unter anderem von der FSFE ist es dann als freie Software entwickelt worden. Und ja, dadurch hat das dann so super funktioniert, dass eben mit dieser App, mit dieser Corona Warn App man europaweit unterwegs sein konnte und europaweit die Funktionen davon nutzen konnte. Und es hat eben auch das Vertrauen der Menschen befördert. Dadurch, dass der Code transparent war, waren die bereit, dort so doch so sehr sensible Funktionen wie Informationen wie ihren Corona Status einzutragen in die App. Wenn das jetzt ein proprietäres Produkt gewesen wäre, hätten das glaube ich nicht so viele so vertrauensvoll genutzt. Also an der Stelle super Beispiel dafür, Best Practice, wie sowas funktionieren kann."
    },
    {
      "end": 3611790,
      "speaker": "A",
      "start": 3513420,
      "text": "Du hast die Corona App erwähnt und ich habe gerade noch mal nachgeschaut. Ich fand, das war ein gutes Projekt. Ich fand, das war unter der Apache License sogar veröffentlicht, ist auf gitpainup verfügbar, Verlinken wir auch in den Shownotes. Und das, was ich darüber weiß, ist, dass aufgrund, weil der Code öffentlich zugänglich war, hatten auch super viele kritische Leute, besonders mit mehr technischem Verständnis, deutlich mehr Vertrauen dazu. Und es gibt wohl Leute, die haben das ganze Ding mal analysiert und auch sicherheitstechnisch war das alles wohl relativ sophisticated und allem drum und dran. Also ich fand schon, dass das ein tolles Projekt war. Das einzige Manko, was ich sagen würde, ist, ich glaube die Telekom und die und SAP haben das entwickelt, wenn ich mich recht erinnere, die haben sich ein bisschen viel Geld reingefahren. Also die ganze Sache war ein bisschen teuer. Aber hey, wie gesagt, man erfindet immer was zu meckern. Deswegen, wenn das wenigstens Open Source gestellt wird und leider, leider oder glücklicherweise kann man jetzt so drehen, wie man möchte, wurde die Entwicklung der Corona Warn App natürlich eingestellt. Also zum Glück wurde sie eingestellt, weil sie wird nicht mehr benötigt. Leider, weil die Entwicklung natürlich dann jetzt nicht nachhaltig war. Ich weiß nicht, ob ob da noch irgendwelche Verschlüsselungs Libraries oder Kommunikations Libraries aus dieser App irgendwo anders Verwendung finden. Das wäre natürlich dann super und noch nachhaltiger. Aber nun gut, jetzt ist Corona natürlich schon so ein komisches Thema, auch weil der Wolfgang sagte, in den Bundesländern in Österreich hat jeder irgendwie eine andere App gehabt. Wenn wir jetzt mal wieder zurückgehen auf Public Code, Public Money und dann mal auf ganz Europa gucken, gibt es in Europa denn Länder, Staaten, da wo du Wow, die sind schon super weit."
    },
    {
      "end": 3929900,
      "speaker": "C",
      "start": 3611790,
      "text": "Es gibt Success Stories nicht unbedingt auf Ebene der Staaten, aber du hast jetzt nach den Staaten gefragt, deswegen vielleicht zuerst mal da. Da gibt es schon Länder, die weiter sind, was so Vorgaben für Public Money, Public Code angeht. Etwas unerwartet. Vielleicht würde ich an der Stelle Bulgarien nennen. Das hat nämlich eine Regel, dass Neuentwicklungen, sowohl inhouse als auch beauftragte Neuentwicklungen unter einer freien Softwarelizenz veröffentlicht werden müssen. Das sieht übrigens ganz ähnlich ähnlich aus in der Schweiz, wo für den Bund, also es gibt auch diese Embark für den Bund, das gilt nicht für Kantone und Kommunen, die dort in der Schweiz eine wichtige Rolle spielen, aber was der Bund neu entwickelt oder beauftragt, das muss auch unter oder soll unter einer freien Softwarelizenz veröffentlicht werden. Wie gesagt, also in der Schweiz relativ kleiner Geltungsbereich und auch noch unklar dann immer bei solchen Sachen, wie wird das implementiert? Das ist ähnlich und gleichzeitig ein bisschen anders als in Italien, wo es eine Regel schon relativ lang gibt, ich glaube seit Jahren, zwei zwei tausend elf oder zwei tausend dreizehn die vorgibt, dass man prioritär, also free Software first beschaffen soll. Wenn man dann doch eine proprietäre Software beschafft, dann muss man das sehr ausführlich begründen. Es macht einem also Arbeit als öffentliche Verwaltung oder in Frankreich gibt es eine Vorgabe, dass Geltungsbereich, bin ich mir jetzt gerade nicht ganz sicher, aber wo freie Software beschafft werden soll. Man kann sich dafür entscheiden, deine Ausnahme in Anspruch zu nehmen und dann proprietär zu beschaffen. Aber das kann von jedem gerichtlich gechallenged werden und kann in Frage gestellt werden. Bei den meisten dieser Vorgaben, also wenn man jetzt auf Italien zum Beispiel schaut, da gibt es diese Regel, aber es ist nicht so klar, wie wird die eigentlich implementiert? Wer ist für die Einhaltung, für das Monitoring, für die Enforcierung? Gibt es Strafen dafür, wenn man sich nicht dran hält? Und das ist in vielen Ländern dann eben, die schon so weit sind, ja nicht so klar, oder es gibt da eben keine klare Regel. Deswegen ist für uns auch immer wichtig, nicht nur auf solche Vorgaben zu schauen, sondern auch auf die Implementierung. Gibt es da Schlupflöcher? Wie werden die Schlupflöcher genutzt? Was passiert, wenn jemand solche Schlupflöcher nutzt oder wenn man sich gar nicht an die Regel hält? Und das ist also noch ein ziemlich weiter Weg, den man da zu gehen hat, bis solche Sachen dann auch zu einem größeren Effekt führen und eben dazu, dass auch wirklich freie Software beschafft wird. Ich würde noch Dänemark erwähnen an der Stelle. In Dänemark gibt es zurzeit eine ganz große Debatte um die digitale Souveränität der öffentlichen Verwaltung. Dadurch, dass dort die Vereinigten Staaten, namentlich der Präsident, gewisse Begehrlichkeiten in Bezug auf Grönland geäußert hat und auch klargemacht hat oder klargemacht wurde, dass möglicherweise die digitale Abhängigkeit dort als Druckmittel genutzt werden könnte. Und deswegen gibt es gerade ein sehr großes öffentliches Interesse an diesen Fragen. Und solche Themen, solche aktuellen Momentums oder solche aktuellen Debatten machen dann eben oft oftmals ein Unterschied, wo man so ein Gelegenheitsfenster, so ein Window of Opportunity hat, diese Debatte zu beeinflussen und zu OK, freie Software ist die Lösung. In Dänemark versuchen wir das auf jeden Fall. Wollen wir auch nächstes Jahr eine Veranstaltung zu Public Money Public Code durchführen, um dort die Debatte in diesem Sinne für freie Software zu beeinflussen. Denn man muss auch gleichzeitig sagen, wenn über digitale Souveränität geredet wird und das ist ja auch in Deutschland so, dass viel über digitale Souveränität geredet wird, gab ja zum Beispiel erst vor zwei Wochen diesen Digital Gipfel der Bundesregierung, dann versteht aber jeder was ganz anderes drunter. Und es gibt spätestens seit dem dragireport, dieser Report, der letztes Jahr erschienen ist, gibt es so ein neues Narrativ. Das heißt also, wir können digitale Souveränität eigentlich erreichen, indem wir einfach nur europäische Software kaufen. Also bei European ist so ein Schlagwort und da stellt sich natürlich auch viele Industrie dahinter und lobbyiert das, die proprietär produziert und ihre Produkte einfach aus Europa an den Markt bringen will, an den Mann, an die öffentliche Verwaltung bringen will. Die stärken dieses Narrativ sehr stark und das ist ein bisschen schwierig. We natürlich, wenn die öffentliche Verwaltung sich darauf einlässt und der Staat, dann gerät sie im Zweifelsfall von einer Abhängigkeit in die andere. Also wenn sie jetzt einfach nur proprietäre Software aus Europa kauft, was passiert dann eigentlich, wenn der Anbieter aufgekauft wird aus dem Ausland? Was passiert, wenn der bankrott geht? Was passiert, wenn der eine Monopolstellung erlangt und seine Preismodelle in Richtung Mond treibt? Was passiert, wenn er sich entscheidet ins Ausland abzuwandern? Also man ist eigentlich dann in einer neuen Abhängigkeit drin und deswegen sagen buyeuropean alleine reicht nicht, sondern es muss eben auch freie Software sein. Ich glaube zu sagen buyeuropean ist eine dumme Idee, das wird nicht verfangen, weil ich glaube, dieses Narrativ ist sehr stark und für viele Politiker und Entscheidungsträger sehr, sehr unmittelbar einleuchtend. Man sollte national beschaffen oder europäisch beschaffen. Deswegen sagen okay, kann man machen, aber bitte dann eben auch freie Software. Und das ist für uns ganz wichtig, dass wir diese digitale Souveränitätsdebatte in diese Richtung beeinflussen. Auch da ist es noch ein langer Weg. Also auf dem Gipfel der Europäische Digital Sovereignty Summit, der da in Berlin vor zwei Wochen stattgefunden hat, da fiel das Wort, da war viel Industrie da und es fiel das Wort Open Source nach zweieinhalb Stunden zum ersten Mal und es blieb am Ende dem Bundeskanzler nach sechs Stunden Veranstaltungen seiner Abschlussrede überlassen, zum ersten Mal die frei Softwareprojekte des Bundes zu erwähnen, also Zeniz mit opencode und Open Desk zu erwähnen. Ja, das ist eben noch ein sehr weiter Weg, bis auch da klar wird, digitale Souveränität geht nur mit freier Software."
    },
    {
      "end": 3951700,
      "speaker": "B",
      "start": 3929900,
      "text": "Jetzt hast du schon gesagt, es ist ein langer Weg und du hast ja auch schon die ersten ein hundert Tage beschrieben von der Regierung. Ich glaube, dazwischen ist wahrscheinlich wenig passiert. Wenn du jetzt in die Zukunft blickst, was rollt denn auf uns zu? Gibt es irgendwelche positiven Bewegungen? Gibt es auf europäischer Ebene irgendwelche Dinge, die positiv sind oder bewegt sich gar nichts? Wie blickst du in die Zukunft? Was haben wir zu erwarten in nächster Zeit?"
    },
    {
      "end": 4089550,
      "speaker": "C",
      "start": 3951700,
      "text": "Also zum einen würde ich sagen, diese Debatte über digitale Souveränität ist eine, die wird die nächste Zeit nicht weggehen. Ich glaube, die geopolitische Konstellation ist so, dass das eine Debatte ist, die bleiben wird und das heißt, es bleibt auch die Chance, das in diesem Sinne von Public Money, Public Code zu beeinflussen und in diese Richtung zu framen und zu bewegen. Zum anderen auf europäischer Ebene ist gerade die schon erwähnte Vergabereform sehr wichtig, die geht jetzt los. Da erwarten wir, da gab es jetzt erstmal auch so Konsultationsverfahren, da erwarten wir, dass im Laufe des nächsten Jahres von der Kommission ein Aufschlag passiert und danach wird es dann ungefähr ein Jahr dauern, bis das durchs Parlament und durch den Rat und durch den Trilog gegangen ist. Und danach kommen noch zwei Jahre, wo dann Implementierung durch die Mitgliedsstaaten erfolgen muss, Also so ein Zeitraum von fünf bis sechs Jahren. Da erwarten wir, dass proprietäre Industrie sehr viel Lobby, sehr viel Geld da drauf wirft, um das in ihrem Sinne zu beeinflussen. Wir bleiben da aber auf jeden Fall dran und werden ganz klar versuchen, dort eine strategische Präferenz von Freisoftware zu ermöglichen bei der Beschaffung und eben auch eine Vorgabe entsprechend zu beschaffen. Das ist eine ganz wichtige Gesetzgebung. Andere Sachen, die momentan sehr wichtig sind und auch wichtig bleiben, ist die Finanzierung von freier Software. Es gab früher ja mal so Debatten oder Argumente, die vorgebracht wurden, mit freie Software kann der Staat Geld sparen, wenn er auf Public Money, Public Code setzt, dann wird alles billiger, weil das gibt es ja alles umsonst ist ja auch freie Software wie in freiem Bier. Nee, das ist natürlich nicht so und das ist auch nicht der Sinn der Sache, sondern es geht darum, strategisch zu beschaffen und das, was man bekommt, also die digitale Souveränität, diese vier Freiheiten, das sollte man sich auch was kosten lassen. Gleichwohl muss es jetzt nicht unbedingt mehr Geld sein. Aber wenn man anfängt, das, was eben jetzt für proprietäre Lizenzen ausgegeben wird, in zunehmenden Anteilen in Richtung freie Software umzulenken, dann profitiert davon dieses ganze Ökosystem. Und aufgrund der vorhin schon erwähnten Marktgestaltung des europäischen Marktes mit seinen vielen kleinen mittleren Unternehmen, profitiert davon eigentlich auch der Standort Deutschland und Europa. Das ist momentan ist die Lage so, dass viele öffentliche Finanzen für frei Software durch so was wie Pilotprojekte fließen. Also es gab da zum Beispiel, oder es gibt zurzeit noch das NGI, das Next Generation Internet Program, was unter Horizon Europe lief und dort sind eben viele freie Softwareprojekte finanziert worden, die."
    },
    {
      "end": 4183989,
      "speaker": "C",
      "start": 4091150,
      "text": "Technologien für ein Internet der Zukunft, was viel offener ist, auf Freisoftware beruht und Dezentralität beruht, entwickelt werden. Das Problem ist, das sind immer solche kurzfristigen oder relativ kurzfristigen Projekte, die dann laufen, die vielleicht über zwei, drei, vier Jahre laufen und danach müssen sie verlängert werden. Das passiert dann oft nicht. Oder es passiert eben auch das, was jetzt passiert ist bei NGI. Plötzlich reden alle über KI, dann ist das NGI Geld plötzlich weg, wird nicht verlängert und fließt anstatt dessen in Projekte für künstliche Intelligenz. Und das hat uns gezeigt, dass diese kurzfristigen Finanzierungen absolut nicht nachhaltig sind, auch im Sinne der freien Software, die wir für die öffentliche Verwaltung so dringend brauchen. Deswegen lobbyieren wir oder versuchen wir gerade auch wenn jetzt dieser nächste siebenjährige Haushalt der EU verabschiedet wird in zwei Jahren, versuchen wir da eine längerfristige, eine langfristige sichere Finanzierung für freie Software reinzubekommen, die auch aber nicht nur über Vergabe läuft, sondern auch, dass es eine Finanzierung für Core Infrastructure gibt, also für die vielen freie Software Komponenten, die an der Basis der technologischen Infrastrukturen, die unser Stück Staat nutzt, eingesetzt werden, das muss finanziert werden. Da sind viele auch kleine Unternehmen, da sind auch viele Einzelentwickler, viele Initiativen dabei und sowas muss finanziert werden und muss dadurch gesichert werden. Ansonsten, es gibt ja dieses berühmte Bild von XKCD, das kennt ihr vielleicht, wo also ein riesiger Stack ist und unten drunter ist eine kleine Komponente und wenn die eben wackelt und die wackelt eben, wenn sie nicht gut finanziert wird, dann fällt alles in sich zusammen."
    },
    {
      "end": 4214750,
      "speaker": "A",
      "start": 4184069,
      "text": "Ja, dieses Bild wurde ja vor kurzem etliche Male weiterentwickelt. Da gibt es inzwischen zehn Versionen von. Die habe ich mal alle gesammelt und findest du in unserer Discord Community im Meme Channel. Da habe ich die alle, ist ein bisschen explodiert. Am Ende einer solchen Episode fragen wir immer, was ist der Call to Action, was können wir tun? Ich bin jetzt motiviert mal an der ganzen Sache mitzuwirken, weil anscheinend, also ich habe heute gelernt, es ist nicht so einfach wie Chemie vorstelle oder es wird."
    },
    {
      "end": 4216950,
      "speaker": "B",
      "start": 4215550,
      "text": "Immer so, Andi, bei dir, wenn du."
    },
    {
      "end": 4218790,
      "speaker": "C",
      "start": 4216950,
      "text": "Dir was vorstellst oder es wird künstlich."
    },
    {
      "end": 4228749,
      "speaker": "A",
      "start": 4218790,
      "text": "Aufgebläht oder alle machen was falsch, außer ich, ich weiß es nicht. Nein, ich weiß nicht die Frage, Johannes, was kann ich tun? Was ist die Rolle der Community, welchen Beitrag kann ich leisten?"
    },
    {
      "end": 4494730,
      "speaker": "C",
      "start": 4228750,
      "text": "Danke für die Frage. Auf jeden Fall würde ich sagen, jeder, der in irgendeiner Form zu einem Freisoftware Projekt beiträgt, der in irgendeiner Form dazu beiträgt, dass freie Software besser wird, der leistet einen Beitrag, der macht die Software besser, die dann auch in öffentlichen Verwaltungen eingesetzt werden kann. Das kann natürlich als Techie durch entwickeln sein, es muss aber gar nicht sein. Also man kann auch übersetzen, man kann auch als jemand, der jetzt nicht entwickeln kann, Issues feilen oder sowas. Es gibt da viele Möglichkeiten, Das ist das eine. Also man kann tatsächlich technisch irgendwo mitmachen und mithelfen. Man kann auf Open Code gehen und kann gucken, was gibt es da, was gibt es da für Projekte, wo kann man sich beteiligen. Man kann sich natürlich auch politisch engagieren oder auch so ein bisschen aktivistisch engagieren. Also viele von unseren Volunteers, von unseren Ehrenamtlichen, die in der FSFE mitarbeiten und wir haben ganz viele Ehrenamtliche in ganz Europa, die mitarbeiten und wir freuen uns aber auch immer, wenn es noch mehr werden, weil das stärkt uns und das stärkt unsere Message. Viele von denen haben technischen Hintergrund und wir brauchen wirklich auch Menschen, die sich gut auskennen und ihre Expertise einbringen. Aber auch bei uns kann jeder mitmachen und jede mitmachen, auch wer sich nicht technisch auskennt. Es hilft zum Beispiel, wenn man das Public Money Public Code, diesen offenen Brief unterzeichnet auf Public Code, den wir haben. Da gibt es jetzt schon fast Unterzeichner, aber es ist gut, wenn das immer noch mal einige mehr werden. Man kann dann auch anklicken, ich möchte Informationen bekommen. Dann bekommt ihr so fünf bis sechs Mal im Jahr eine kurze Status Update Mail, was so in dem Bereich mit Public Money Public Code los ist. Ihr könnt natürlich in eurer Bubble das verbreiten und den Leuten erklären, warum freie Software für die öffentliche Verwaltung wichtig ist und warum sie auch gut ist. Ihr könnt eurem Abgeordneten schreiben, ihr könnt einen Stand bei einer Konferenz organisieren, einen FSFE Stand oder dort über Public Money Public Coach sprechen. Ihr könnt auch zum Beispiel, das machen jetzt gerade viele, es gibt also von der Free Software Foundation Europe, Matthias Kirschner von uns hat ein Buch geschrieben, Ada und Zangemann, das erklärt so ganz gut für ganz junge Menschen, also für Kinder, aber auch für Leute, die vielleicht sich überhaupt nicht mit dem Thema auskennen. Das ist ein bebildertes Buch, erklärt ganz gut mit einer schönen Geschichte verpackt von einem Mädchen, was beginnt sich für Technik zu interessieren, warum eigentlich freie Software für die Gesellschaft und für die öffentliche Verwaltung enorm wichtig ist. Ganz viele Leute, das gibt es glaube ich mittlerweile, oh Gott, ich weiß gar nicht wie vielen Sprachen, aber schon deutlich über zehn Sprachen und man kann davon Lesungen organisieren, das machen ganz viele Leute und kann vor einer, ja, also vor einer Schule lesen, in der Bibliothek lesen und kann danach mit den Kindern, die sich das anhören, diskutieren oder kann auch danach mit den Eltern, die gekommen sind, eine Diskussion über Public Money Public Code führen. Das kannst du so ein bisschen auf eine politische Ebene ziehen. Also es gibt eine wirklich diverse Bandbreite von Aktivitäten, wie man sich bei dem Thema einbringen kann. Ein anderes Es gibt zurzeit diese End of zehn Kampagne, wo es darum geht, zum Ende von Windows zehn die Leute da zu motivieren, auf Windows elf umzusteigen. Nein, eben nicht auf Windows elf umzusteigen, sondern auf Linux umzusteigen. Oh Gott, bitte rausschneiden, Kein lustiger Versprecher. Doch ein bisschen. Also die Leute zu motivieren, auf Linux umzusteigen und eben auch dabei Support zu leisten, gibt es solche kleinen Events im Rahmen von der End of Ten Kampagne man auch ein Event organisieren kann und Leute dabei unterstützen können, ihre eigene Infrastruktur zu befreien. Und ich würde sagen, was natürlich wichtig ist, unterstützt die Free Software Foundation Europe durch eine monatliche Spende. Das ist für uns total wichtig, weil wie ich vorhin schon gesagt habe, habe, wir sind als zivilgesellschaftliche Organisation von vielen kleinen Spenden abhängig. Das ist auch nicht immer leicht. Also auch vor dem Hintergrund der wirtschaftlichen Lage ist es für uns wirklich wichtig, dass wir diese Spenden bekommen. Wenn ihr uns noch nicht unterstützt, dann geht auf FSFE Org, donate, ihr verlinkt das bestimmt auch unten und klickt dort dreimal und spendet uns monatlich. Da ist jeder Betrag wirklich sehr, sehr willkommen. Denn uns ist auch klar, dass wir mit dieser ganzen Public Money Public Code Initiative sehr, sehr dicke Bretter bohren und das ist nicht so sehr sein wird, dass wir in anderthalb Jahren schon am Ziel sind und europaweit in allen Ländern ein hundert Prozent freie Software in öffentlichen Verwaltungen haben werden. Aber umso wichtiger ist es, dass wir als Zivilgesellschaft, als FSFE und eben auch als Community, als viele Ehrenamtliche an dem Thema dranbleiben und darauf hinwirken und das kostet einfach auch immer wieder Geld und deswegen ist es total wichtig, diese Unterstützung von unseren Supportern zu haben. Deswegen bitte, bitte unterstützt uns auf diese Art und Weise. Das ist super, super, super wichtig."
    },
    {
      "end": 4571870,
      "speaker": "A",
      "start": 4494730,
      "text": "Johannes, vielen lieben Dank. Ich habe das Gefühl, du hast mich in der letzten Stunde relativ weit aus meiner eigenen Bubble rausgerissen. Du hast mich vielleicht auch so ein bisschen ermutigt, mal dem Duisburger Bürgermeister eine E Mail zu schreiben, um einfach mal zu Wie sieht das denn hier eigentlich aus mit Open Source im Rathaus? Und vielleicht kriege ich eine Antwort. Ich bin gespannt. Naja, vielen lieben Dank für diesen Exkurs. Ich weiß, Politik, Musik ist nichts. Für mich war es noch nie und das wird es nach dieser Episode auch nicht werden. Dennoch werde ich mir einmal die ganzen Ressourcen, die wir auch in den Shownotes zusammengetragen haben, zu Gemüte führen, besonders wie ich da auch mal helfen kann, das ganze Thema weiter zu pushen. Vielleicht hilft es ja dabei, etwas Wissen zu teilen, wie man eigentlich in Open Source arbeitet. Vielleicht kriegt dann der eine oder andere Politiker, der vielleicht auch hier zuhört, Wer ist das schon mal eine neue Idee. Für alle Leute, die sich bei der Free Software Foundation Europe auch mal beteiligen wollen, haben wir natürlich auch einen Contribute Link in den Show Notes verpackt. FSFE org Contribute neben ganz vielen anderen Links, wie zum Beispiel zu Open Desk, zu opencode, zu der News, dass das österreichische Bundesheer auf libreoffice umstellt, die Software Repositories zur Corona Warn App. Wer sich also mal in das Jahr zwei tausend drei und zwanzig zurückwerfen möchte, kann da auch mal gerne den Code noch mal ein bisschen lesen."
    },
    {
      "end": 4575310,
      "speaker": "B",
      "start": 4572110,
      "text": "Du sollst diese Links bewerben, nicht negative Stimmung machen."
    },
    {
      "end": 4612310,
      "speaker": "A",
      "start": 4575310,
      "text": "Ich habe gesagt, also ich fand das Projekt eigentlich ganz gut, war ein bisschen teuer, aber wie gesagt, ich finde immer was zu meckern, aber auch Ada und Zangenmann, das Märchen, was Johannes erwähnt hat. Lustigerweise warte ich eigentlich nur darauf, dass mein Patenkind sechs Jahre alt wird, weil das Buch ist ab sechs und ich warte auch schon Kinderbücher zu Alan Turing an sie verschenkt. Von daher sehr gut, ich mache da bereits Vorarbeit. Naja, vielen Dank Johannes, war schön, dich hier zu haben und ich glaube, wo trifft man dich an? Auf der Fosdem, soweit ich weiß, Auf."
    },
    {
      "end": 4626390,
      "speaker": "C",
      "start": 4612310,
      "text": "Der Fosdem auf jeden Fall. Ansonsten Chemnitzer Linux Tage wieder. Auf der frostcon bin ich immer unterwegs. Also genau, sprecht, kommt einfach am FSFE Stand vorbei, sprecht mich an, wenn ihr noch Fragen habt und ihr könnt mir auch gerne eine E Mail schreiben. Euch, Andi und Wolfi, auch ganz herzlichen Dank, hat viel Spaß gemacht mit euch."
    },
    {
      "end": 4632650,
      "speaker": "B",
      "start": 4626630,
      "text": "Vielen lieben Dank, schöne Unterhaltung mit viel neuen Inhalt und wenn Österreich dabei ist, bin ich natürlich immer noch klar, ausnahmsweise."
    },
    {
      "end": 4634410,
      "speaker": "A",
      "start": 4632810,
      "text": "Wir hören uns nächste Woche wieder und."
    },
    {
      "end": 4637610,
      "speaker": "C",
      "start": 4634410,
      "text": "Tschüss, ciao, ciao, macht's gut, hat mich gefreut."
    }
  ],
  "webhook_auth": false
}