{
    "acoustic_model": "assemblyai_default",
    "audio_duration": 695,
    "audio_url": "https://cloud.inlupus.at/s/FoNesYMbRk9qwSy/download",
    "auto_chapters": false,
    "auto_highlights": false,
    "auto_highlights_result": {},
    "confidence": 0.9603696,
    "content_safety": false,
    "content_safety_labels": {
        "status": "unavailable"
    },
    "custom_topics": false,
    "disfluencies": false,
    "dual_channel": false,
    "entity_detection": true,
    "filter_profanity": false,
    "format_text": false,
    "iab_categories": true,
    "iab_categories_result": {},
    "id": "7fedfac9-0079-4778-9028-32b0e952d0b1",
    "language_code": "de",
    "language_detection": false,
    "language_model": "assemblyai_default",
    "punctuate": true,
    "redact_pii": false,
    "redact_pii_audio": false,
    "sentiment_analysis": false,
    "speaker_labels": true,
    "speakers_expected": 3,
    "speed_boost": false,
    "status": "completed",
    "summarization": false,
    "throttled": false,
    "utterances": [
        {
            "end": 53410,
            "speaker": "A",
            "start": 4240,
            "text": "Willkommen zum Engineering Kiosk Adventskalender. Es ist mal wieder Zeit für ein neues Türchen und weil Weihnachten natürlich auch das Fest der Liebe genannt wird, dachten wir uns dieses Lass uns doch mal wieder etwas Liebe mit der deutschsprachigen Tech Podcast Szene teil. Diese Episode ist eine solche Episode und sie kommt nicht von den Standard Engineering Kiosk Hosts Wolfgang oder mir. Mein Name ist Andy, sondern wir lassen uns den Engineering Kiosk mal für einen Tag aus der Hand nehmen. Heute übernimmt ein befreundeter Podcast das Mikro und bringt ihm ein paar neue Perspektiven, ein anderes Thema und vielleicht den ein oder anderen Gedanken, der über unsere eigene Bubble hinausgeht. Wir denken da draußen gibt es großartige Tech Podcasts, die unbedingt mehr Aufmerksamkeit verdienen und wir denken Wissen, Inspiration und gute Geschichten sollte man am besten teilen, also zurücklehnen, neugierig sein. Heute mit Andi vom Happy Boots Wrapping Podcast. Los geht's, viel Spaß."
        },
        {
            "end": 650800,
            "speaker": "B",
            "start": 54940,
            "text": "Hallo und herzlich willkommen zu HE. Ach ne, wir sind ja hier beim Engineering Kiosk. Ja, mein Name ist Andreas Lehr oder auch Andy und ihr kennt mich vielleicht vom Happy Bootstrapping Podcast. Ich hatte schon mal den Wolfi zu Gast. Vielleicht verlinkt man die Folge auch und auch immer wieder Kontakt zum Andi wegen diversen Themen aus der IT Welt und er hat mich gefragt, ob ich nicht eine Episode herbei steuern kann. Und hier ist sie nun. Und heute geht es um Trust Battery oder die Vertrauensbatterie. Und die ist ein Hilfsmittel, um Vertrauen zwischen Men, Menschen oder auch Menschen und Maschinen sich vorzustellen, zu visualisieren. Wo kommt das Ganze her? Ursprünglich mal, oder ich habe es zuerst gesehen bei Shopify und zwar beim Tobi Lüdke, dem deutschen Gründer, das wisst ihr vielleicht, der hat es etabliert in seinem Management Team, damit die Menschen sich besser vertrauen. Ganz einfach gesagt. Und was besagt es bei ihm oder wie hat er damit angefangen? Wenn Menschen neu bei Shopify anfangen und es ist auch egal, ob die im Management anfangen oder im komplett anderen Level, dann fangen die mit fünfzig Prozent Leute Ladestand an. Es gibt Aktivitäten, mit denen kann man die Batterie laden und Vertrauen aufbauen und es gibt Aktivitäten, die entladen eine Batterie, Also was wir aber von Batterien ja häufig wissen, gerade auch bei E Autos oder auch grundsätzlich die Batterie zu laden dauert viel, viel länger wie das Entladen. Und das ist auch mit das Wichtigste von der ganzen Geschichte. Was ist noch wichtig? Daran Vertrauen ist immer was Persönliches zwischen zwei Menschen oder zwischen zwei Personen, nie zwischen drei. Also Vertrauen kann man nur, weil ich dem Andi vertraue, vertraue ich nicht dem Wolfi. Oder nur weil der Wolfi dem Andi zu acht und neunzig Prozent vertraut, vertraut er jetzt mir nicht, nur weil wir uns über zwei Ecken kennen. Es geht immer um zwei Personen, die ein Vertrauensverhältnis haben. Ich hatte mal eine Präsentation gemacht und da habe ich natürlich Game of Thrones als Beispiel genommen. Und wer das nicht gesehen hat, der sollte es auf jeden Fall mal anschauen. Da gibt es auf jeden Fall drei Geschwister, einmal den Tyrion, dann die Jaime Lannister und die Cersei, das ist die Schwester. Und die haben während der Serie alle ein komplett unterschiedliches Vertrauensverhältnis miteinander. Oder auch der Tyrion mit seinem Vater am Anfang denkt, naja, zwischen die zwei geht nichts dazwischen, aber das kommt dann doch etwas anderes. Und es gibt natürlich viele Aktivitäten, die das Vertrauen beeinflussen und die Batterie eben entsprechend laden oder auch entladen. Und das Wichtige daran ist, zumindest laut Studien, die Batterie dauert fünfmal länger zum Laden, wie sie zu entladen. Also wenn ihr was Negatives zu jemandem sagt, dann hat es immer auch eine Konsequenz, einen Vertrauensverlust und das Ganze wird dann eben schlimmer und es dauert viel, viel länger, das Vertrauen wieder aufzubauen, wie es zu verspielen. Das ist auch eine ganz, ganz wichtige Sache im Umgang mit Menschen. Und Vertrauen, egal ob du jetzt eine Führungskraft bist oder vielleicht das im Freundeskreis auch schon mal beobachtet hast oder dahin übertragen kannst, das ist eine elementare Geschichte bei Vertrauen. Und eben, dass Vertrauen nicht übertragbar ist, das habe ich ja mit dem Beispiel schon erzählt, also mit dem Beispiel mit dem Andi und Wolfi, aber auch bei Game of Thrones, wenn jemand Neues zum Beispiel in euer Unternehmen kommt, der empfohlen wurde oder die von einem Kollegen, dann hat er vielleicht schon eine Vertrauensbatterie mit demjenigen, weil sie sich vielleicht von einem vorherigen Arbeitgeber kennen, aber alle anderen haben das eben nicht. Also das kann man eben nicht übertragen und das Vertrauen muss da entsprechend neu aufgebaut werden. Schön ist es natürlich, wenn die Vertrauensbatterie sehr hoch geladen ist, weil dann kann man sich auch mal einen Ausrutscher erlauben. Das kennt ihr wahrscheinlich auch von Situationen, sowohl in der Firma wie auch im Privaten. Natürlich darf man es damit aber auch nicht übertreiben. Was ist, wenn das Kind mal in den Brunnen gefallen ist? Also wenn man so eine Low Trust Situation hat, also das Vertrauen mal verloren ist, das kennt ihr vielleicht auch. Man überinterpretiert gewisse Dinge, die der Gegenüber oder die Gegenüber sagt. Man stellt die automatisch in ein schlechteres Licht, wie sie vielleicht sind. Man hört überall vielleicht Skepsis raus, man liest zwischen den Zeilen, macht viel mehr auf Tonalität und Konversationen. Die werden fast zu so einer Art Meme Feld, wo man ständig Dinge falsch versteht oder missinterpretiert. Und man nennt es, im Englischen ist es so eine Todesspirale des Vertrauens, eine death spiral of trust oder so ein Trust Hole. Und das ist auch gar nicht so einfach, da wieder rauszukommen. Noch viel schlimmer wird es dann, wenn man diese Dinge woanders mit hinträgt und ein Gegenüber dann von Geschichten berichtet und sich da dann noch mehr reinsteigert oder an Situationen aufhält und und das Vertrauen dann wird immer schwieriger in die Person, mit der das passiert. Gerade in der Remote Kultur ist es auch super schwierig, weil natürlich in geschriebenen Worten auch viel falsch interpretiert werden kann, wenn man eben keine Gestik und Mimik dazu sieht. Und manchmal ist es einfach besser, dann den Gegenüber anzurufen und nicht alles auf die Goldwaage zu legen. Ich drücke vielleicht Dinge anders aus wie mein Kollege. Und manchmal, wenn man dann auch noch auf Englisch schreibt als Nicht Native Speaker, dann können die verloren gehen. Was kann man jetzt machen, um aus solchen Situationen wieder rauszukommen? Zunächst kann man vielleicht das Gespräch damit beginnen, indem man anerkennt, dass man sieht, dass die Situation gerade schwierig ist. Also ich tue mir schwer damit, irgendwas zu sagen oder ich habe gerade eine schwere Zeit mit dem Dilemma, in dem wir stecken. Und dann kann man eben auch überkommunizieren. Den Begriff kann ich so gar nicht. Aber im Englischen ist es eben over communicate und overcompensate. Also man könnte jetzt zum Beispiel sagen, wenn man sich was anschaut, hey, dir fehlen da ein paar Daten, kann man auch weniger direkt sagen. Aus meiner Sicht sieht es vielleicht so aus, als fehlen da ein paar Daten. Siehst du denn das ähnlich? Es hört sich halt komplett anders an. Man muss sich natürlich immer gucken, dass man niemand auf die Füße tritt, wenn man sowas macht. Man kann auch den Spieß ein bisschen umdrehen und den positiven Intent dann formulieren. Wenn man zum Beispiel sich Conversions von einem E Commerce Shop anschaut und dann den Kollege fragt, warum ist eigentlich die Conversion so low? Kann man auch sagen, die Nummer sieht irgendwie kleiner aus wie sonst. Ich überlege mir, ob wir da hier irgendein Problem haben. Haben wir irgendwas ausprobiert, einen Fehler gemacht oder hast du vielleicht eine andere Idee oder Input zu dem Thema. Wichtig daran, man braucht eben fünf positive Reaktionen, um eine negative Interaktion zu überdecken. Also auch hier wieder fünfmal so viel Aufwand, um eine negative Situation wieder ins Positive zu kippen oder die Batterie eben wieder zu laden. Wenn sie durch eine Aktion entladen, ist das eben wie in jeder Beziehung, die man so hat mit Menschen oder mit Freunden oder vielleicht auch mit dem Partner. Das ist immer Arbeit. Es funktioniert einfach nicht, ohne die Batterie zu laden, ist für alle etwas Arbeit. Und wenn man sich das im Kopf behält, ist es wichtig. Kurz noch ein paar Sätze, ob wir das Ganze auf Maschinen übertragen können. Da scheiden sich ein bisschen die Geister. Muss man sich halt überlegen. Wenn du jetzt hier Cloud Provider anschaust oder andere, der eine schwört vielleicht auf Google Cloud und der Kollege, der neu kommt, der hat eben in der Paris Region gehostet, in der es schon, ich glaube im Juni vier und zwanzig oder so war das. Ich suche es auf jeden Fall raus und dann können die beiden das verlinken. Gab es da einen Ausfall von einer kompletten Region? Da ist jetzt wahrscheinlich das Vertrauen zu der Google Cloud dann bei dem eher gestört, wenn ich so eine Erfahrung noch nicht gemacht habe und es ist auch wahnsinnig schwierig, die dann wieder zu kitten und woanders anzufangen. Oder jetzt gerade eine Situation, die mir aus der Praxis immer einfällt, Wenn Incidents passieren und dir ist was ausgefallen oder es gibt das eine System, das immer wieder ausfällt, dann etabliert sich im Kopf, wenn es einen Ausfall gibt, hey, das liegt doch bestimmt wieder an dem System, weswegen wir schon acht Mal Probleme hatten. Und das ist eben sehr gefährlich bei dem Thema Incidents und dem Vertrauen oder auch dem Nicht Vertrauen in den Dienst, weil die muss man eigentlich immer wieder so behandeln, als sind sie komplett neu und man fängt auf der grünen Wiese an, weil beim neunten Mal kann es vielleicht ein DNS Problem sein und nicht die Anwendung selber und man schaut eben gar nicht mehr genau hin, weil man, wenn man den Alert sieht, schon denkt, ach komm, da muss man wahrscheinlich wieder ABC machen und dann ist es erledigt. Oder ich warte auf meinen Dienstleister, der sich drum kümmert. Also auf Incidents übertragen und Reliability finde ich eher schwierig, weil eben sich die Dinge nicht immer eins zu eins wiederholen und man dann manchmal anfängt an der falschen Stelle zu schauen. Also das muss man einfach im Hinterkopf behalten. Im Prinzip war es das auch schon zum Thema Vertrauensbatterie. Also wenn ihr jetzt nur zwei, drei Sachen euch merken wollt, dann beim Thema Vertrauen ist wichtig, dass es immer individuell ist, also immer zwischen zwei Menschen und nie über so eine Dreiecks oder Vierecksbeziehung. Es ist immer persönlich die Vertrauensbatterie zu laden dauert viel, viel länger, wie sie zu entladen und ob das Ganze auf Maschinen übertragen werden kann oder eben wie wir Diensten und Maschinen vertrauen, das bleibt dir überlassen. Ich bin da eher skeptisch, aber lass mich doch gerne wissen. Meinen Kontakt findest du in den Shownotes. Ich bin der Andi von Happy Bootstrapping, einem Podcast über Bootstrapping. Da interviewe ich Bootstrapped Startup Solo Founder. Ich glaube ein, zwei waren auch schon hier im Engineering Kiosk und ansonsten schreibe ich auf alles nurgecloud com, einen deutschen Newsletter zum Thema Cloud, Open Source, was uns da so bewegt, Incidents, Remote Arbeit, Kultur und vielen weiteren Dingen. Würde mich freuen, wenn du mal vorbeischaust oder mir ein kurzes Feedback auf diese Episode sendest. Vielen Dank fürs Zuschauen, Zuhören, mach's gut, bis bald. Ciao, ciao."
        },
        {
            "end": 683370,
            "speaker": "A",
            "start": 651280,
            "text": "Hier ist wieder Andi vom Engineer Kiosk. Das war es auch schon wieder mit dem heutigen Adventskalendertürchen, präsentiert von unseren Freunden aus der deutschsprachigen Tech Podcast Szene. Wenn dir gefallen hat, was du gehört hast, hör unbedingt doch mal dort rein. Supportet die Leute, die gute Inhalte machen. Die Links zum Episodenthema, aber auch zu dem Podcast findet ihr natürlich wie immer in den Shownotes. Und wenn du Lust hast, dich mit ganz vielen Gleichgesinnten auszutauschen, schau doch mal in unserer Engineering Kiosk Discord Community vorbei. Dort hängen Entwickler und Entwicklerinnen, Architektinnen, Datenmenschen und Tech Nerds aller Art rum. Genau wie du, genau wie Wolfgang Genauso wie ich."
        },
        {
            "end": 684650,
            "speaker": "C",
            "start": 683370,
            "text": "Ihr wisst schon, was wir meinen."
        },
        {
            "end": 689970,
            "speaker": "A",
            "start": 684650,
            "text": "Wir hören uns bei der nächsten Episode wieder. Bis dahin frohe Weihnachten und eine wunderbare Adventszeit. Bis bald."
        }
    ],
    "webhook_auth": false
}