{
    "acoustic_model": "assemblyai_default",
    "audio_duration": 526,
    "audio_url": "https://cloud.inlupus.at/s/bDYP6D5fbYgQy8Y/download",
    "auto_chapters": false,
    "auto_highlights": false,
    "auto_highlights_result": {},
    "confidence": 0.96614444,
    "content_safety": false,
    "content_safety_labels": {
        "status": "unavailable"
    },
    "custom_topics": false,
    "disfluencies": false,
    "dual_channel": false,
    "entity_detection": true,
    "filter_profanity": false,
    "format_text": false,
    "iab_categories": true,
    "iab_categories_result": {},
    "id": "643d88cd-3618-425d-8c4f-45699d2c0242",
    "language_code": "de",
    "language_detection": false,
    "language_model": "assemblyai_default",
    "punctuate": true,
    "redact_pii": false,
    "redact_pii_audio": false,
    "sentiment_analysis": false,
    "speaker_labels": true,
    "speakers_expected": 3,
    "speed_boost": false,
    "status": "completed",
    "summarization": false,
    "throttled": false,
    "utterances": [
        {
            "end": 53000,
            "speaker": "A",
            "start": 3840,
            "text": "Willkommen zum Engineering Kiosk Adventskalender. Es ist mal wieder Zeit für ein neues Türchen. Und weil Weihnachten natürlich auch das Fest der Liebe genannt wird, dachten wir uns dieses Lass uns doch mal wieder etwas Liebe mit der deutschsprachigen Tech Podcast Szene teilen. Diese Episode ist eine solche Episode und sie kommt nicht von den Standard Engineering Kiosk Hosts Wolfgang oder mir, mein Name ist Andi, sondern wir lassen uns den Engineering Kiosk mal für einen Tag aus der Hand nehmen. Heute übernimmt ein befreundeter Podcast das Mikro und bringt ihm ein paar neue Perspektiven, ein anderes Thema und vielleicht den ein oder anderen Gedanken, der über unsere eigene Bubble hinausgeht. Wir denken da draußen gibt es großartige Tech Podcasts, die unbedingt mehr Aufmerksamkeit verdienen und wir denken Wissen, Inspiration und gute Geschichten sollte man am besten teilen. Also zurücklehnen, neugierig sein. Heute mit Stefan vom IT Berufe Podcast. Los geht's, viel Spaß."
        },
        {
            "end": 62650,
            "speaker": "B",
            "start": 54370,
            "text": "Ho ho. Hier spricht Stefan Macke vom IT Berufe Podcast. Und wie man an diesem Adventskalender unschwer erkennen kann, neigt sich das Jahr zwei."
        },
        {
            "end": 64930,
            "speaker": "C",
            "start": 62650,
            "text": "Tausend fünf und zwanzig dem Ende zu."
        },
        {
            "end": 67330,
            "speaker": "B",
            "start": 65250,
            "text": "Und ab Januar werden wahrscheinlich wieder die."
        },
        {
            "end": 78930,
            "speaker": "C",
            "start": 67330,
            "text": "Ganzen Fitnessstudios überquillen mit Menschen mit sehr guten Vorsätzen fürs neue Jahr. Falls du allerdings ein bisschen nachhaltigere Vorsätze fürs nächste Jahr dir geben möchtest, anstatt."
        },
        {
            "end": 89230,
            "speaker": "B",
            "start": 78930,
            "text": "Wieder mal das Fitnessstudio zu starten, habe ich was Spannendes für dich mitgebracht. Vielleicht suchst du ja auch schon seit längerem nach Ford oder Weiterbildungsmöglichkeiten in der IT. Vielleicht hast du selber eine Ausbildung gemacht."
        },
        {
            "end": 91270,
            "speaker": "C",
            "start": 89230,
            "text": "In einem der sieben IT Berufe oder."
        },
        {
            "end": 95310,
            "speaker": "B",
            "start": 91270,
            "text": "Bist vielleicht sogar Quereinsteiger, arbeitest schon seit ein paar Jahren irgendwie in der IT."
        },
        {
            "end": 106750,
            "speaker": "C",
            "start": 95390,
            "text": "Und brauchst jetzt aber irgendwie mal was auf dem Papier, einen vernünftigen Abschluss, wie das in Deutschland ganz oft ja noch angefordert wird. Und Ende zwei tausend vier und zwanzig wurde tatsächlich die IT Weiterbildung in Deutschland."
        },
        {
            "end": 110270,
            "speaker": "B",
            "start": 106830,
            "text": "Komplett reformiert und überarbeitet. Vielleicht kennst du das noch von früher."
        },
        {
            "end": 117310,
            "speaker": "C",
            "start": 110270,
            "text": "Da gab es so zum Beispiel Fort und Weiterbildung für IT Projektleiter, dann gab es irgendwann mal den sogenannten Operative Professional."
        },
        {
            "end": 120010,
            "speaker": "B",
            "start": 117610,
            "text": "Und ja, die wurden nicht so gut."
        },
        {
            "end": 122010,
            "speaker": "C",
            "start": 120010,
            "text": "Angenommen, um es mal vorsichtig zu sagen."
        },
        {
            "end": 134930,
            "speaker": "B",
            "start": 122170,
            "text": "Und deswegen wurde jetzt das gesamte Weiterbildungssystem vor allem unter Berücksichtigung der Interessen der Arbeitgeber neu gestaltet, sodass dort jetzt also andere Weiterbildungen angeboten werden, die auch eher."
        },
        {
            "end": 144980,
            "speaker": "C",
            "start": 134930,
            "text": "Zu den Anforderungen des Berufsumfelds und der Arbeitswelt passen und die nennen sich Berufsspezialist bzw. Bachelor Professional Und das Bachelor in."
        },
        {
            "end": 151260,
            "speaker": "B",
            "start": 144980,
            "text": "Dem Bachelor Professional deutet schon darauf hin, dass das ein, ja wie soll ich sagen, etwas wertigerer Abschluss ist, denn diese."
        },
        {
            "end": 153780,
            "speaker": "C",
            "start": 151260,
            "text": "Neuen Abschlüsse sind nach dem DQR, den."
        },
        {
            "end": 157300,
            "speaker": "B",
            "start": 153780,
            "text": "Deutschen Qualifikationsrahmen auf der gleichen Ebene einsortiert."
        },
        {
            "end": 159420,
            "speaker": "C",
            "start": 157300,
            "text": "Wie tatsächlich ein Bachelor von einer Hochschule."
        },
        {
            "end": 168620,
            "speaker": "B",
            "start": 159420,
            "text": "Das heißt, du kannst jetzt ohne zu studieren, aufbauend auf eine Berufsausbildung über diese Weiterbildung einen gleichwertigen Abschluss erreichen wie durch."
        },
        {
            "end": 171300,
            "speaker": "C",
            "start": 168620,
            "text": "Ein Hochschulstudium, zumindest im Bachelor Bereich."
        },
        {
            "end": 173540,
            "speaker": "B",
            "start": 171300,
            "text": "Und da wollte ich heute mal ein bisschen was zu erzählen, weil vielleicht ist."
        },
        {
            "end": 175220,
            "speaker": "C",
            "start": 173540,
            "text": "Ja für dich auch interessant und du."
        },
        {
            "end": 176760,
            "speaker": "B",
            "start": 175220,
            "text": "Weißt dann jetzt, dass es da was."
        },
        {
            "end": 179480,
            "speaker": "C",
            "start": 176760,
            "text": "Neues gibt und Ende zwei tausend fünf."
        },
        {
            "end": 187480,
            "speaker": "B",
            "start": 179480,
            "text": "Und zwanzig wo ich das hier aufnehme, stehen die ersten Abschlussprüfungen für den ersten Jahrgang tatsächlich an. Zwei tausend sechs und zwanzig geht das los und danach wird man dann auch."
        },
        {
            "end": 190560,
            "speaker": "C",
            "start": 187480,
            "text": "Erkennen können, ob sie gut am Arbeitsmarkt akzeptiert werden."
        },
        {
            "end": 192080,
            "speaker": "B",
            "start": 190560,
            "text": "Diese Abschlüsse, ich rede jetzt die ganze."
        },
        {
            "end": 193480,
            "speaker": "C",
            "start": 192080,
            "text": "Zeit von Abschluss zehn, es gibt nämlich."
        },
        {
            "end": 197920,
            "speaker": "B",
            "start": 193480,
            "text": "Zwei das ist einmal der sogenannte Berufsspezialist und wie der Name schon sagt, da."
        },
        {
            "end": 203040,
            "speaker": "C",
            "start": 197920,
            "text": "Geht es tatsächlich um die technische Vertiefung der jeweiligen Inhalte, für die man sich interessiert."
        },
        {
            "end": 208740,
            "speaker": "B",
            "start": 203280,
            "text": "Das ist nach DQR fünf etwas höherwertiger als der Berufsschutz Abschluss, den man zum."
        },
        {
            "end": 213980,
            "speaker": "C",
            "start": 208740,
            "text": "Beispiel als Fachinformatikerin erwirbt, der steht nämlich auf DQR Stufe vier und für diesen."
        },
        {
            "end": 218540,
            "speaker": "B",
            "start": 213980,
            "text": "DQR fünf kann man sich jetzt eine, wie der Name schon sagt, eine Fachrichtung."
        },
        {
            "end": 221740,
            "speaker": "C",
            "start": 218860,
            "text": "Aussuchen, in der man Spezialist oder Spezialistin."
        },
        {
            "end": 239260,
            "speaker": "B",
            "start": 221740,
            "text": "Werden möchte und da gibt es fünf an der Zahl. Softwareentwicklung zum Beispiel wäre natürlich für die Hörer und Hörerinnen dieses Podcast besonders interessant vermutlich. Es gibt aber auch noch vier weitere, nämlich Systemintegration und Vernetzung, also klassische Netzwerkgeschichten. Dann haben wir die IT Beratung für alle, die so im SAP Umfeld wahrscheinlich."
        },
        {
            "end": 245000,
            "speaker": "C",
            "start": 239260,
            "text": "Und anderen Beratungstätigkeiten ihr Geld verdienen. Dann haben wir Datenanalyse, Data Science, auch."
        },
        {
            "end": 247520,
            "speaker": "B",
            "start": 245000,
            "text": "Immer wichtiger heutzutage und der letzte wie."
        },
        {
            "end": 253800,
            "speaker": "C",
            "start": 247520,
            "text": "Kann es anders sein, Informationssicherheit natürlich auch das ein wichtiges Feld für die Zukunft."
        },
        {
            "end": 282580,
            "speaker": "B",
            "start": 253880,
            "text": "Und in diesen fünf Bereichen kann man sich jetzt spezialisieren, erst mal ganz grob über den Daumen gesagt, ungefähr ein Jahr, dann könnte ich diesen Abschluss machen, gibt auch eine Abschlussprüfung und so weiter und ich kann aber darauf aufbauen, dann noch weitergehen und das wäre dann der Bachelor Professional in IT. Das ist übrigens die Zukunft für alle anderen, alle weiß ich nicht, aber für viele andere Berufe auch. Die werden jetzt, wenn du vielleicht so was kennst wie geprüfte Fachwirte, das wird jetzt für die meisten Berufe abgelöst durch."
        },
        {
            "end": 289740,
            "speaker": "C",
            "start": 282580,
            "text": "Bachelor Professional in und dann eben die Bezeichnung des Bereichs und bei uns ist dann halt in IT und das ist."
        },
        {
            "end": 300820,
            "speaker": "B",
            "start": 289740,
            "text": "Dann etwas, wo es weniger um die fachliche Spezialisierung geht, sondern da kommen dann allgemeine Sachen dazu, wie zum Beispiel Mitarbeiterführung und Personalmanagement. Das heißt, dieser Abschluss der Bachelor Professional."
        },
        {
            "end": 305320,
            "speaker": "C",
            "start": 300820,
            "text": "Ist auch dazu gedacht, dass man mal eine Führungsposition einnimmt. Und das ist ja vielleicht auch für."
        },
        {
            "end": 310720,
            "speaker": "B",
            "start": 305320,
            "text": "Viele Techniker interessant, die vielleicht tatsächlich raus aus der Technik wollen. Und in der Führungsposition wäre also der."
        },
        {
            "end": 314120,
            "speaker": "C",
            "start": 310720,
            "text": "Bachelor Professional genau das Richtige. Da muss man auch ein umfangreiches Projekt."
        },
        {
            "end": 326960,
            "speaker": "B",
            "start": 314120,
            "text": "Am Ende umsetzen, dokumentieren, vortragen und es gibt aber trotzdem auch eine fachliche Spezialisierung, die man machen muss und die kann man sich aber vom Berufsspezialisten, wenn man den vorher gemacht hat, anrechnen lassen. Das heißt, ich könnte, wenn ich jetzt."
        },
        {
            "end": 330880,
            "speaker": "C",
            "start": 326960,
            "text": "Noch mal ganz grob gesagt ein Jahr draufsetze für den Bachelor Professional und meinen."
        },
        {
            "end": 333000,
            "speaker": "B",
            "start": 330880,
            "text": "Berufsspezialist im ersten Jahr mache, dann habe."
        },
        {
            "end": 334760,
            "speaker": "C",
            "start": 333000,
            "text": "Ich das quasi für den Bachelor Professional."
        },
        {
            "end": 336180,
            "speaker": "B",
            "start": 334760,
            "text": "Schon mit ab gedeckt und muss nicht."
        },
        {
            "end": 340060,
            "speaker": "C",
            "start": 336180,
            "text": "Noch mal zusätzlich etwas machen. Und so könnte ich in zwei Jahren."
        },
        {
            "end": 350540,
            "speaker": "B",
            "start": 340060,
            "text": "Berufsbegleitend nach meiner Ausbildung so einen Bachelor Professional erreichen, der dann einem entsprechenden Universitätsabschluss gleichgestellt ist. Und das Spannende Ich muss dafür keine."
        },
        {
            "end": 353900,
            "speaker": "C",
            "start": 350540,
            "text": "Ausbildung gemacht haben in einem Beruf, sondern es geht auch für Quereinsteiger."
        },
        {
            "end": 361900,
            "speaker": "B",
            "start": 353900,
            "text": "Da gibt es dann bestimmte Voraussetzungen. Ich meine, als Quereinsteiger muss man nur fünf Jahre Berufserfahrung in dem entsprechenden Bereich nachweisen, also irgendwo in der IT und."
        },
        {
            "end": 363580,
            "speaker": "C",
            "start": 361900,
            "text": "Dann könnte man direkt mit dieser Weiterbildung."
        },
        {
            "end": 365180,
            "speaker": "B",
            "start": 363580,
            "text": "Starten und dann halt eben auch auf."
        },
        {
            "end": 372680,
            "speaker": "C",
            "start": 365180,
            "text": "Dem Papier seinen Abschluss nachweisen machen und zwar sogar einen recht hochwertigen, wie es eben der DQR hier vorgibt."
        },
        {
            "end": 382160,
            "speaker": "B",
            "start": 372760,
            "text": "Falls du dich jetzt fragst, oh ein Jahr, zwei Jahre Fortbildung, wie soll ich denn das bezahlen, was kostet das denn eigentlich? Gute Neuigkeiten."
        },
        {
            "end": 384880,
            "speaker": "C",
            "start": 382160,
            "text": "Denn es gibt das sogenannte Aufstiegs bafög."
        },
        {
            "end": 387000,
            "speaker": "B",
            "start": 384880,
            "text": "In Deutschland und das könnte dazu führen."
        },
        {
            "end": 391080,
            "speaker": "C",
            "start": 387000,
            "text": "Dass du fünf und siebzig Prozent der Kosten tatsächlich gefördert bekommst."
        },
        {
            "end": 414580,
            "speaker": "B",
            "start": 391240,
            "text": "Und wenn du bei bafög direkt denkst, oh Gott, oh Gott, Bürokratie Monster, bis ich dann irgendwann mal drei krieg, das ist hier anders. Es gibt tatsächlich nur ein ganz kurzen knackigen Antrag und dann wirst du das Geld in sehr hoher Wahrscheinlichkeit ich bin keine Rechtsberatung bekommen, das heißt, schau dir das mal in Ruhe an. Du brauchst nicht allzu viel investieren. Klar, ein bisschen Invest ist dabei, aber der Großteil dieser Weiterbildung wird tatsächlich durch."
        },
        {
            "end": 418660,
            "speaker": "C",
            "start": 414580,
            "text": "Das Aufstiegs bafög gefördert. Wenn du jetzt sagst, Mensch, das hört."
        },
        {
            "end": 424580,
            "speaker": "B",
            "start": 418660,
            "text": "Sich interessant an, das will ich mir mal näher angucken, dann schicke ich den beiden Kollegen vom Engineering Kiosk natürlich ein."
        },
        {
            "end": 430500,
            "speaker": "C",
            "start": 424580,
            "text": "Paar Links, insbesondere zum BIP, dem Bundesinstitut für Berufsbildung. Da kannst du dir diese neue Struktur."
        },
        {
            "end": 432240,
            "speaker": "B",
            "start": 430500,
            "text": "Noch mal genau anschauen, was es mit."
        },
        {
            "end": 438000,
            "speaker": "C",
            "start": 432240,
            "text": "Diesem DQR auf sich hat, was genau noch mal die Spezialistenprofile sind und wo."
        },
        {
            "end": 442640,
            "speaker": "B",
            "start": 438000,
            "text": "Man das Ganze vielleicht auch machen kann. Man kann das nämlich nicht nur in Vollzeit machen im Blockunterricht, sondern man kann."
        },
        {
            "end": 445120,
            "speaker": "C",
            "start": 442640,
            "text": "Es, wie gesagt, auch berufsbegleitend am Abend, am Wochenende machen."
        },
        {
            "end": 446999,
            "speaker": "B",
            "start": 445120,
            "text": "Gibt es verschiedene Anbieter, die das unterstützen."
        },
        {
            "end": 453520,
            "speaker": "C",
            "start": 446999,
            "text": "Und dann macht man die Prüfung vor der IHK, ähnlich wie bei Berufsabschlüssen, Prüfungsausschuss und so weiter und dann hat man diesen Abschluss."
        },
        {
            "end": 455600,
            "speaker": "B",
            "start": 453600,
            "text": "Ja, wenn du sagst, das ist interessant, dann guck doch mal in die Show."
        },
        {
            "end": 459070,
            "speaker": "C",
            "start": 455600,
            "text": "Notes, da findest du dann bestimmt die Links, um dich weitergehend zu informieren."
        },
        {
            "end": 466550,
            "speaker": "B",
            "start": 459070,
            "text": "Und falls du dir für zwei tausend sechs und zwanzig vornimmst, dich beruflich weiterzubilden, wünsche ich dir viel Erfolg dabei und alles Gute. Ich glaube, wir brauchen auch in Zukunft."
        },
        {
            "end": 468190,
            "speaker": "C",
            "start": 466550,
            "text": "Noch ein paar mehr itler und IT."
        },
        {
            "end": 472990,
            "speaker": "B",
            "start": 468430,
            "text": "In Deutschland, auch wenn die KI uns die langweiligen Tätigkeiten abnimmt."
        },
        {
            "end": 474430,
            "speaker": "C",
            "start": 472990,
            "text": "Aber irgendwer muss ja auch die richtige."
        },
        {
            "end": 479790,
            "speaker": "B",
            "start": 474430,
            "text": "Arbeit machen, nicht wahr? So, das heißt in diesem Sinne, macht es gut, Frohe Weihnachten und bis zum nächsten Jahr."
        },
        {
            "end": 519640,
            "speaker": "A",
            "start": 479870,
            "text": "Ho ho, hier ist wieder Andi vom Ende. Das war es auch schon wieder mit dem heutigen Adventskalendertürchen, präsentiert von unseren Freunden aus der deutschsprachigen Tech Podcast Szene. Wenn dir gefallen hat, was du gehört hast, hör unbedingt doch mal dort rein, supportet die Leute, die gute Inhalte machen. Die Links zum Episodenthema, aber auch zu dem Podcast findet ihr natürlich wie immer in den Shownotes. Und wenn du Lust hast, dich mit ganz vielen Gleichgesinnten auszutauschen, schau doch mal in unserer Engineering Kiosk Discord Community vorbei. Dort hängen Entwickler und Entwicklerinnen, Architekten, Datenmenschen und Tech Nerds aller Art rum, genau wie du, genau wie Wolfgang, genauso wie ich. Ihr wisst schon, was wir meinen. Wir hören uns bei der nächsten Episode wieder. Bis dahin, frohe Weihnachten und eine wunderbare Adventszeit."
        },
        {
            "end": 520240,
            "speaker": "C",
            "start": 519640,
            "text": "Bis bald."
        }
    ],
    "webhook_auth": false
}