{
    "acoustic_model": "assemblyai_default",
    "audio_duration": 1639,
    "audio_url": "https://cloud.inlupus.at/s/Rsxjpr4ARJnwyBe/download",
    "auto_chapters": false,
    "auto_highlights": false,
    "auto_highlights_result": {},
    "confidence": 0.9570218,
    "content_safety": false,
    "content_safety_labels": {
        "status": "unavailable"
    },
    "custom_topics": false,
    "disfluencies": false,
    "dual_channel": false,
    "entity_detection": true,
    "filter_profanity": false,
    "format_text": false,
    "iab_categories": true,
    "iab_categories_result": {},
    "id": "04a3d7e4-7f2a-4032-b833-3632819764ef",
    "language_code": "de",
    "language_detection": false,
    "language_model": "assemblyai_default",
    "punctuate": true,
    "redact_pii": false,
    "redact_pii_audio": false,
    "sentiment_analysis": false,
    "speaker_labels": true,
    "speakers_expected": 3,
    "speed_boost": false,
    "status": "completed",
    "summarization": false,
    "throttled": false,
    "utterances": [
        {
            "end": 50780,
            "speaker": "A",
            "start": 3680,
            "text": "Willkommen zum Engineering Kiosk Adventkalender oder für unsere deutschen Hörer Adventskalender. So viel Zeit muss ja noch sein, vor allem in dieser ruhigen Adventszeit. Da haben wir Zeit für Wissen Sinnvolles, aber auch weniger Sinnvolles. Und was sich Andi für dieses Türchen ausgedacht hat, mit welchem Wissen er jetzt um die Ecke biegen wird, das hört ihr gleich. Und bevor wir jetzt gleich loslegen, noch eine Info an alle regelmäßigen Hö Wenn euch vorkommt, dass der Andi klingt, als hätte er schon ein paar Glühweine intus, Könnte sein. Aber der eigentliche Grund ist, dass ich den Andi leider durch eine AI schicken habe müssen, weil unser Meister des Software Reliability Engineering leider seine Mac noch nicht im Griff hat und das richtige Mikro auswählen kann für die Aufnahme. Die AI hat es aber gefixt und damit könnt ihr euch jetzt zurücklehnen. Lauscher auf und los geht's."
        },
        {
            "end": 139820,
            "speaker": "B",
            "start": 52860,
            "text": "Dass Open Source Software ein elementarer Baustein unseres täglichen Lebens ist, ist glaube ich für die Hörerschaft hier nichts Neues. Sogar meine Frau sagte zu Hey, ohne Open Source funktioniert ja gar nichts mehr. Ich kann noch nicht mal mein iPhone bedienen und wir haben sogar inzwischen Open Source Software, die auf dem Mars läuft, wenn man zum Beispiel mal an Curl denkt. Und das ist schon faszinierend, dass Open Source Software eigentlich nicht mehr wegzudenken ist und unser normales Leben fast unmöglich wäre. Natürlich schwingen auch immer so Buzzwords mit wie digitale Souveränität aktuell in der Politik und Co. In dem ganzen Kontext ist mir vor kurzem eine Petition über den Bildschirm gescrollt mit dem Titel Anerkennung von Open Source Arbeit als Ehrenamt in Deutschland. Die Petition ist Mitte November diesen Jahres gestartet und hat die Forderung das Open Source Arbeit als gemeinwohlorientiertes Ehrenamt anerkannt. Und mich interessiert wer steckt denn eigentlich dahinter? Wer investiert die ganze Zeit, um so eine Petition zu starten, zu treiben? Weil es ist ja alles nicht wenig Arbeit. Das ist ja nicht nur Man schreibt die Petition. Das Tolle ist, der Name ist sehr, sehr präsent, Boris Hinzer. Und dann habe ich mich zurückerinnert Moment mal, der Name sagt mir irgendwas. Früher war ich im Typo Bereich unterwegs und Boris ist da auch unterwegs, habe ich gedacht, den droppst du einfach mal eine E Mail. Ich habe nämlich Fragen zu dieser Position und ich bin sehr, sehr dankbar dass Boris sehr schnell geantwortet hat und zu einem Interview zugestimmt hat. Deswegen Hallo Boris."
        },
        {
            "end": 141940,
            "speaker": "C",
            "start": 139900,
            "text": "Ja, hallo zusammen. Danke für die Einladung."
        },
        {
            "end": 176160,
            "speaker": "B",
            "start": 141940,
            "text": "Auch wie immer stelle ich dich ganz kurz vor. Beruflich bist du Gründer einer Webagentur, Webvision, soviel ich weiß, im schönen NRW. Du bist aber auch kein Unbekannter im Open Source Bereich, nämlich engagierst du dich hintendran als Vice President von der Typo Association. Für die, die es nicht wissen, Typo ist ein PHP basiertes, kann man Enterprise Open Source CMS nennen. Auf jeden Fall. Ich weiß, dass ganz viele Universitäten im europäischen Raum auf Typo basieren und es ist eher, ich sage mal, ein größeres CMS, zumindest womit man komplexere Webseiten machen kann."
        },
        {
            "end": 176960,
            "speaker": "C",
            "start": 176360,
            "text": "Ja, genau."
        },
        {
            "end": 198640,
            "speaker": "B",
            "start": 176960,
            "text": "Lass uns mal zur Petition kommen. Und zwar hatte ich in der Intro gesagt, du hast eine Petition verfasst mit dem Titel Anerkennung von Open Source Arbeit als Ehrenamt in Deutschland. Woher kommt die Petition? Also was hat dich dazu bewegt zu sagen, da muss sich was ändern und was ist eigentlich dein Antrieb, dich mal dahin zu setzen und auf opencriptition DE etwas in die Text Area zu hauen?"
        },
        {
            "end": 289510,
            "speaker": "C",
            "start": 198640,
            "text": "Ja, das war eigentlich relativ einfach. Ich habe mich eigentlich die letzten zwei, drei Jahre jedes Jahr am Tag des Ehrenamtes geärgert. Also ich höre Radio beim Arbeiten, so als Audio Stream, meistens WDR und dann ist dann irgendwie Tag des Ehrenamtes und dann sprechen die halt mit ganz, ganz vielen tollen Leuten, die im Roten Kreuz unterwegs sind, die irgendwie in der Feuerwehr sind, die irgendwelche anderen ehrenamtlichen Aufgaben haben und stellen die halt kurz vor. Und jedes Mal bin ich halt in den letzten zwei, drei Jahren hingegangen, habe dann irgendwie mich auf die Website eingeloggt, habe dann gesagt, hey Leute, ihr vergesst da eine ganz wichtige Zielgruppe, ohne die es eigentlich auch nicht mehr weitergeht, nämlich die Open Source leider draußen. Also die Leute, die sich im Endeffekt mit Code und mit ganz viel toller Software da jeden Tag freiwillig engagieren, gibt denen doch wenigstens auch mal eine Plattform. Bislang ist das halt immer verhalt. An dem Tag, wo ich die Petition ins Leben gerufen habe, war ich dann wieder einmal ehrenamtlich in Düsseldorf saß mit den anderen Leuten vom Board zusammen und wir haben dann überlegt, na ja, okay, was kriegen wir denn so hin nächstes Jahr? Wie viel können wir denn Einnahmen haben und in welche Projekte innerhalb des Typo Universums können wir die denn sinnvoll einsetzen. Verdammt, kann echt nicht wahr sein. Da muss sich doch was ändern. Auf der einen Seite steht im Petitionsvertrag Hey, wir wollen digitale Souveränität und am besten Fall auch durch Open Source. Das heißt, der Gesetzgeber räumt dem schon einen hohen Stellenwert ein. Aber auf der anderen Seite sagt Naja, lass das mal Freiwillige machen. Und da ist halt meines Erachtens so ein gewisses Ungleichgewicht drin."
        },
        {
            "end": 295150,
            "speaker": "B",
            "start": 289510,
            "text": "Denken wir mal in die Details dieser Petition. Was ist konkret die Forderung?"
        },
        {
            "end": 367590,
            "speaker": "C",
            "start": 295150,
            "text": "Naja, also mir geht es eigentlich im Hauptzweck erstmal um die Anerkennung. Was natürlich dabei immens großer Anteil dann auch noch ist, ist, dass man überhaupt mit Leuten, ich glaube normalen Bürgern, einfach ins Gespräch kommen kann und denen überhaupt mal die Awareness verschafft, wo denn überall Open Source drin ist. Ich glaube, dass das halt einfach bei neunzig, fünf und neunzig Prozent der Menschen gar nicht der Fall ist, dass die wissen, dass die jeden Tag morgens früh, wenn sie aufstehen, an ihr Handy greifen, wenn sie irgendwie Bahn gehen, an einem Ticketautomat stehen, wenn sie im Web irgendwie sich Webseiten angucken oder wenn sie abends Videostream machen, dass da überall Open Source Arbeit dahinter steckt. Und das ist tatsächlich auch so ein bisschen die Challenge von der Petition. Also einerseits die Awareness draußen zu schaffen, dass da viele, viele Leute sind, die freiwillige Arbeit machen, aber natürlich auch im Moment keine Benefits davon haben. Also gelinde gesagt, der Karnevalsverein, der in Köln ist, der ist als ehrenamtlicher Verein anerkannt oder große Sport Sportvereine wie TSV ein tausend acht hundert sechzig München oder der vfl Bochum, die haben alle immer so einen Kern im Ehrenamt in den Verein, aber halt nicht die Open Source Projekte."
        },
        {
            "end": 370830,
            "speaker": "B",
            "start": 367590,
            "text": "Ich glaube, da zählen auch Freiwillige Feuerwehren und Co. Zu, oder?"
        },
        {
            "end": 380990,
            "speaker": "C",
            "start": 370910,
            "text": "Ja, genau. Oder ganz aktuell. Ich glaube tatsächlich vor ein, zwei Wochen ist durch den Bundestag schon mal akzeptiert worden, dass esport inzwischen sogar beispielsweise auch ehrenamtlich seien."
        },
        {
            "end": 393280,
            "speaker": "B",
            "start": 380990,
            "text": "Für wen ist die Anerkennung vom Ehrenamt denn vorteilhaft? Gilt das jetzt nur für Open Source Contributor und Leute, die eigene Projekte haben oder hat das einen weiteren Effekt?"
        },
        {
            "end": 451830,
            "speaker": "C",
            "start": 393280,
            "text": "Ne, das hat tatsächlich auch einen weiteren Effekt. Also ich fange erst mal bei den Leuten an, die selber contributen. Die könnten theoretisch mit der Anerkennung eine Ehrenamtspauschale kriegen. Das ist so Pi mal Daumen acht hundert im Jahr steuerfrei. Dann gibt es so ein Konstrukt, das nennt sich Übungsleiterpauschale. Also wenn wir im Typo Education Committee Leute anleiten, beispielsweise Typo zu verwenden, zu coden, weiter zu contributen, dann könnte dort eine Übungsleiterpauschale bis zu drei tausend pro Jahr geltend gemacht werden. Darüber hinaus gibt es Aufwandsentschädigungen, beispielsweise für Fahrtkosten und am anderen Ende, wenn das irgendwann mal Gesetz wäre, würde man natürlich dann einen Verein nach deutschem Recht gründen können, wie alle anderen Vereine das also auch haben. Der hätte dann ein Ehrenamt und der könnte dann beispielsweise Gelder gegen Spendenquittung einnehmen. Und diese Möglichkeit haben wir halt einfach momentan noch nicht."
        },
        {
            "end": 492200,
            "speaker": "B",
            "start": 451910,
            "text": "Jetzt ist immer so das Gerücht bzw. Der Satz bezahlter Open Source Arbeit ist immer so schwierig und du hattest jetzt gerade schon gesagt Ehrenamtpauschale, Übungsleiterpauschale und diese ein tausend acht hundert vierzig im Jahr, bzw. Die müssen ja irgendwo herkommen. Bedeutet das dann, dass ich als Einzelner theoretisch, wenn ich sagen kann, okay, ich habe jetzt Zeit und ich habe jetzt hier meinen Vorschlag, dass ich zu Organisationen wie der Typo Association gehen kann oder zu anderen Vereinen, um dann im Auftrag von diesen Geldgebern die Abrechnung für mich als Einzelner einfacher gestalten kann? Oder woher würden diese Ehrenamtpauschale und Übungsleiterpauschale dann kommen?"
        },
        {
            "end": 539329,
            "speaker": "C",
            "start": 492430,
            "text": "Also meines Wissens wird die durch den ehrenamtlichen Verein ausgeschüttet. Also die nehmen vielleicht Spenden ein, können wiederum Spendenquittung ausstellen und auf der anderen Seite haben sie halt die Möglichkeit, diese Ehrenamtspauschale dann pro Jahr auszuschütten. Und jeder kann, glaube ich, anhand der Höhe erkennen, das ist jetzt nichts, wo ich jetzt meinen Lebensunterhalt bestreiten kann, aber es ist einfach eine schöne Anerkennung und offen gesprochen mir selber mit der Petition geht es überhaupt nicht um diese Ehrenamtspauschale oder über diese Übungsleiter Pauschale, einfach mehr um die Anerkennung in der breiten Bevölkerung, in der Regierung, Hey, wir haben da eigentlich was sehr, sehr Wichtiges, das für ganz Deutschland immens wichtig ist, aber wir erkennen es eigentlich nicht so richtig an."
        },
        {
            "end": 546430,
            "speaker": "B",
            "start": 539409,
            "text": "Jetzt hattest du schon gesagt, okay, man hätte dann auch die Möglichkeit an gemeinsam Verein zu gründen."
        },
        {
            "end": 548390,
            "speaker": "C",
            "start": 546670,
            "text": "Genau dieser hat, glaube ich, dann auch."
        },
        {
            "end": 566430,
            "speaker": "B",
            "start": 548390,
            "text": "Steuerliche Vorteile, darf aber dann auch keinen Gewinn machen, sondern gilt dann wirklich nur einem gemeinnützigen Zweck ist das aktuell nicht möglich. Wenn ich sage, okay, ich gründe ein Verein für nehme ich irgendein Open Source Projekt, meine kleine Library, die mit Jira."
        },
        {
            "end": 656420,
            "speaker": "C",
            "start": 566430,
            "text": "Connected oder sowas, spannend, die würde ich gerne sehen wollen. Also für mein Verständnis gibt es so ein paar Eckpunkte, die du halt für so eine Gemeinnützigkeit erfüllen musst. Also das ist erstmal, das Ganze muss freiwillig sein, also darfst dazu nicht gezwungen werden. Ich darf jetzt nicht einem Mitarbeiter sagen, ab sofort machst du das jetzt hier für den Verein oder so, der muss das freiwillig machen, dann muss das Ganze unentgeltlich laufen. Also Stichwort Übungsleiterpauschale, die ist jetzt nicht so hoch, als dass man da irgendwie sich eine tolle Wohnung irgendwie im Jahr leisten kann. Man kann vielleicht mal nett für essen gehen und ein tolles Fest für alle machen, aber mehr ist das, glaube ich auch nicht. Und dann muss das natürlich gemeinnützig sein. Also das muss der Allgemeinheit zugutekommen. Und ich glaube halt mit ganz, ganz viel Open Source Software ist das halt der Fall. Dann muss es noch regelmäßig sein und das Ganze muss halt irgendwie organisiert sein. Also ein Verein, ein Verband oder eine Organisation. Was so ein bisschen schade ist, ist wenn man so ein bisschen über die Grenzen von Deutschland hinweg guckt, so andere Länder, so USA sind da beispielsweise sehr, sehr führend. Da gibt es dann beispielsweise die Apache Software Foundation, die Open Source Arbeit macht oder auch es gibt Google Org, wissen viele nicht, die auch wiederum ein Stück weit Open Source macht. Hier in Europa. Meines Wissens gibt es so, ja, ich sage mal, leichte Anfänger davon in Frankreich, aber halt wir in Deutschland, naja, wir sind da noch, glaube ich, haben da noch ein bisschen Nachholbedarf."
        },
        {
            "end": 673160,
            "speaker": "B",
            "start": 656420,
            "text": "Jetzt habe ich gesehen, du hast gerade schon von anderen Ländern gesprochen, deine Petition hat aber auch in anderen europäischen Ländern was bewirkt. Also Leute haben dich, soviel ich weiß, kontaktiert, um etwas Ähnliches zu starten. Kannst du etwas über den Effekt von dem Starten dieser Petition in Deutschland auf andere Länder erzählen?"
        },
        {
            "end": 761650,
            "speaker": "C",
            "start": 673160,
            "text": "Ja klar. Also ich war ehrlich gesagt total von den Socken. Irgendwie habe ich das natürlich dann gepostet, wie man das so macht und irgendwie hat das dann jemand aus Dänemark hat mich darauf aufmerksam gemacht, hey, guck doch mal da vorne auf LinkedIn, da versuchen wir das Ganze jetzt auch. Wir fanden die Idee so super, wir wollen das Ganze auch für den Dänemark halt machen, das fand ich total klasse, habe natürlich dann logischerweise wieder in der Typo Community rumgeguckt, habe dann mal den Matthias Bold Lesniak angefunkt, gesagt, ich sag mal, wir haben doch einige Kontakte auch nach Dänemark, sag doch mal ein paar Namen und die habe ich dann einfach mit in den LinkedIn Post halt erwähnt und die fangen das jetzt auch an. Ich glaube, bei denen läuft das ein bisschen anders. Sie brauchen irgendwie, um so eine Petition zu starten, initial, ich glaube drei oder fünf Signaturen, das ist jetzt soweit schon da und dann müssen die, glaube ich, Unterschriften zusammenkriegen, damit die Petition dann irgendwie wahrgenommen wird. Das andere Land, wo ich jetzt auch schon Kontakt habe, ist in die Schweiz. Die haben beispielsweise unlängst jetzt schon, ich sage jetzt mal so nach dieser Idee Public Money, Public Code, sag jetzt mal, so eine Art Bundesverzeichnis für Softwareprojekte ins Leben gerufen und da tausche ich mich beispielsweise mit meinem Freund und Kollegen Adrian Zimmermann von der Snowflake ganz gerne aus, was denn da los ist. Die schauen immer so ein bisschen neidisch hier nach Deutschland, weil wir gerade so in den letzten Jahren im Typo Umfeld so ein bisschen auch geadelt worden sind, so mal als Stichwort Government Zeitbilder in den Raum geworfen."
        },
        {
            "end": 772290,
            "speaker": "B",
            "start": 761890,
            "text": "Kannst du mal ganz kurz erklären, was der Government Zeitbilder ist bzw. Was das im Kontext mit dieser Petition zu tun hat und warum jetzt die Schweizer Bürger neidisch auf Deutschland."
        },
        {
            "end": 955000,
            "speaker": "C",
            "start": 772450,
            "text": "Okay, also fangen wir mal bei den Schweizern an. Die Schweiz hat irgendwann mal vor ein paar Jahren entschieden, alle Bundeswebseiten in der Schweiz laufen mit einem proprietären Content Management System, Web Content Management System. Das ist natürlich für die Open Source erstmal so ein Stich in die Seite, wenn nicht sogar ein Stich ins Herz. Kommen wir jetzt zu Deutschland. Zwei tausend zwei und zwanzig zwei tausend drei und zwanzig hat der ITZ Bund, also das IT Servicezentrum der Bundesrepublik Deutschland, sich umgeguckt und hat gesagt, naja, wir brauchen ein anderes Web Content Management System. Die kommen also von einer proprietären Software, nennt sich dann Government Zeit Builder. Das ist eine Java basierte Anwendung, womit die Bundeswebseiten bisher veröffentlicht wurden. Man hat dann irgendwie zwei tausend ein und zwanzig zwei tausend zwanzig glaube ich, noch einen Versuch gemacht, naja, es ist halt doof, wenn wir halt andauernd Lizenzkosten zahlen, proprietäre Software im Einsatz haben, versuchen wir es noch mal mit Open Source. Das Projekt hieß dann Government Zeitbilder zehn das hat aber nicht den notwendigen Erfolg gehabt, man hat das dann letzten Endes eingestellt. Dann ist der ITZ Bund halt hingegangen und hat halt geguckt, okay, was haben wir denn hier für Möglichkeiten in Deutschland Open Source zu nutzen, weil damals war auch schon der Wunsch da, jo, wir wollen Open Source nutzen Und dann haben die halt festgestellt, hey Moment mal, Typo hat hier eine total starke Community in Deutschland, gucken wir uns das Ding doch mal näher an, Wann ist der ITZ Bund im Endeffekt durch alle Typo Camps gehoppelt und hat sich dann angeguckt, was die Typo Community macht und hat dann letzten Endes einen Vorschlag gemacht, hat gesagt, hey Leute, Government Zeit Builder elf soll bitte auf Basis von Typo künftig sein. Dann gab es dann zwei tausend drei und zwanzig eine Ausschreibung, hat sich dann hingezogen, so bis jetzt letzten Endes in zwei tausend fünf und zwanzig dann alle Ausschreibungen dann durchgekommen sind und dann letzten Endes entschieden wurde, jo, ab sofort wird das Bundes Content Management System in Anführungszeichen aka Government Zeitbilder elf aka Typo so heißt also künftig bis Ende zwei tausend fünf und zwanzig so ganz grob werden circa fünf hundert fünfzig Bundeswebseiten auf Typo als Untergrund setzen. Um da mal ein bisschen die Brücke noch mal zur Petition zu schlagen. Was ein bisschen paradox dabei ist und ein bisschen krass ist, ich habe letztes Jahr auf der Typo Konferenz, also zwei tausend vier und zwanzig mit Bund gesprochen, habe gesagt, hey cool, dass ihr das mit dem Open Source machen wollt, wie wäre es denn, wenn ihr auch Mitglied der Typo Association werdet? Super Idee, wurde total gut angenommen von der Silke dann dieses Jahr, also wir waren im November jetzt gerade in Düsseldorf, weitere Typo Konferenz, es ist dem ITZ Bund nach einem Jahr noch nicht gelungen, Mitglied der Typo Association zu werden und das ist so ein bisschen so Paradoxon und Ungleichgewicht und so weiter und so fort. Wieder ein wunderbares Beispiel dafür, hey, wir setzen auf Open Source in Deutschland, können es aber irgendwie nicht so richtig fördern."
        },
        {
            "end": 972460,
            "speaker": "B",
            "start": 955240,
            "text": "Also nur damit ich das erst mal ganz kurz zusammenfasse, es wurde entschieden, dass etliche Webseiten auf einem Open Source System zukünftig aufgebaut werden, aber Teil der Finanzierung, der Nachhaltigkeit dieser Open Source Systeme zu werden, ist dann doch wieder zu schwierig."
        },
        {
            "end": 1043480,
            "speaker": "C",
            "start": 972460,
            "text": "Ist das richtig? Also in den Projekten geht das natürlich. Also das, was in der Ausschreibung drin ist, ist beispielsweise die Migration von den Webseiten oder auch der Betrieb ist möglich oder auch die grundsätzliche Entwicklung dieses, ich sage jetzt mal, Software Paketes. Was aber als Basis Typo hat. Was aber beispielsweise nicht möglich ist, ist, dass der ITZ Bund, zumindest nach heutigem Stand, Mitglied der Typo Association wird und dann beispielsweise so ein Gold Membership löst, was so Pi mal Daumen im Jahr kostet, was eigentlich für so die Größenordnung fast schon Peanut sein sollte. Oder wenn es ein Platinum Mitgliedschaft wäre, wären es. Also das ist dann beispielsweise nicht möglich. Projekt, alles gut, kein Problem, können wir Geld geben. Public Money, Public Code, alles super. Aber so richtig nachhaltig Open Source Arbeit fördern geht dann leider nicht ganz so aufgrund der Strukturen offen gesprochen. Um ein bisschen wieder die Brücke zurück zur Petition zu schlagen. Ich fände es halt wirklich wesentlich besser, wenn die Anerkennung da wäre, die ganzen Open Sourceler, die da draußen sind, jeden Tag neben ihrer Arbeit noch freiwillige Arbeit machen, die Anerkennung bekommen, die sie halt wirklich auch verdienen."
        },
        {
            "end": 1056730,
            "speaker": "B",
            "start": 1043560,
            "text": "Jetzt hat die Petition natürlich ein paar Wellen geschlagen. Du hast auch schon ein bisschen was berichtet, wie andere Länder darauf reagieren. Hast du denn in irgendeiner Art und Weise Signale aus der Politik erhalten, neben dem Jein?"
        },
        {
            "end": 1083730,
            "speaker": "C",
            "start": 1056730,
            "text": "Ganz vorsichtige, sagen wir es mal so. Also ich habe alle demokratischen Parteien angeschrieben. Ich habe bewusst noch keine einzelnen Politiker angeschrieben und von den demokratischen Parteien hat sich zumindest die Partei Die Linke bei mir gemeldet und hat gesagt hey, wäre das okay, wenn wir deinen Kontakt mal weiterleiten an unsere zuständige Person im Bundestag. Das ist so das Einzige, was ich bisher da bekommen habe."
        },
        {
            "end": 1133800,
            "speaker": "B",
            "start": 1083730,
            "text": "Bevor wir uns um die Frage kümmern, wo wir aktuell mit der Petition stehen, habe ich noch eine Frage zum Thema Ehrenamt und Haftung. Und zwar hast du diverse Gründe aufgelistet in der Petition, warum denn Home Source Arbeit Ehrenamt erkannt werden soll. Super Wahnsinn. Und ich habe auch sehr viel gelernt, als ich diese Gründe gelesen habe, muss ich zugeben. Und eine Sache ist mir ins Auge gestoßen. Und zwar hast du nämlich geschrieben, dass Contributor bei Haftungsfragen besser gestellt werden, analog zu A des BGB, was dann für, ich sag mal, Vereinsvorstände geht. Und da hatte ich die Ist das nicht eigentlich durch klassische Open Source Lizenzen bereits geregelt, wird mich in der Regel in der MIT Lizenz oder in der BSD Lizenz bereits die Haftung ausgeschlossen."
        },
        {
            "end": 1162280,
            "speaker": "C",
            "start": 1133960,
            "text": "Disclaimer, ich bin kein Legal Mensch, so wie ich es verstanden habe. Wenn man Ehrenamt da wäre anerkannt, würde man quasi nur dann haften, wenn man grob fahrlässig irgendwas macht. Genau, also damit steht man in der Haftung schon mal ein Stück weit besser da. Damit endet aber auch mein gefährliches Halbwissen und was dann höher zu bewerten ist, ob die GPL höher zu bewerten ist als ein und dreiig BGB, Ich vermute eher nein. Das müssen andere Leute klären."
        },
        {
            "end": 1167860,
            "speaker": "B",
            "start": 1162280,
            "text": "Wo stehen wir aktuell mit der PD? Die Petition wurde am vier und zwanzigster november zwei tausend fünf und zwanzig gestartet."
        },
        {
            "end": 1242630,
            "speaker": "C",
            "start": 1168260,
            "text": "Wo stehen wir aktuell? Genau? Also wir haben jetzt etwas mehr als sechs tausend Unterschriften tatsächlich gesammelt, so Pi mal Daumen. Im Moment verflacht es gerade wieder. Anfangs gab es eine schöne Welle, weil halt auch einige, ich sage jetzt mal eher größere Tech Blogs, Cashys Blog, Computer Base, winfuture und letztendlich auch Heise darüber berichtet haben. Da hatten wir beispielsweise mal so irgendwie ein tausend Unterschriften an einem Tag. Das war schon richtig super. Im Moment bin ich froh, wenn wir so auf ein hundert Unterschriften kommen. Ja und da sehe ich tatsächlich auch noch so ein bisschen die Challenge letzten Endes gerade jetzt von der von der Petition oder von mir drin, das so ein bisschen mehr publik zu machen. Also wenn einer von den Hörern da draußen irgendwie eine Idee hat, irgendwie Multiplikator selber ist, irgendwie Influencer ist oder einen tollen YouTube Channel hat oder oder oder können die mich gerne anschreiben. Ich bin auf LinkedIn, Mastodon und Blue Sky unterwegs. Wir können uns da gerne austauschen, was man da alles kann. Im Moment schreibe ich halt gerade ganz ganz viele E Mails und LinkedIn Nachrichten, ob die Leute es wollen oder halt nicht. Habe dann so eine libreoffice Tabelle aufgebaut und da funke ich dann alle möglichen Leute an. Glaube das ist tatsächlich momentan gerade meine Aufgabe."
        },
        {
            "end": 1254080,
            "speaker": "B",
            "start": 1242790,
            "text": "Jetzt steht laut der Webseite, man braucht Unterschriften für ein Quorum in Deutschland. Was passiert, wenn diese Unterschriften erreicht werden bzw. Nicht?"
        },
        {
            "end": 1356480,
            "speaker": "C",
            "start": 1254880,
            "text": "Also ich hab viel Feedback bekommen erstmal im Voraus. Da noch mal vielleicht ein kleiner Hinweis an die Kommentarspalte. Also die macht wirklich Spaß zu lesen und berechtigterweise haben einige Leute sich bei mir auch gemeldet und haben gesagt, hey Boris, warum hast du das Ganze nicht auf der offiziellen Petitionsseite gemacht? Weil das wird ja vieles einfacher machen. Ja, weil ich das einfach zu dem Zeitpunkt nicht wusste, aber auf der anderen Seite schon viele Leute signiert hatten, unterschrieben hatten. Ich habe mich jetzt in der Zwischenzeit an den Petitionsausschuss schon mal gewandt und habe gefragt, hey, kann ich die trotzdem einreichen? Dann kriegt man eine sehr nette E Mail zurück in krassem Bürokratendeutsch. Wenn die Unterschriften erreicht werden, werde ich die postalisch einreichen beim Petitionsausschuss des Bundes, meines Wissens. Danach passiert dann eine öffentliche Sitzung, da kann man quasi dann Fragen stellen, man kann die Petition vorstellen und so weiter und so fort. Das wird, glaube ich, sogar auch übertragen in Schrägstrich gestreamt. Dann wird das Ganze durch den Petitionsausschuss geprüft und dann gibt der dann verschiedene Empfehlungen an den Bundestag in unterschiedlichen Stufen, gibt so was wie, hey, ja, das ist absolut relevant, bitte mach das oder ja, schaut euch das auch mal an. Die zweite Frage, was passiert, wenn das nicht erreicht wird? Da habe ich mir ehrlich gesagt noch keine Gedanken gemacht. Ich hoffe einfach, dass wir die erreichen und dass wir die alle erreichen und dass da möglichst viele Leute sich jetzt irgendwie bei mir melden und vielleicht mitarbeiten wollen und das multiplizieren, irgendwie als Multiplikator auftreten wollen und dass wir die einfach dann rocken. Klar."
        },
        {
            "end": 1365590,
            "speaker": "B",
            "start": 1356480,
            "text": "Hätte eine Einreichung auf der offiziellen Petitionswebseite des Bundes irgendeinen Vorteil oder muss man da auch Stimmen sammeln?"
        },
        {
            "end": 1396150,
            "speaker": "C",
            "start": 1365670,
            "text": "Also der Vorteil ist, du hast es dann direkt digital da, also du kannst sie dann quasi digital einreichen. Das heißt, jeder, der jetzt irgendwie auf openpetition de geht, Ausrufezeichen Open Source eingibt, das ist nämlich die Short URL, ihr könnt da ganz einfach schreiben und ich habe halt nachher hinten raus die Aufgabe, das Ganze in DIN A Umschlag zu verpacken, wahrscheinlich ein Einschreiben eigenhändig mit Rückschein oder sowas zu machen, damit das auch wirklich ankommt. Und das werde ich aber auch machen."
        },
        {
            "end": 1422520,
            "speaker": "B",
            "start": 1396150,
            "text": "Okay, das ist ja machbar. Ich bin auch ehrlich sehr, sehr dankbar, dass du gar nicht so viel, ich sag mal, in die Planung gesteckt hast, wo muss ich das jetzt wirklich einreichen, sondern dass du einfach den Bias for Action gemacht hast und okay, Da gibt es diese Open Petition. Du bist ja wahrscheinlich nicht der Erste, der Open Petition dann dieses Quorum erreicht und das du einfach gemacht hast, versus wo muss ich das einreichen, dann da stehen geblieben bist. Vielen, vielen Dank für deine Action."
        },
        {
            "end": 1423080,
            "speaker": "C",
            "start": 1422600,
            "text": "Danke."
        },
        {
            "end": 1428280,
            "speaker": "B",
            "start": 1423240,
            "text": "Action ist jetzt noch das Stichwort. Was ist dein Call to Action? Was können wir tun? Wie können wir helfen?"
        },
        {
            "end": 1501680,
            "speaker": "C",
            "start": 1428440,
            "text": "Ja, so einen kleinen Pitch habe ich ja eben schon gemacht. Also Aufruf an alle da draußen, ob ihr Multiplikator seid, ob ihr selber ein Unternehmen habt, was Open Source nutzt, verteilt das bitte. Es gibt auf openpetition de, gibt es die Möglichkeit, ein PDF runterzuladen. Hängt es vielleicht in euren Vereinen auf, auf der Arbeit, druckt das ganze Ding aus, so richtig oldschool. Aber das Coole ist, es gibt auch einen QR Code da drauf. Was ich mir auch wünschen würde, das ist so ein bisschen gedanklich auch so vielleicht eines meiner nächsten To Dos Anfang nächsten Jahres. Geht damit in die Unis, redet in euren Unis darüber, ob Open Source Arbeit wirklich Ehrenamt ist. Da muss noch nicht mal unbedingt, ich sage jetzt mal, das Informatikstudium sein. Das kann auch durchaus in anderen Studienbereichen diskutiert werden. Stichwort Philosophie beispielsweise, vielleicht auch in Englisch, keine Ahnung. So was würde ich mir wünschen. Also einfach auf openpetition gehen, die Klamotten runterladen, ausdrucken, vielleicht zum Prof. Gehen oder zu eurem Chef fragen, hey, kann ich das hier aufhängen im Verein. Redet mit den Leuten darüber. Genau. Und wenn ihr andere Ideen habt, kontaktiert mich gerne auf LinkedIn, kontaktiert mich gerne auf Blue Sky oder Mastodon. Bin da total offen für fast jede Schandtat bereit."
        },
        {
            "end": 1509110,
            "speaker": "B",
            "start": 1501910,
            "text": "Die Petition ist nicht nur in Deutsch verfügbar, sondern auch in Englisch und ich meine gelesen zu haben. Sie wird auch, glaube ich, in Spanisch dran gesetzt."
        },
        {
            "end": 1511190,
            "speaker": "C",
            "start": 1509110,
            "text": "Die ist schon in Spanisch übersetzt. Genau."
        },
        {
            "end": 1556630,
            "speaker": "B",
            "start": 1511590,
            "text": "Wundervoll. Die verschiedenen Sprachen verlinken wir auch in den Shownotes und noch vielleicht ein paar weitere Ideen. Falls ihr Teilnehmer eines lokalen Meetups seid, fragt den Meetup Organisator doch einfach mal ganz kurz, hey, kann ich diese Petition vorstellen? Postet den Link einfach mal im internen Engineering Channel bei euch im Slack in der Firma oder oder oder. Und besonders jetzt gerade kurz zu Weihnachten werdet ihr mit hoher Wahrscheinlichkeit mit ganz vielen Leuten an einem wunderschön gedeckten Essenstisch sitzen, zumindest hoffe ich das. Und sprecht doch einfach mal da mit eurer Familie, wie die ihr Handy bedienen und dann und dann versucht doch einfach mal ein bisschen Awareness dafür zu schaffen und vielleicht kriegt man ja dadurch noch mal eine Unterschrift. Denn unterschreiben ist wirklich einfach. Einfach auf die Petitionswebseite gehen, findet ihr natürlich auch ganz dick in den."
        },
        {
            "end": 1567670,
            "speaker": "C",
            "start": 1557750,
            "text": "Und was echt super ist, guckt euch bitte die Kommentarspalte an. Es sind so viele positive Nachrichten da. Ich habe wirklich, wenn ich mit Leuten rede, immer nur positives Feedback bekommen."
        },
        {
            "end": 1591460,
            "speaker": "B",
            "start": 1567670,
            "text": "Boris, vielen lieben Dank, dass du die Arbeit da reinsteckst. Ich kann mir vorstellen, es war Arbeit, die Petition zu starten und es war noch mehr Arbeit bzw. Ist noch mehr Arbeit, jetzt die Werbetrommel zu rühren. Wir hoffen natürlich, mit dieser Episode berühren wir ein bisschen die Wärmetrommel und versuchen dich natürlich auch zu unterstützen. Vielen lieben Dank, dass du die Zeit genommen hast, edon Abo zu stehen. Das war's von uns und wir sagen Tschüss bis nächstes Mal."
        },
        {
            "end": 1594260,
            "speaker": "C",
            "start": 1592100,
            "text": "Danke für die Gelegenheit und auch Tschüss."
        },
        {
            "end": 1632610,
            "speaker": "A",
            "start": 1595700,
            "text": "Das war das heutige Türchen im Engineering Kiosk Adventkalender. Ich hoffe, ihr konntet wieder etwas mitnehmen zum Nachdenken, schmunzeln oder auch direkt ausprobieren. Wenn euch die Episode gefallen hat, erzählt es gern weiter an Kolleginnen oder eure Lieblings Nerds. Abonniert den Podcast und eine Bewertung wäre natürlich auch super cool. Ihr kennt ja das ganze Spiel. Wenn ihr noch mehr Lust auf Austausch habt, kommt gerne in unserer Engineering Kiosk Discord Community vorbei. Dort tummeln sich Entwickler innen, Datenmenschen und auch alles andere, was Rang und Namen hat im Tech Universe. Für heute machen wir das Türchen mal wieder zu, aber keine Sorge, das nächste wartet schon. Frohe Adventszeit in der Zwischenzeit. Bleibt offen für Neues und bis zur nächsten Episode."
        }
    ],
    "webhook_auth": false
}