{
    "acoustic_model": "assemblyai_default",
    "audio_duration": 508,
    "audio_url": "https://cloud.inlupus.at/s/XkL5D5SWHkkKrwz/download",
    "auto_chapters": false,
    "auto_highlights": false,
    "auto_highlights_result": {},
    "confidence": 0.96527267,
    "content_safety": false,
    "content_safety_labels": {
        "status": "unavailable"
    },
    "custom_topics": false,
    "disfluencies": false,
    "dual_channel": false,
    "entity_detection": true,
    "filter_profanity": false,
    "format_text": false,
    "iab_categories": true,
    "iab_categories_result": {},
    "id": "a3126a35-c5a7-49ab-93d5-28a01fbb68d5",
    "language_code": "de",
    "language_detection": false,
    "language_model": "assemblyai_default",
    "punctuate": true,
    "redact_pii": false,
    "redact_pii_audio": false,
    "sentiment_analysis": false,
    "speaker_labels": true,
    "speakers_expected": 3,
    "speed_boost": false,
    "status": "completed",
    "summarization": false,
    "throttled": false,
    "utterances": [
        {
            "end": 53320,
            "speaker": "A",
            "start": 4080,
            "text": "Willkommen zum Engineering Kiosk Adventskalender. Es ist mal wieder Zeit für ein neues Türchen. Und weil Weihnachten natürlich auch das Fest der Liebe genannt wird, dachten wir uns dieses Lass uns doch mal wieder etwas Liebe mit der deutschsprachigen Tech Podcast Szene teilen. Diese Episode ist eine solche Episode und sie kommt nicht von den Standard Engineering Kiosk Hosts Wolfgang oder mir, Mein Name ist Andi, sondern wir lassen uns den Engineering Kiosk mal für einen Tag aus der Hand nehmen. Heute übernimmt ein befreundeter Podcast das Mikro und bringt ihm ein paar neue Perspektiven, ein anderes Thema und vielleicht den ein oder anderen Gedanken, der über unsere eigene Bubble hinausgeht. Wir denken da draußen gibt es großartige Tech Podcasts, die unbedingt mehr Aufmerksamkeit verdienen. Und wir denken Wissen, Inspiration und gute Geschichten sollte man am besten teilen. Also zurücklehnen, neugierig sein. Heute mit Wolfgang vom Digitale Anomalien Podcast. Los geht's, viel Spaß."
        },
        {
            "end": 463810,
            "speaker": "B",
            "start": 54370,
            "text": "In der Informatik stößt man immer wieder auf die Begriffe fu, bar und fubar. Und diese Begriffe, die werden häufig als Variablennamen in Programmierbeispielen verwendet und dort fungieren sie als beliebige Bezeichner. Im Deutschen könnte man sie auch als Dings oder blablabla bezeichnen. Eine solche generische und damit nichtssagende Bezeichnung nennt man übrigens auch metasyntaktische Variable. Und ihr ahnt es das ist der perfekte Smalltalk Opener für die nächste Party. Aber woher kommen diese Begriffe eigentlich? Lasst uns mal gemeinsam in die Origin Story eintauchen. Im Internet stößt man schnell auf zwei Hauptquellen, die die Wortherkunft von foo beschreiben. Da ist zum einen der RFC neun tausend zwei und neunzigste RFC steht für Request for Comments und das sind so technische Dokumente, die oft Internetstandards beschreiben und fortlaufend nummeriert werden. Neben sehr technischen Inhalten erscheinen am erster april eines Jahres auch immer wieder rfcs, die nicht ganz so ernst gemeint sind. Das erwähnte RFC drei tausend zwei und neunzig mit dem Titel anomalogyafu erschien am erster april zwei tausend eins Es handelt sich dabei jedoch nicht um einen klassischen Aprilscherz mit frei erfundenem Inhalt, sondern um eine humorvolle Würdigung. Tatsächlich finden sich die in diesem RFC aufgeführten Fakten auch an anderen Stellen und daher sind sie vermutlich valide. Eine dieser Quellen ist das Jargon File, eine Art Hacker Glossar. Und das ist kein Zufall, denn hinter beiden Publikationen steht Eric S. Raymond, ein bekannter Open Source Aktivist und Autor, der in den letzten Jahren leider durch politisch und gesellschaftlich höchst fragwürdige Äußerungen aufgefallen ist. Während meines Studiums las ich seinen Aufsatz the Cathedral and the Bazaar und der war in den späten er und frühen Jahren in der Open Source Community sehr populär. Doch zurück zum Begriff Foo. Der tauchte wahrscheinlich zum ersten Mal in den er Jahren in der surrealistischen Comicserie Smokey Stover von Bill Holman auf. In diesen Comics, die zwischen ein tausend neun hundert dreiig und ein tausend neun hundert zwei und fünfzig erschienen sind, wird Foo häufig in witzigen Zusammenhängen verwendet. Bill Holmans Neffe betreibt eine Website zu Ehren seines Onkels und dort gibt es neben vielen Fotos und Comics auch eine Biografie des Künstlers Künstlers und dort what's Foo. My uncle found this word engraved on the bottom of a jade statue in San Francisco's Chinatown. The word Foo means good luck. Und tatsächlich, das chinesische Wort fu mit Fu geschrieben, bedeutet eigentlich Glück. Und vielleicht hat Bill Holman aus diesem Fu vielleicht einfach nur Foo gemacht, vielleicht um eine Verwechslung mit Fu c k zu vermeiden oder um dem wohlklingenden Wort eine eigene Note zu geben. Jedenfalls wird das Wort in seinen Comics ausgiebig verwendet, und zwar ohne konkrete Bedeutung, sondern als Nonsenswort. Figuren sagen es, Es steht auf Schildern und die Hauptfigur Smokey Stover, ein Feuerwehrmann, bezeichnet sich selbst als Foo Fighter und nicht als Firefighter. Und natürlich fährt er mit seinem Foo Mobile durch die Gegend. Foo und einige andere Begriffe sind Running Gags in den Comics. In den folgenden Jahren verbreitete sich Foo und ein tausend neun hundert acht und dreiig tauchte zum Beispiel ein Schild mit der Aufschrift Silence is Foo in dem Warner Bros. Zeichentrickfilm the Duffy Dog auf. Während des Zweiten Weltkriegs wurde Foo von alliierten Piloten für unerklärliche Phänomene verwendet, die später als ufos bekannt wurden. Es wird vermutet, dass sich die Piloten auf die Smokey Stuwer Comics bezogen und so entstand der Begriff Foo Fighters als Synonym für ufos. Die bekannte Rockband der Foo Fighters leitet ihren Namen übrigens von dieser Geschichte ab. Im Zweiten Weltkrieg entstand auch der Begriff FUBA, also F U bar und nicht foobar. Fuba steht für fucked up beyond all recognition oder für fooled up beyond all recognition oder für Ähnliches. Es gibt viele Varianten davon und obwohl es einige Parallelen gibt, beide Begriffe klingen ähnlich und haben keine konkrete Bedeutung. Haben sie keinen gemeinsamen Ursprung. Dennoch werden sie heute oft verwechselt oder gar synonym verwendet. In den späten er Jahren tauchte der Begriff dann im Tech Model Railroad Club, kurz TMRC, das MIT auf. Man kann sich vorstellen, dass es in diesem Club nicht nur um das Basteln von Modelleisenbahnen ging, sondern dass das ganze Thema etwas, naja, nerdiger bzw. Wissenschaftlicher angegangen wurde. Und so gab es neben einer großen Modelleisenbahn mit komplexer Steuerungstechnik auch viele Bräuche und ein eigenes Fachvokabular, das sich dort entwickelt hatte. Und natürlich gab es da auch einen entsprechenden Glossar und da taucht foo wieder auf. Auch hier erscheint der Begriff foo als universeller Begriff ohne feste Fu hier foo, da fu. Eben. In der Wikipedia findet sich dann noch der Hinweis, dass es im TMRC neben dem Foo Knopf auch einen Bar Knopf gab. Einen Beleg, einen Weg dafür gibt es allerdings nicht. Und dann verbreiteten sich Foo und Bar weiter in Technik und Informatik und so findet sich fu ba, diesmal mit OO geschrieben, als Variable im Spiel Colossal Cave Adventure von ein tausend neun hundert sieben und siebzig oder der Begriff Foo in einem Assembler Handbuch von Intel aus dem Jahr ein tausend neun hundert acht und siebzigste Heute werden Foo und Bar nicht nur in den eingangs beschriebenen Programmierbeispielen verwendet. Im Jahr zwei tausend drei veranstaltete der Verlag o'reilly Media eine informelle Konferenz für ausgewählte Innovatoren, Entwickler und Technologen. Diese Friends of o'reilly, kurz FOO, veranstalteten quasi ein Foo Camp. Das Format der Veranstaltung gefiel den Teilnehmenden, aber einige störten sich an der Exklusivität. So entstand zwei tausend fünf das Konzept der Barcamps. Barcamps sind offene Unkonferenzen, die auf den Prinzipien des fucams basieren. Auch hier gestalten die Teilnehmenden die Sessions selbst, was einen dynamischen Austausch von Ideen fördert. Und das war die kurze Geschichte von Foo Bar. Ich bin Wolfgang und ich wünsche dir eine schöne Weihnachtszeit."
        },
        {
            "end": 496450,
            "speaker": "A",
            "start": 464370,
            "text": "Hier ist wieder Andi vom Engineer Kiosk. Das war es auch schon wieder mit dem heutigen Adventskalendertürchen, präsentiert von unseren Freunden aus der deutschsprachigen Tech Podcast Szene. Wenn dir gefallen hat, was du gehört hast, hör unbedingt doch mal dort rein. Supportet die Leute, die gute Inhalte machen. Die Links zum Episodenthema, aber auch zu dem Podcast findet ihr natürlich wie immer in den Shownotes. Und wenn du Lust hast, dich mit ganz vielen Gleichgesinnten auszutauschen, schau doch mal in unserer Engineering Kiosk Discord Community vorbei. Dort hängen Entwickler und Entwicklerinnen, Architektinnen, Datenmenschen und Technerds aller Art rum. Genau wie du, genau wie Wolfgang, genauso wie ich."
        },
        {
            "end": 497730,
            "speaker": "C",
            "start": 496450,
            "text": "Ihr wisst schon, was wir meinen."
        },
        {
            "end": 502410,
            "speaker": "A",
            "start": 497730,
            "text": "Wir hören uns bei der nächsten Episode wieder. Bis dahin, frohe Weihnachten und eine wunderbare Adventszeit."
        },
        {
            "end": 503050,
            "speaker": "B",
            "start": 502410,
            "text": "Bis bald."
        }
    ],
    "webhook_auth": false
}