{
    "acoustic_model": "assemblyai_default",
    "audio_duration": 589,
    "audio_url": "https://cloud.inlupus.at/s/pHSp6Ly6NGWRqGA/download",
    "auto_chapters": false,
    "auto_highlights": false,
    "auto_highlights_result": {},
    "confidence": 0.9585041,
    "content_safety": false,
    "content_safety_labels": {
        "status": "unavailable"
    },
    "custom_topics": false,
    "disfluencies": false,
    "dual_channel": false,
    "entity_detection": true,
    "filter_profanity": false,
    "format_text": false,
    "iab_categories": true,
    "iab_categories_result": {},
    "id": "c1f2534a-98fb-4427-b010-0cee8b3fc53b",
    "language_code": "de",
    "language_detection": false,
    "language_model": "assemblyai_default",
    "punctuate": true,
    "redact_pii": false,
    "redact_pii_audio": false,
    "sentiment_analysis": false,
    "speaker_labels": true,
    "speakers_expected": 5,
    "speed_boost": false,
    "status": "completed",
    "summarization": false,
    "throttled": false,
    "utterances": [
        {
            "end": 54370,
            "speaker": "A",
            "start": 3840,
            "text": "Willkommen zum Engineering Kiosk Adventskalender. Es ist mal wieder Zeit für ein neues Türchen. Und weil Weihnachten natürlich auch das Fest der Liebe genannt wird, dachten wir uns dieses Lass uns doch mal wieder etwas Liebe mit der deutschsprachigen Tech Podcast Szene teilen. Diese Episode ist eine solche Episode und sie kommt nicht von den Standard Engineering Kiosk Hosts Wolfgang oder mir. Mein Name ist Andi, sondern wir lassen uns den Engineering Kiosk mal für einen Tag aus der Hand nehmen. Heute übernimmt ein befreundeter Podcast das Mikro und bringt ihm ein paar neue Perspektiven, ein anderes Thema und vielleicht den ein oder anderen Gedanken, der über unsere eigene Bubble hinausgeht. Wir denken da draußen gibt es großartige Tech Podcasts, die unbedingt mehr Aufmerksamkeit verdienen und wir denken Wissen, Inspiration und gute Geschichten sollte man am besten teilen. Also zurücklehnen und neugierig sein. Heute mit Felix, Moritz und Volkmar vom Focus on DevOps Podcast. Los geht's. Viel Spaß."
        },
        {
            "end": 60050,
            "speaker": "B",
            "start": 54690,
            "text": "Das machen wir einfach. Du, also ein bisschen Style. Unseren Style will ich schon reinbringen."
        },
        {
            "end": 62170,
            "speaker": "C",
            "start": 60050,
            "text": "Ja. Hast du dir heute die Socken falsch."
        },
        {
            "end": 63170,
            "speaker": "D",
            "start": 62170,
            "text": "Rum angezogen oder was?"
        },
        {
            "end": 70170,
            "speaker": "B",
            "start": 63490,
            "text": "Ich habe immer zweifarbige Socken, habe ich von Mary. Kann dich keiner verhexen. Das ist einfach so. Mich hat noch nie jemand Ich hab."
        },
        {
            "end": 74010,
            "speaker": "D",
            "start": 70170,
            "text": "Noch nie unter deine Hose geguckt. Ne, ich glaube, das traut sich bei dir auch niemand."
        },
        {
            "end": 77890,
            "speaker": "B",
            "start": 74010,
            "text": "Ne, absolut nicht. So, jetzt, zack, wir sind jetzt in der Rolle."
        },
        {
            "end": 84300,
            "speaker": "D",
            "start": 77890,
            "text": "Und was denn für eine Rolle? Ich war gerade schon in meiner Rolle."
        },
        {
            "end": 88140,
            "speaker": "C",
            "start": 87420,
            "text": "Sehr schön."
        },
        {
            "end": 89700,
            "speaker": "B",
            "start": 88460,
            "text": "Genau. Wo sind wir denn hier?"
        },
        {
            "end": 94860,
            "speaker": "D",
            "start": 89700,
            "text": "Moritz, Wieso? Felix ist auch dabei. Frag den doch. Felix, wo sind wir hier? Weißt du, wo wir sind?"
        },
        {
            "end": 98220,
            "speaker": "E",
            "start": 96300,
            "text": "Wir haben uns verlaufen offensichtlich."
        },
        {
            "end": 109590,
            "speaker": "D",
            "start": 98780,
            "text": "Ich wollte zum Kiosk und mir eine Spezi holen. Ich bin bei Engineering rausgekommen. Ja, haben die Spezi, glaube nicht. Siehst du mal, ne? Genau."
        },
        {
            "end": 116830,
            "speaker": "C",
            "start": 109590,
            "text": "Wir sind der Focus on DevOps Podcast. Wir bringen euch alle zwei Wochen News und Deep Dive Themen aus dem Fokus."
        },
        {
            "end": 122670,
            "speaker": "D",
            "start": 116830,
            "text": "On DevOps System Ökosystem, aus dem Cloud Native Ökosystem, so kann man es sagen. Genau."
        },
        {
            "end": 130270,
            "speaker": "C",
            "start": 122750,
            "text": "Und wir freuen uns heute hier eine kleine Adventskalender Folge gestalten zu können. Und wenn ihr jetzt das Türchen aufgemacht habt und euch denkt, oh Gott, was."
        },
        {
            "end": 133870,
            "speaker": "D",
            "start": 130270,
            "text": "Guckt mich denn da an? Wir Keine Sorge, es wird noch schlimmer."
        },
        {
            "end": 134880,
            "speaker": "C",
            "start": 134240,
            "text": "Genau, ja."
        },
        {
            "end": 137240,
            "speaker": "D",
            "start": 135520,
            "text": "Denn wir haben euch heute so ein."
        },
        {
            "end": 158960,
            "speaker": "C",
            "start": 137240,
            "text": "Kleines Special aus unseren Podcast Folgen mitgebracht. Neben Infos und News zum Thema Deep Dive Themen geben wir immer noch so gerne ein paar kleine Tooltips ab. Das nennen wir dann Tüdelkrams, weil das immer so ein bisschen das ist, was auf dem Grabbeltisch liegen bleibt. Und da haben wir euch ein paar Schmankerl mitgebracht, die euch vielleicht so ein bisschen die Adventszeit versüßen. Ja, ich glaube, wir stellen uns alle mal der Reihe nach vor. Felix, wer bist du denn?"
        },
        {
            "end": 160480,
            "speaker": "E",
            "start": 159360,
            "text": "Ja, ich bin Felix."
        },
        {
            "end": 166380,
            "speaker": "D",
            "start": 162460,
            "text": "Super, alles klar, hast du gut gemacht. Zehn Prozent."
        },
        {
            "end": 168140,
            "speaker": "B",
            "start": 166940,
            "text": "Und ich bin Volkmar."
        },
        {
            "end": 169660,
            "speaker": "D",
            "start": 168700,
            "text": "Und ich bin der Moritz."
        },
        {
            "end": 171100,
            "speaker": "C",
            "start": 169660,
            "text": "Genau, der, der so schnell redet."
        },
        {
            "end": 172780,
            "speaker": "B",
            "start": 171100,
            "text": "Genau, genau. Darf ich jetzt?"
        },
        {
            "end": 175340,
            "speaker": "C",
            "start": 172780,
            "text": "Jetzt aber. Okay, jetzt aber zum Tüdelkrams."
        },
        {
            "end": 273070,
            "speaker": "B",
            "start": 175580,
            "text": "Gut, ich dachte mir tatsächlich, weil ich immer in unserem Podcast so viel Kubernetes lastige Dinge vor oder wir sowieso von uns geben, dachte ich mir, ich gucke mir mal die Plugins an, die halt über den Crew Installer, also quasi CI von Kubernetes, also quasi das Cube Kaddle, wie man es nennt, angefl. Da gibt es so ein paar Schmankerl, die ich gerne benutze und eins sogar, was tatsächlich nativ funktioniert, was ich gar nicht wusste, dass es so funktioniert. Initial gibt es das PVC Plugin so für alle, die Kubernetes nicht benutzen, ist halt ein Thema Storage in Kubernetes. Das macht man dann halt über PVC, sogenannte Persistent Volume Claims, die man erstellen kann. Und da gibt es ein Plugin zu, wo ich mir dann halt quasi pvcs erstellen kann und halt die Inhalte von diesen pvcs dann prüfen und anzeigen lassen kann. Das finde ich ganz gut, ganz praktisch, wenn ich da halt Volumes in Kubernetes hantieren möchte. Außerdem mein zweites kubecdl wird. Ich bin großer Freund von Virtualisierung auf Basis von Kubernetes dank kubevirt. Und tatsächlich gibt es natürlich eine eigene CLI, also WIRT, die wirtctl, aber es gibt natürlich auch das Plugin, womit man dann halt mit den guten Funktionen und der Bash Completion von kubectl halt sehr gut agieren kann. Finde ich mega super gut. Und ein Plugin, wo ich gar nicht wusste, dass es gar kein Plugin ist, sondern eine Integration. Ich kenne es von openshift, das kubectl Debug. Das macht es halt möglich, in Container oder auf Nodes zu springen und dann halt in den Kontext zu wechseln. Das wusste ich gar nicht, dass es im Kontext von kubectl so existiert ohne Plugin. Ich dachte, es ist ein Plugin. Jetzt weiß ich, dass es existiert. Ich bin fertig."
        },
        {
            "end": 276030,
            "speaker": "C",
            "start": 273390,
            "text": "Das ist auf jeden Fall spannend. Ich würde mal sagen, dann mache ich direkt mal."
        },
        {
            "end": 288850,
            "speaker": "E",
            "start": 276030,
            "text": "Ich kann noch mal zwischengrätschen, was nachschieben. Und zwar habe ich gerade bei deiner Erklärung dran gedacht, das ist Geistesblitz. Ich habe an einen meiner Lieblingsentwickler gedacht, falls ihr das hört, wäre das lustig, weil wir auch länger nicht mehr gesprochen haben. Mein ehemaliger Kollege Tom, den ich sehr."
        },
        {
            "end": 292050,
            "speaker": "C",
            "start": 288850,
            "text": "Vermisse auf uns liebe Grüße an Tom."
        },
        {
            "end": 293370,
            "speaker": "B",
            "start": 292050,
            "text": "Hallo Tom. Grüße."
        },
        {
            "end": 318640,
            "speaker": "E",
            "start": 293690,
            "text": "Tom hat auch ein kubectl quasi Plugin geschrieben, das gibt es bei GitHub unter seinem Handle, können wir verlinken für einen speziellen Use Case. Und zwar nutzt das die hashicorp Vault Kubernetes Secrets Engine, um Token zu lösen. Das heißt, du kannst dann quasi den Login machen und deinen Vault Login benutzen, wenn das richtig konfiguriert ist, um just in time quasi dann Kubernetes Secrets für dein quasi kubectl zu bekommen, um dich da anzumelden."
        },
        {
            "end": 320200,
            "speaker": "B",
            "start": 318640,
            "text": "Sehr cool. Ich such gerade zu."
        },
        {
            "end": 321280,
            "speaker": "C",
            "start": 320200,
            "text": "Das hört sich auch spannend an."
        },
        {
            "end": 325120,
            "speaker": "D",
            "start": 321280,
            "text": "Hat das zufällig den Namen kubectl getkeule, ne?"
        },
        {
            "end": 326800,
            "speaker": "C",
            "start": 325440,
            "text": "Ja, okay, alles klar."
        },
        {
            "end": 327560,
            "speaker": "E",
            "start": 326800,
            "text": "Jetzt sagst du."
        },
        {
            "end": 337760,
            "speaker": "C",
            "start": 327560,
            "text": "Jetzt sag ich. Okay, alles klar. Wunderbar. Ich hab euch was mitgebracht, was ihr vielleicht schon kennt. Ich find's relativ spannend. Ich hab mich damit jetzt ein bisschen mehr beschäftigt. Und zwar die Color Container. Kennt ihr die Color Container? Folgt mal Felix."
        },
        {
            "end": 339210,
            "speaker": "E",
            "start": 337930,
            "text": "Ja, kenne ich schon mal von gehört."
        },
        {
            "end": 455000,
            "speaker": "C",
            "start": 339450,
            "text": "Also im Endeffekt ist es ein kleines Tool, was im Endeffekt so ein bisschen darauf aus ist, eine höhere Security für bestimmte Workloads und Kubernetes Cluster sicherzustellen. Und zwar gibt es dann, wenn ihr euch die Cutter Container installiert habt, be Cluster entsprechend einen Cutter Shim. Der nimmt, wenn ihr einen Cutter Container hochfahren wollt, eben die OC Commands bzw. Den Spec eures Deployments entgegen, konvertiert das entsprechend um in grpc Requests und sendet die entsprechend auf euren Hypervisor oder auf eure Cloud API, wie auch immer und erstell darauf entsprechend eine neue virtuelle Maschine nur für einen Pod für einen Container, den ihr hochziehen wollt. In dieser virtuellen Maschine ist entsprechend noch mal eine leichtgewichtige Container Runtime, wie zum Beispiel cryo und in der virtuellen Maschine ist dann praktisch nested der Pod drin. Das heißt, der Pod ist nochmal besonders isoliert, weil er eben auf Hypervisor, also als VM isoliert ist und nicht eben durch einen Linux Namespace isoliert wird. Das heißt, er ist ein bisschen abgesicherter, kann nicht so einfach ausbrechen oder man kann nicht so einfach aus diesem Container ausbrechen. Ich finde dieses Konstrukt interessant, insbesondere im Kontext von Confidential Computing, weil so können wir beispielsweise Cluster aufbauen und wenn wir Confidential Workloads haben wollen, dann können wir beispielsweise Qatar Container als Operator dazu nutzen, eben Confidential vms in einem Trusted Execution Environment auf einer CPU hochzuziehen und dort eben unsere Confidential Workloads rein zu deployen und das in einem eigentlich nicht confidential Cluster. Die ganze Kommunikation mit dem POD läuft dann entsprechend über den CHIM. Alles, was ihr entsprechend ausführen wollt, läuft auch über den Chim. Ist auf jeden Fall eine schöne runde Lösung. Ist auch tatsächlich das Upstream Projekt zum Beispiel von den openshift Sandbox Containern, vielleicht schon mal davon gehört. Wenn ihr dann noch ein bisschen mehr wissen wollt über Confidential Computing, guckt euch in dem Kontext auch mal den Trusty Operator an, mit dem ihr entsprechend eure eigenen Attestierungsmechanismen aufbauen könnt, um Confidential Computing betreiben zu können. Das wäre es von mir, Felix, damit gebe ich an dich ab."
        },
        {
            "end": 508830,
            "speaker": "E",
            "start": 455000,
            "text": "Genau, Mir fällt es immer relativ schwer, neue Tipps zu finden, aber tatsächlich ergibt sich im Gespräch dann untereinander, dass doch nicht jeder quasi die Sachen kennt, die man täglich benutzt. Also ein Tool aus meiner Standard Werkzeugkiste heißt Lego und ist der Go ACME Client. Und damit kann man sowohl das entweder in seinen Ghost Skripten oder Programmen irgendwie direkt Let's Encrypt dann halt integrieren und da bestimmte Operationen durchführen oder eben das auch als CLI nutzen. Und vor allem mag ich halt, dass die, es ist relativ wenig Interaktion mit dem drumliegenden System. Also ich finde die direkten Alternativen, zum Beispiel ein certbot oder über das Python Ökosystem oder zum Beispiel gibt es ja auch ACME SH als Shell Variante, haben dann doch relativ so eine größere Integration und Lego ist ziemlich schlank, hat super, super viele, vor allem halt DNS Provider, alle möglichen Sachen, wie man die Challenges lösen kann und das gefällt mir einfach gut, nutze ich gerne und kann ich daher auch weiterempfehlen."
        },
        {
            "end": 518110,
            "speaker": "C",
            "start": 508830,
            "text": "Sehr schön, auf jeden Fall spannend. Man könnte ja jetzt fragen, pun intended, ob das Tool Lego auch dein System bricken kann, aber ich glaube, das wäre dann zu weit hergeholt."
        },
        {
            "end": 521560,
            "speaker": "E",
            "start": 518110,
            "text": "Ja, sorry, vielen Dank. Das ist ja zum Abschluss."
        },
        {
            "end": 522040,
            "speaker": "B",
            "start": 521640,
            "text": "Super."
        },
        {
            "end": 538440,
            "speaker": "C",
            "start": 522200,
            "text": "Genau, also wenn ihr auf jeden Fall jetzt in weihnachtliche Stimmung gekommen seid, freuen wir uns natürlich. Ansonsten könnt ihr auch gerne mal bei uns im Podcast vorbei hören oder uns Feedback da lassen. Wir sind immer gerne für euch da. Ansonsten vielen Dank und eine frohe Weihnachten. Genau, wir wünschen eine frohe Weihnachtszeit und."
        },
        {
            "end": 540320,
            "speaker": "D",
            "start": 538440,
            "text": "Einen guten Rutsch ins neue Jahr, wann."
        },
        {
            "end": 543480,
            "speaker": "C",
            "start": 540320,
            "text": "Auch immer das stattfinden wird. Kalligrün."
        },
        {
            "end": 584130,
            "speaker": "A",
            "start": 543800,
            "text": "Tschüss, Hier ist wieder Andi vom Engineering. Das war es auch schon wieder mit dem heutigen Adventskalendertürchen, präsentiert von unseren Freunden aus der deutschsprachigen Tech Podcast Szene. Wenn dir gefallen hat, was du gehört hast, hör unbedingt doch mal dort rein. Supportet die Leute, die gute Inhalte machen. Die Links zum Episodent Thema, aber auch zu dem Podcast findet ihr natürlich wie immer in den Shownotes. Und wenn du Lust hast, dich mit ganz vielen Gleichgesinnten auszutauschen, schau doch mal in unserer Engineering Kiosk Discord Community vorbei. Dort hängen Entwickler und Entwicklerinnen, Architektinnen, Datenmenschen und Tech Nerds aller Art rum, Genau wie du, genau wie Wolfgang, genauso wie ich. Ihr wisst schon, was wir meinen. Wir hören uns bei der nächsten Episode wieder. Bis dahin, frohe Weihnachten und eine wunderbare Adventszeit. Bis bald."
        }
    ],
    "webhook_auth": false
}