{
    "acoustic_model": "assemblyai_default",
    "audio_duration": 779,
    "audio_url": "https://cloud.inlupus.at/s/3C25wHQAeWYCkQZ/download",
    "auto_chapters": false,
    "auto_highlights": false,
    "auto_highlights_result": {},
    "confidence": 0.9655007,
    "content_safety": false,
    "content_safety_labels": {
        "status": "unavailable"
    },
    "custom_topics": false,
    "disfluencies": false,
    "dual_channel": false,
    "entity_detection": true,
    "filter_profanity": false,
    "format_text": false,
    "iab_categories": true,
    "iab_categories_result": {},
    "id": "1a397db9-7f2e-43f0-b0d5-6f7575817034",
    "language_code": "de",
    "language_detection": false,
    "language_model": "assemblyai_default",
    "punctuate": true,
    "redact_pii": false,
    "redact_pii_audio": false,
    "sentiment_analysis": false,
    "speaker_labels": true,
    "speakers_expected": 2,
    "speed_boost": false,
    "status": "completed",
    "summarization": false,
    "throttled": false,
    "utterances": [
        {
            "end": 26320,
            "speaker": "A",
            "start": 3840,
            "text": "Willkommen zum Engineering Kiosk Adventkalender oder für unsere deutschen Hörer Adventskalender. So viel Zeit muss ja noch sein, vor allem in dieser ruhigen Adventszeit. Da haben wir Zeit für Wissen Sinnvolles, aber auch weniger Sinnvolles. Und was sich Andi für dieses Türchen ausgedacht hat, mit welchem Wissen er jetzt um die Ecke biegen wird, das hört ihr gleich. Also zurücklehnen, Lauscher auf und los geht's."
        },
        {
            "end": 734320,
            "speaker": "B",
            "start": 27280,
            "text": "Heute habe ich mal ein etwas leichteres Thema für euch. Ihr kennt das bestimmt. Manchmal wollt ihr einfach nur den Kopf ausschalten nach einem anstrengenden Arbeitstag auf der Couch sitzen und ich denke mir dann jetzt mal so eine Runde daddeln, mal zocken, wär mal eine tolle Geschichte, einfach nur mal so eine Stunde Kopf ausschalten und relaxen. Dann denkt man, soll ich mir eine Konsole kaufen? Ich habe keine Konsole, ich spiele aber auch nicht so oft. Das bedeutet, die Konsole wird jetzt nur einmal genutzt werden und dann wieder im Schrank liegen und Staub fangen. Zusätzlich moderne Spiele sind auch echt kompliziert geworden, denn früher hast du es irgendwie angemacht und los gespielt und inzwischen machst du die Konsole an, musst du erst mal zehn Terabyte runterladen, dann machst du ein Autorennspiel an, dann musst du erst mal drei Stunden dein Auto konfigurieren, welche Felgen das hat und so weiter. Das interessiert mich alles gar nicht, Ich will ja nur eine Runde fahren. Also fragt man vielleicht mal das Internet, hey, habt ihr irgendwie ein paar gute Tipps? Und das Tolle ist, wir haben inzwischen eine relativ große Engineering Kiosk Discord Community und da habe ich einfach mal die Frage reingestellt, hey Jungs und Mädels, habt ihr nicht vielleicht mal ein paar gute Vorschläge für ein paar gute Spiele für, ich sag mal, die interessant für Softwareentwickler und Softwareentwicklerinnen sind, wo man vielleicht nicht so einen unglaublich hohen Suchtfaktor hat wie World of Warcraft oder ähnliches, wo man halt nicht immer sein ganzes Leben direkt rein buttert, sondern wo man einfach nur mal eine Stunde abschalten kann. Und da kamen sehr, sehr gute Vorschläge und ein paar dieser Spiele für Softwareentwicklerinnen möchte ich jetzt einfach nur mal vorstellen, weil die haben mich so begeistert, habe mich weggeblasen, muss ich zugeben, wow, was es da nicht so alles gibt. Deswegen springen wir mal rein. Ich stelle euch einfach mal drei bzw. Vier Spiele für softwareentwicklerinnen vor. Mit dem ersten Spiel tue ich mir wahrscheinlich selbst keinen Gefallen, weil ich auch schon von dem Suchtfaktor gesprochen habe. Wir fangen mal an mit einem Klassiker, das nennt sich Factorio. Ein D Spiel mit einem leider zu hohen Suchtfakt. Die Story ist recht Du machst eine Bruchlandung auf einem neuen Planeten und deine Aufgabe ist es, Ressourcen zu sammeln, diese zu raffinieren und daraus eine neue Rakete zu bauen, um wieder von diesem Planeten wegzukommen. So weit, so gut. Ressourcen, Was ist das? Naja, man fängt an Holz zu sammeln, danach baut man Förderer, um Erz abzubauen und zu fördern. Die Förderer selbst werden dann mit dem Holz befeuert, daraus entstehen dann Eisen und Kupferplatten, die dann verbaut werden und daraus kann man andere Projekte machen. Um die ganzen Ressourcen dann immer zu den entsprechenden Stellen, zum Beispiel zu diesen Öfen und so weiter zu transportieren, baut man halt Förderbänder und Greifarme. Ihr merkt schon. Und da fängt die Automation an, denn genau das ist dieses Rabbit Hole. Denn um den Motor herzustellen, sind zum Beispiel Hochöfen notwendig und so weiter und so fort. Und auf dem Weg zur Raketentechnik gibt es dann einen sehr, sehr großen Tech Tree, der erforscht werden muss. Förderbänder können zum Beispiel später durch Züge ersetzt werden, um mehr Ressourcen zu transportieren, sogar mit einem Fahrplan bzw. Mit einer Fahrplan Engine. Ihr merkt schon, dieses Engineering Rabbit Hole und Nerdiness ist schon sehr, sehr groß. Der Game Loop selbst, also der Aufbau und die Optimierung ähnelt so ein bisschen an die Anno Reihe und die ganzen Automatisierungen und den Aufbau von Industrie, den du da betreibst, um halt deine neue Rakete zu bauen, verschmutzt aber leider auch die Umwelt. Und dann kommen immer so Krabbelviecher aka Bugs und die mögen das natürlich nicht, wenn du deren Umwelt verschmutzt. Also wirst du hier und da auch mal angegriffen. Aber das ist nur so ein kleiner Nebenstrang. Was aber wirklich der hohe Suchtfaktor ist, ist diese Automatisierung. Und mit dieser Automatisierung kann man auch enorm komplexe Schaltungen realisieren. Schaut einfach mal auf YouTube, da gibt es ein paar echt krasse Leute. Story Elemente gibt es recht wenig, aber durch diese ganzen Förderbänder und Automatisierung wird auf jeden Fall dein perfektionisten Attribut sehr sehr hart getriggert. Aber wie gesagt, offizielle Warnung, falls ihr mit Factorio mal anfangt, der Suchtfaktor ist sehr sehr hoch und da können etliche Stunden draufgehen. Also dafür braucht man aber eigentlich keine Programmierkenntnisse oder Ä, sondern es ist nur ein, ich sag mal, Aufbau und Optimierungs und Automation Spiel, wo du dann vielleicht sogar mehrmals durchläuft, weil deine Förderbänder vielleicht nicht immer gerade laufen oder ähnliches. Naja, das ist auf jeden Fall das erste Spiel sehr sehr angenehm verfügbar via Steam auf Linux, Windows und Mac. Das zweite Spiel, was ich euch vorstellen möchte, hat ein bisschen mehr mit Programmierung zu tun und es geht auch wieder um Automatisierung und es geht um mein Lieblingsthema Landwirtschaft, denn ich denke Landwirtschaft ist ein unglaublich cooler Jo, beziehungsweise ist auch sehr wichtig und sehr vielfältig und was liebe ich mehr als Landwirtschaft kombiniert mit Technik. Das Spiel heißt the Farmer was replaced. Worum geht es? Du siehst ein landwirtschaftliches Feld von oben D, das Feld selbst in der Regel ein Grid, aber es gibt es dann auch später in unterschiedlichen Größen. Du steuerst eine Drohne und musst dich mit dieser Drohne um dein Feld kümmern. Kümmern heißt in diesem Fall bewirtschaften. Wie steuerst du nun diese Drohne? Achtung mit Quellcode. Du musst eine Python ähnliche Sprache schreiben, um Ressourcen zu, um dadurch weitere Technologien freizuschalten und der effizienteste Landwirt der Welt zu werden. Genau wie in der richtigen Programmierung hast du also diverse Funktionen zur Verfügung zum Ernten und du kannst auch eigene Funktionen bauen. Wie du nun dieses Feld abarbeitest, bleibt komplett dir überlassen. Auf YouTube gibt es einige Leute, die grasen das Feld mit klassischen Sortieralgorithmen wie zum Beispiel eine Bubble Sort ab. Im Spiel selbst hast du natürlich eine Dokumentation von Funktionen und Konstanten und diversen Keywords, die diese Python ähnliche Sprache unterstützt. Während du da so dein Feld abgrabst, kannst du natürlich auch verschiedene Technologien durch den Tech Tree freischalten, wie zum Beispiel dein Feld wird dann später zu einem Labyrinth oder du kannst ja auch mehrere Drohnen freischalten. Du merkst schon, das wird halt programmiertechnisch auch ein bisschen kompliziert, wenn du mehrere Drohnen steuern musst und du spielst dir dann natürlich mehr und mehr Programmierfunktionen frei. Wie läuft diese Programmierung zum Beispiel ab? Das X Grid ist ganz normal mit X und Y Koordinaten gesteuert und dann kannst du mit der Drohne darüber fliegen und okay, wenn der Boden Gras ist, dann pflüge den Boden um und pflanze eine Karotte, bewegt dich einen nach oben, also nach Norden, aber nur wenn du natürlich nicht am Ende des Feldes bist und so weiter und so fort. Also klassische, ich sag mal, Kartennavigierung mit der Drohne. Die ganze Sache wird mit der Zeit immer komplexer, immer mehr Sachen zum Anbauen kommen dazu und du kannst auch eigene Module und eigene Funktionen schreiben und die ähnlich wie bei Python halt importieren. Das Ziel des Spiels ist es, eine Farm bzw. Dein Feld durch das Schreiben von Code zu automatisieren, indem man eine Drohne programmiert, die Aufgaben wie Säen, Bewässern, Düngen und Ernten erledigt, um letztendlich der effizienteste Farm der Welt zu sein. Der Game Loop dauert jetzt nicht ewig, aber ich fand es mal ganz spannend, einfach mal so eine Stunde ein bisschen Python kurz zu schreiben, mit der Drohne übers Feld zu laufen und auf YouTube findet man echt lustige Leute, was sie da alles bauen Und natürlich kannst du da eine ganze Menge auch in Sachen Optimierung und Optimierungsalgorithmen lernen. Wer so zum Beispiel mal sich an Advent of Code denkt, was ist jetzt die effizienteste Art und Weise, dein Feld zu bewirtschaften? Spannend auf jeden Fall. Die ganze Sache ist verfügbar via Steam auf Windows, aber ich denke mal für Linux und Mac kann man die ganze Sache auch mit Wine oder Parallels emulieren. Beim dritten Spiel steigern wir das Nerd Level mal drastisch. Es geht um das Spiel Artifacts. Artifacts ist ein Sandbox MMORPG für Code Liebhaber. So beschreiben die sich zumindest selber. MMORPG steht für Massive Multiplayer Online Roleplay Game. Worum geht's? Du steuerst deine Charaktere vollständig, also komplett über eine HTTP API. Jede Aktion, die deinen Charakter aus kann, entspricht einem API an Punkt, den du programmatisch ansteuern musst. Du kannst bis zu fünf Charaktere gleichzeitig steuern und deine Charaktere können gegen Monster kämpfen, Ressourcen sammeln, Gegenstände herstellen und so weiter und so fort. Das ganze Spiel hat in der D Welt, also wieder klassisch mit X und Y Koordinaten, musst du agieren Um zum Beispiel deinen Charakter zu bewegen, musst du einen Post Request an die API senden und du kannst zum Beispiel gegen Gegner kämpfen. Gegner wäre zum Beispiel ein Huhn. Um besser beim Kämpfen zu werden, musst du dann bessere Waffen haben. Also machst du eine Mission, um die Ressourcen zu sammeln, um dir eine bessere Waffe zu bauen. Und mit jeder Aktion bekommt ein Charakter also mehr Erfahrungspunkte, also XP. Das sind aber nur ein paar Beispiele, die du machen kannst. Du kannst zum Beispiel auch Kupfererz sammeln und dann verwandelst du das Kupfer, um deine Ausrüstungsgegenstände herzustellen. Oder du kannst Fische fangen und die kannst du dann kochen, um Verbrauchsgüter zu erhalten, mit denen du dann deine Lebensenergie schneller regenerieren kannst, weil beim Kampf kriegst du zum Beispiel auch Schaden. Ziel des Spiels ist es, eine Automatisierung zu bauen, die natürlich all das für dich macht. Und wie bereits gesagt, alles, wirklich alles ist ein API Endpoint. Sachen kaufen, Geld auf die Bank einzahlen, Ressourcen sammeln, Essen zubereiten, kämpfen und so weiter und so fort. Artifact selbst bietet einen Online UI Client, mit dem man dann seinen Charakter sehen kann, wenn man ihn per API steuert. Also du hast auch so eine Art View. Ich finde das Konzept einfach mega gut, besonders wenn man das Ganze mal ein bisschen durchdenkt und mit aktuellen AI Modeln kombiniert, können da echt wilde Dinge entstehen. Ich kann mir gut vorstellen, dass dies echt ein cooler Spielplatz für einige Engineering Ideen sein kann. Denn was ist denn zum Beispiel, wenn du selbst deine nächste Aktion gar nicht entscheidest, sondern durch eine AI entscheiden lässt, Was kommt da raus? Und was diese ganze Sache eigentlich besonders lustig macht, das ist ein Massive Multiplayer Online Spiel. Das bedeutet, mehrere Spieler touren auf demselben Spielfeld rum und das könnte natürlich echt lustig werden, wenn mehrere Spieler gute Clients haben. Und ich bin mir sicher, auf GitHub findet man einige gute Demo Clients. Wer jetzt aber nicht so auf Rollenspiele steht, sondern eher so mehr, ich sag mal, auf die Fresse, kann sich mal Screeps Arena ansehen. Screeps Arena ist ein Online pvp Strategiespiel. Pvp steht für Player vs. Player, also wirklich knallhart auf die Fresse. Du schreibst also echtes JavaScript, um deine Einheiten zu steuern und sie kämpfen autonom gegen andere Spieler in einer One gegen One Arena mit Matchmaking. Andere Spieler und das ist finde ich ziemlich cool, müssen dabei noch nicht mal online sein, denn ihr Code macht ja alles. Auf GitHub findest du dafür JavaScript Starter, SDK und die ganze Sache ist auch via Steam für Windows, Mac und Linux erhältlich. Also ich glaube auch da kannst du auch ziemlich wild werden, auch mit AI und allem drum und dran oder einfach nur mit guten Algorithmen. Sehr, sehr coole Spielmodi auf jeden Fall. Das sind aber jetzt nur vier Spiele, die ich vorgestellt habe. Und als ich in der Discord Community, wie initial erwähnt, mal gefragt habe, hey, was habt ihr denn so für Spiele, Da kam eine ganze Menge cooles Zeug bei. Und was macht man, wenn man eine ganze Menge cooles Zeug hat? Logisch, man erstellt eine Liste. Also haben wir eine kuratierte Liste von siebzehn Spielen für Softwareentwickler und Softwareentwicklerinnen für euch zusammengestellt. Die ganze Sache findest du auf unserer Webseite Engineering Kiosk, aber natürlich auch in den Shownotes. Und falls du bereits ein Pro Gamer in einem dieser Spiele von dieser Liste bist, spring doch mal in unsere Discord Community, denn einige Leute in der Discord Community spielen diese Spiele schon und daher habe ich natürlich auch die Vorschläge. Und falls ihr noch weitere Spiele kennt, die eine spezielle Zielgruppe wie Softwareentwickler innen haben, die Liste, von der ich gesprochen habe, ist natürlich Open Source und auf GitHub verfügbar. Vielleicht kann dies deine erste Open Source Contribution werden, indem du ein Spiel hinzufügst. Ich würde mich auf jeden Fall freuen. Den Link zum Repository, zum GitHub Repository findest du in den Shownotes. Und nun wünsche ich euch eine ruhige Zeit und vielleicht findet ihr mal eine ruhige Stunde zwischen den Feiertagen, um das ein oder andere Spiel auszuprobieren. Mich würde es freuen, wenn ihr mal Feedback sendet, ob ihr vielleicht in eine dieser Spiele versunken seid oder kommt doch einfach mal in die Disco Community und fordert den ein oder anderen mal vielleicht zum Beispiel in Screeps Arena heraus, um zu zeigen, wie gut euer JavaScript Code ist. Ich wünsche euch nun viel Spaß beim Zocken, wir hören uns bald und tschüss."
        },
        {
            "end": 772920,
            "speaker": "A",
            "start": 736080,
            "text": "Das war das heutige Türchen im Engineering Kiosk Adventkalender. Ich hoffe, ihr konntet wieder etwas mitnehmen, zum Nachdenken, schmunzeln oder auch direkt ausprobieren. Wenn euch die Episode gefallen hat, erzählt es gern weiter an Kolleg Innen oder eure Lieblings Nerds. Abonniert den Podcast und eine Bewertung wäre natürlich auch super cool. Ihr kennt ja das ganze Spiel. Wenn ihr noch mehr Lust auf Austausch habt, kommt gerne in unsere Engineering Kiosk Discord Community vorbei. Dort tummeln sich Entwickler innen, Datenmenschen und auch alles andere, was Rang und Namen hat im Tech Universe. Für heute machen wir das Türchen mal wieder zu, aber keine Sorge, das nächste wartet schon. Frohe Adventszeit in der Zwischenzeit. Bleibt offen für Neues und bis zur nächsten Episode."
        }
    ],
    "webhook_auth": false
}