{
    "acoustic_model": "assemblyai_default",
    "audio_duration": 1124,
    "audio_url": "https://cloud.inlupus.at/s/nBJoX96gYtCZLD9/download",
    "auto_chapters": false,
    "auto_highlights": false,
    "auto_highlights_result": {},
    "confidence": 0.96533924,
    "content_safety": false,
    "content_safety_labels": {
        "status": "unavailable"
    },
    "custom_topics": false,
    "disfluencies": false,
    "dual_channel": false,
    "entity_detection": true,
    "filter_profanity": false,
    "format_text": false,
    "iab_categories": true,
    "iab_categories_result": {},
    "id": "09396428-b9fd-4ee4-a424-35f13960c979",
    "language_code": "de",
    "language_detection": false,
    "language_model": "assemblyai_default",
    "punctuate": true,
    "redact_pii": false,
    "redact_pii_audio": false,
    "sentiment_analysis": false,
    "speaker_labels": true,
    "speakers_expected": 2,
    "speed_boost": false,
    "status": "completed",
    "summarization": false,
    "throttled": false,
    "utterances": [
        {
            "end": 32470,
            "speaker": "A",
            "start": 6480,
            "text": "Du bist hier im Engineering Kiosk gelandet und zwar im Engineering Kiosk Adventskalender. Leider hat dieser Kalender nichts mit Schokolade zu tun. Doof finde ich auch. Na gut, machst du nix. Als Alternative bieten wir ein wenig Wissen an. Ein Thema kurz und knapp in ein paar Minuten und das Ganze bis Heiligabend. Präsentiert von Knecht Ruprecht und Krampus. Ach, scheiße falsche Zeile. Präsentiert von Wolfi. Los geht's, viel Spaß."
        },
        {
            "end": 1090860,
            "speaker": "B",
            "start": 34550,
            "text": "Geht es dir eigentlich auch so, dass wir zu Weihnachten irgendwie immer mehr Stress haben in dieser besinnlichen Zeit ganz allgemein, dass uns die Tasks auf unseren To Do Listen um die Ohren fliegen und eigentlich die Listen nur noch länger werden und noch mehr Stress produzieren? Das Phänomen gibt es natürlich nicht nur zu Weihnachten, sondern grundsätzlich immer. Und ich vermute mal, es kennen viele, dass man von der eigenen Taskliste eigentlich gesteuert wird und irgendwie so durch den Roboter nur mehr durchläuft und Tasks erledigt, ohne irgendwie ein gutes Gefühl zu haben. Es geht mir eigentlich auch oft so, aber ich habe immer versucht, meine Tasklisten in irgendeiner Form unter Kontrolle zu halten und ich möchte in dieser Episode mal meine drei bis vier wichtigsten Tipps teilen, die mir helfen, meine Tasks unter Kontrolle zu halten und mein Selbstmanagement etwas zu optimieren, damit das Stresslevel am Ende nach unten geht und vielleicht auch die Glücksgefühle nach oben. Der erste Punkt auf meiner Liste, also nicht auf meiner Taskliste, sondern auf der Liste der vier Empfehlungen meinerseits, ist die Übersichtlichkeit. Kurze Listen sind wirklich ein Must bei mir, um die Übersichtlichkeit zu erhalten. Also meiner Meinung nach ist eine Liste entweder klein genug für heute oder sie ist nur irgendwie eine Parkplatzliste. Also für mich ist eine Taskliste genau das, was gerade aktiv ist, was nicht geparkt ist und was ich im Idealfall heute oder in einem gewissen Zeitraum angehen muss. Wir sprechen jetzt also nicht von einer Inbox im Mail Ordner, wo einfach zehntausende E Mails liegen, sondern wirklich von einer kurzen Liste, die manuell gewartet wird, die mir die nächsten Tasks anzeigt. Wer übrigens dieses klassische Problem hat, dass die Inbox einfach E Mails hat, ich hatte das lange Zeit, bin dann irgendwann auf Inbox Zero umgestiegen und fahre damit extrem gut. Wer sich das Ganze mal anhören will, ich habe dazu auch eine eigene Episode gemacht, die ein hundert sechs und fünfzig Episode zu Inbox Zero im letztjährigen Adventkalender. Und das Wichtige ist, wenn man so eine einfache kurze Liste hat, ist, dass man eben genau weiß, was zu tun ist, dass man sich auch bewusst gemacht hat, was macht man, was macht man nicht. Vielleicht hat man eine Kill List, wo man genau diese Tasks hinschiebt, die man eben nicht machen will. Manche nennen das auch einfach Packlock oder ein Parkplatz, wo man alles so hinschiebt. Aber man kann es natürlich auch wirklich als explizite Kill List pflegen. Man kann auch zum Beispiel eine Waiting for Liste haben, wenn man auf Rückmeldung von einer anderen Person wartet, damit das aus dem Kopf ist, kann man die einfach auf die Waiting for Liste verschieben. Dann hat man die eigene Liste immer möglichst kurz und knackig und weiß eben, was als nächstes zu tun ist. Ich persönlich bevorzuge auch mehrere Listen, das heißt, ich habe mehrere Listen für unterschiedliche Kontexte. Zum Beispiel die Zeit ist bei mir ein Kontext, also was muss ich heute erledigen, was muss ich morgen erledigen. Es kann aber auch ein örtlicher Kontext sein. Was muss ich erledigen, wenn ich mal im Supermarkt stehe, wenn ich in den Baumarkt komme, was soll ich dort erledigen, was ist im Büro zu tun, was ist zu Hause zu tun? Und so bekomme ich wieder im Gesamten kurze Listen. Also gerade wenn ich Tasks habe, die ich nur an einem gewissen Ort machen kann, zum Beispiel im Büro oder bei mir zum Beispiel bin einmal die Woche an der Uni zu unterrichten. Alle meine Tasks, die Uni bezogen sind, sind auf so einer Kontextliste Uni. Und wenn ich vor Ort bin, kann ich, kann ich noch andere Tasks erledigen, wenn ich schon vor Ort bin und damit ist aber meine Hauptliste, was muss ich heute erledigen, ist frei und ich habe das aus dem Kopf, weiß aber das nächste Mal, wenn ich dort bin an der Uni, kann ich diese Kontextliste öffnen und weiß, was zu tun ist, kann das Ganze natürlich auch thematisch bündeln oder gruppieren, also nach einem speziellen Projekt zum Beispiel. Oder ich habe zum Beispiel auch so Listen, wo ich interessante Videos, Talks oder ähnliches aufschreibe. Und wenn ich mal Zeit habe und mir denke, okay, ich könnte jetzt eigentlich mal ein Video anschauen, gemütlich auf der Couch sitze, dann kann ich in die Liste reinschauen und da habe ich alle meine Videos, die ich gerne mal anschauen würde, irgendwelche Talks von Konferenzen oder ähnliches. Der zweite große Punkt, der mir sehr wichtig ist, ist, dass man den Scope beschränkt, also dass man möglichst kleine Aufgaben macht. Das kann man einerseits erreichen, indem man Timeboxing macht, das heißt, man definiert schon im Vorhinein, ich werde nur zwanzig Minuten an diesem Task arbeiten, auch wenn er länger ist, werde ich nur fünf und zwanzig dreiig neunzig Minuten arbeiten und dann einen anderen Task machen. Gerade wenn es um Overcommitment geht. Wenn ich am Tag nur meine vier Stunden habe, die ich an Tasks arbeiten kann, dann ist das Problem, wenn ihr einen größeren Task habt, dass ihr dann meistens frustriert am Ende den Task nicht beenden kann. Wenn ihr aber ein Timeboxing im Vorhinein schon definiert habt, nur dreiig Minuten, ich schreibe mir das sogar wirklich in den Header von dem Task in den Titel, da steht dann immer T Box dreiig, dann habe ich mich für mich entschieden, nur dreiig Minuten an diesem Task zu arbeiten und dann wird das Ganze natürlich auch wieder überschaubarer. Bei größeren Projekten bietet sich natürlich auch an, dass man Subtasks macht mit klaren Definitionen, damit man immer genau weiß, was ist der nächste Schritt, was ist die Next Action in diesem Projekt. Das heißt, wenn ich ein großes Projekt habe, muss das Monitoring aufbauen, dann kann es mal sein, dass der erste Schritt oder der Next Step ist, dass ich gewisse Agenten auf meinem ersten Server installiere oder auf dem zweiten Server und so kann ich das aufbröseln, dass man kleinere Tasks erledigt oder Alerting Rules erstellen oder vielleicht mache ich eben sogar nur fünf Alerting Rules erstellen oder eben Alerting Rules erstellen, was ich in zwanzig Minuten schaffe und dann nach den zwanzig Minuten habe ich Alert Rules erstellt, nicht alle, aber eben zwanzig Minuten und dann kann ich den Task abhaken. Und das ist eigentlich das Wichtige, damit ich wirklich am Ende sagen kann, diesen Task oder diesen Teil Task oder Subtask habe ich eben beendet. Und daher ist es eben auch wichtig, so eine Definition of Done im Mini Format zu machen. In dem Fall ist es die Zeit dreiig Minuten. Ich kann auch sagen, Definition of Done ist, wenn ich drei Alerting Rules eingerichtet habe, das ist meine Definition of Done von diesem Task. Das heißt, es muss ganz klar sein, welche Ziele, wann höre ich auf und wann ist der Task beendet. Also nicht nur, was ist der nächste Task, sondern auch, was will ich genau mit dem Task erreichen. Und wenn da nur ein Schwammiges Ding drinsteht, wie Monitoring verbessern, Das hilft mir persönlich natürlich gar nichts. Aber wenn ich dann genau sage, okay, in dreiig Minuten will ich zwei Alerts reviewen oder erstellen, einen umformatieren, einen updaten von den alten und vielleicht ein Runbook ergänzen, also eine Checkliste oder ein Runbook, wo ich durchgehen kann im Falle von einem Alert, dann habe ich eine klar definierte Metrik, wann ist es fertig? Und Monitoring verbessern ist halt so schwammig, dass es mir gar nichts sagt und man kann eigentlich alles runterbrechen. Sogar wenn ich jetzt denk Podcast Episode vorbereiten, was heißt denn das genau? Also kann mir überlegen, OK, überleg dir mal fünf Bullet Points, fünf Themen für eine Episode, dauert zehn Minuten, schreib eine Intro, schreib eine genauere Struktur, schreib einen roten Faden, kontaktiere einen Interviewpartner, was es dann auch immer ist, aber dass man wirklich runtergeht und auf kleinen Ebenen diese kleinen Tasks erstellt, die einen sehr begrenzten Scope haben. Und damit kann ich dann auch verhindern, dass ich ein großes Over Commitment habe, weil mir eigentlich vielleicht im Vorhinein gar nicht bewusst ist, wie groß eigentlich ein Task ist. Wenn es genau definiert ist und ich hab nur vier Stunden Zeit an dem Tag, kann ich das relativ gut einordnen, OK, dann nehme ich genau acht Tasks mit jeweils dreiig Minuten und ich kann euch nur eines Es gibt nichts Schöneres, als einen Task abzuhaken, wenn der abgeschlossen ist. Also für mich entstehen da zum Beispiel extreme Glücksgefühle und wenn ihr natürlich so Riesentasks habt, die sich über Tage und Tage hinauszögern, dann fehlt einfach dieses gute Gefühl, dass man irgendwas abhaken kann. Und darum ist es mir auch wichtig, dass man eben diese kleinen Aufgaben hat und die kleinen Listen, weil bei großen Listen ist man einfach nur ständig frustriert, wenn man nur erschlagen wird und auf einer Liste mit fünf hundert Punkten, wenn man da einen Punkt erledigt, wird man immer noch von vier hundert neun und neunzig Punkten erschlagen Und daher kleine Listen mit beschränktem Scope und kleine Aufgaben in diesen Listen. Jetzt habe ich schon als Beispiel erwähnt, OK, acht Tasks mit jeweils dreiig Minuten sind wir bei vier Stunden. Ja, das funktioniert in der Realität meistens nicht, weil es eben Context Switch Costs gibt, also Kosten, die entstehen, wenn ich von einem Projekt in das andere wechsel, von einem Kontext in den anderen. Wenn ich einen Podcast aufnehme, dann aber in E Mail Programm wechsle und E Mail schreibe, das ist sogar, wenn es ums gleiche Projekt sich handelt, immer noch ein Kontext Switch. Und je nachdem, wie groß der Kontext Switch ist, also wenn ich von dem Projekt A auf Projekt B wechsle, kann es wirklich sein, dass ich da lang brauche, bis ich wieder drinnen bin. Vor allem auch, wenn die Tasks nicht genau definiert sind, wenn diese Next Steps eben auch nicht definiert sind. Und ich habe kürzlich in der Episode zwei hundert fünf und dreiig, wo es auch um Context Switch Costs gegangen ist, erwähnt, dass es Studien gibt, die sagen, dass man drei und zwanzig Minuten braucht, um wieder in den richtigen Kontext reinzukommen, wenn man Context Switch hat. Wenn man rausgerissen wird über eine Slack Message, braucht man wieder drei und zwanzig Minuten, bis man richtig im Projekt drinnen ist. Und daher ist es auch super wichtig, dass man die Kontext Switche reduziert und möglichst gering hält. Für mich ist das beste Tool, um Kontext Switche zu reduzieren, natürlich eine gute Planung. Das heißt, wenn ich acht Tasks schon einplane von acht verschiedenen Projekten, dann kann ich davon ausgehen, dass ich das nicht in vier Stunden schaffe, wenn jeder Task dreiig Minuten ist, weil ich eben diese Context Switch Kosten zwischen den Tasks habe. Das heißt, für mich ist es da wichtig, dass man eine realistische Kapazität annimmt. Das sind üblicherweise bei mir zumindest eher in Richtung vier bis sechs Stunden an einem Acht Stunden Arbeitstag, den man wirklich erledigen kann. Weil es gibt ja auch andere Dinge, die noch reinpuzzeln, die vielleicht super wichtig sind. Die eine oder andere Slack Message, also wenn man da sich so überlegt, okay, ich habe eine begrenzte Kapazität, ich wähle da jetzt eine gewisse Anzahl an Tasks aus, da gibt es auch die Regel, dass man sagt, man hat einen großen Task, drei mittlere und fünf kleinere Tasks, dann hat man zwar immer noch neun Tasks, aber die kann man vielleicht dadurch sie auch dann fünf kleine sind noch in einer sinnvollen Zeit erledigen. Viele Personen überlegen sich auch, dass man den Top One Task definiert, also was ist die wichtigste Aktion, die ich heute machen muss, was ist der große Task, was ist das Wichtigste, was ich zu erledigen habe. Und wenn ich das zumindest erledigt habe, den größten Task, dieses Projekt fertigzustellen, einen gewissen Bug zu fixen, was es auch immer ist, dann geht man den natürlich als erstes an. Und wenn man den erledigt hat, dann hat man schon das Größte vom Tag erledigt. Also viele arbeiten auch damit, dass man wirklich so ein Top One Task hat, was muss heute wirklich erledigt werden oder vielleicht auch zwei Tasks gibt es natürlich auch. Ganz allgemein ist natürlich zu sagen, immer möglichst wenig Tasks ist immer besser. Man sollte natürlich auch nicht an zu viel Baustellen gleichzeitig arbeiten. Also dieses Work in Progress Limit, das es ja auch oft gibt bei Kanban Boards zum Beispiel, dass man maximal ein bis drei aktive Dinge hat auf seinem Kanban Board, das kann man natürlich auch persönlich übernehmen, wenn es um Tasks geht, dass man nicht fünf Tasks gleichzeitig bearbeitet, trotz LLMs und AI, sondern dass man sich fokussiert auf einen und dementsprechend dann auch Kontext Switche spart und die Kosten da reduziert. Was ich auch ganz gerne mache, ist, dass ich Tasks gruppiere, Also eben zuerst schon erwähnt, diese Kontextlisten, wenn ich an der Uni bin, erledigt diese Tasks, die ich nur vor Ort machen kann. Das kann man natürlich auch ganz allgemein machen, wenn es jetzt um Unterrichten, um Lehre bei mir geht, dann plane ich mir mehrere Tasks ein, wo es vielleicht darum geht, ein paar studierende E Mails zu beantworten, gewisse Sachen zu erstellen für eine Vorlesung, also alles was unirelevant ist, gemeinsam zu machen in einem Bündel, weil es dann bezüglich Context Switch für mich zumindest auch immer leichter ist, weil auch wenn es unterschiedliche Tätigkeiten sind, bin ich im Mindset Uni und Lehre aktuell drin und dann ist es natürlich einfacher, als wenn ich von dem Task zur Vorlesungserstellung an der Uni zu einem anderen Task springe, von irgendeinem Kundenprojekt, wo ich mir erst wieder reindenken muss, was ist der aktuelle Status von diesem Kundenprojekt, was muss ich jetzt dort machen, dann springe ich wieder zurück zu irgendeiner E Mail im Uni Kontext. Also auch da ist es natürlich wichtig, dass man einfach die Tasks kopiert und dann in einem Rutsch macht. Sogar der Task E Mails lesen schafft es bei mir ganz oft in die To Do Liste, weil ich habe eine große Inbox und wo vielleicht zwei hundert E Mails reingekommen sind und ich schiebe mir das dann vielleicht auf den Abend oder später, dass ich sage, okay, ich mache jetzt in einem Rutsch, gehe alle E Mails durch, erstelle mir dann auch Tasks, wenn es sein muss. Also Inbox Zero Approach ist bei mir immer ganz vorne, das heißt am Ende sollte die Inbox möglichst leer sein oder im Idealfall ganz leer. Und wenn ich das nicht sofort bearbeiten kann, dann erstelle ich mir Tasks dazu, die ich dann später einplane in meiner Planung, die ich üblicherweise auch am Ende mache, den nächsten Tag dann zu planen. Also auch am Ende ganz Ich überlege mir wieder die next Steps, in dem Fall für den nächsten Tag. Sobald die Arbeiten beginnen, habe ich schon meine wichtigsten Punkte Was will ich heute machen? Was sind die Next Tasks? Ich muss mir nicht am Anfang noch mal in eine Planungssession zuerst hineinstürzen, um dann überhaupt den Tag zu planen oder die Übersicht zu bekommen. Ich habe die Übersicht schon, da ich am Vortag eben diese Planung schon gemacht habe. Natürlich kann man diese Kontext Switche auch ganz allgemein reduzieren, indem man sich nicht so leicht unterbrechen lässt. Das kennt man wahrscheinlich eh im Allgemeinen. Vielleicht mal Slack einfach muten, Anrufe nicht immer annehmen, einfach vielleicht mal auch dann ein Rückruffenster sich definieren, okay, ich habe eine halbe Stunde, da rufe ich dann alle Leute an, die mich angerufen haben, wenn Telefon noch ein Punkt ist oder eben E Mail beantworten. So ein gewisses Batch Processing in der asynchronen Kommunikation auch wirklich einführen und das auch durchziehen. Und der vierte und für mich der wichtigste Punkt bezüglich Stressentlastung ist die Verwendung von einem sicheren System. Was bedeutet ein sicheres System? Der Begriff kommt aus der Getting Things Done Welt oder zumindest habe ich ihn dort kennengelernt. Wir haben da auch eine Episode gemacht, die Episode sechs und sechzig Stressfreie Produktivität in der hektischen Welt mit Getting Things Done. Und was das sichere System sagen will, ist, dass man sich ein System organisiert, dem man selbst vertraut. Das kann ein Notebook, ein Papier Notebook sein, Papier und Bleistift, das kann ein super sophisticated Getting Things Done App, Web App Programm, was auch immer sein. Aber es soll auf jeden Fall ein Trusted System, also ein System sein, dem man vertraut, in dem man seine Tasks und seine Dinge, die einem wichtig sind, ablegen kann. Weil es gibt nichts Schlimmeres, als wenn man ganz viele Tasks im Kopf hat. Das muss ich noch erledigen, das muss ich noch erledigen, das muss ich noch erledigen. Wenn ich das aber irgendwo ablegen kann und ich mir sicher sein kann, dass diese Tasks zurückkehren, also dass ich da eine Deadline eingegeben habe, dass ich eine Erinnerung eingegeben habe, dass ich vielleicht in meine Listen einfach mal hin und wieder durchgehen kann, was sind denn noch für offene Tasks? In den jeweiligen Projekten, in dem jeweiligen Kontext, dann kann ich mir sicher sein, dass ich nichts vergesse. Und für mich zumindest ist es super wichtig. Es gibt natürlich auch so Leute, denen ist alles egal, die sagen, die wichtigen Tasks werden mich schon wiederfinden, es werden mich Leute erinnern, sowas soll es geben. Es gibt auch Leute, die ihre E Mail Inbox eher als Newsfeed bezeichnen, wo sie einfach mal drüber scrollen, wenn ihnen was Cooles auffällt, dann antworten sie vielleicht und sonst werden die Leute schon fünf E Mails noch zusätzlich schreiben und wenn es wichtig ist, werden sie vielleicht auch mal durchklingeln. Ist natürlich ein Fair Point. Hat mir persönlich nie so gut gefallen, dieser Ansatz, weil ich bin eher die Person, die gerne den Überblick behält und die weiß, dass man verlässlich auftritt und und für mich ist es eine Getting Things Done App, die ich da verwende, wo ich einfach alles hineinstopfe und auch meine Planungen drin mache und wo ich mir dann einfach sicher sein kann, wenn ich da mal irgendwas reingelegt habe, dann kann ich das aus meinem Kopf rausstreichen, weil ich weiß, ich habe das mit einem Datum versehen, in zwei Wochen wird es zurückkehren oder vielleicht sogar in sechs Monaten wird es zurückkehren und ich werde erinnert und damit kann ich das voll und ganz aus meinem Kopf streichen und ich habe wieder mehr Zeit, um mich zu fokussieren auf den Task, auf den Next Task, der gerade ansteht. Und meine Erfahrung ist auch, dass die Context Switche damit reduziert werden, weil man einfach nicht schnell zwischen Tasks herumspringt, die einem wieder gerade in den Sinn kommen und man Ah, das habe ich auch noch vergessen, das muss ich ja auch nur schnell schreiben, diese E Mail und dann schreibt man schnell diese E Mail, dann muss man wieder zurück zu dem eigentlichen Projekt, an dem man gerade gearbeitet hat. Und wenn mir so etwas passiert, wenn mir so was plötzlich einfällt, ich muss irgendeine E Mail schreiben, dann gehe ich schnell in mein sicheres System, lege da unten ein Task ab, schreibe diese E Mail und am Abend kann ich das dann dementsprechend einplanen, wann ich das mache oder am Ende des Tages, wenn ich die anderen Tasks erledigt habe, dann kommt dieser Task noch zum Vorschein und ich weiß, okay, den kann ich jetzt bearbeiten. Also nochmal kurze, übersichtliche Listen, den Scope einschränken, also kleine Häppchenaufgaben, die leicht verdaulich sind, Kontext Switche reduzieren durch eine gute Planung, kein Overcommitment von diesen kleinen Häppchen und meine Stressentlastung Nummer eins, ein System, dem man einfach vertrauen kann, egal ob das Papier, Notebook oder die super sophisticated App. Wenn ihr jetzt sagt, ich habe eigentlich auch noch einen sehr coolen Tipp oder möchte auch teilen, wie ich mein Stresslevel nach unten bringe, wenn es ums Task Management geht, schreibt es bei uns in der Discord Community. Bin immer gespannt, was es sonst noch für Ansätze gibt und damit nun wirklich und hoffentlich in die etwas stressfreieren Feiertage, die vor der Tür stehen. Schöne Weihnachten und ciao."
        },
        {
            "end": 1118780,
            "speaker": "A",
            "start": 1092380,
            "text": "Danke Wolfi für diese Episode. Das war's für heute von uns. Wenn dir das, was du gehört hast, gefallen hat, würden wir uns natürlich immer über Feedback freuen. Entweder über ein positives Review auf der Podcast Plattform deiner Wahl, einen Daumen hoch auf Social Media oder eine Anekdote in unserer Discord Community. Ich bin mir sicher, du findest schon einen Weg. Wir freuen uns auch, wenn du diesen Podcast abonnierst und einfach bei der nächsten Episode wieder einschaltest. Wir hören uns bald, schöne Weihnachtszeit und tschüss."
        }
    ],
    "webhook_auth": false
}