{
    "acoustic_model": "assemblyai_default",
    "audio_duration": 1219,
    "audio_url": "https://cloud.inlupus.at/s/3ZAjadMDAsFpFSW/download",
    "auto_chapters": false,
    "auto_highlights": false,
    "auto_highlights_result": {},
    "confidence": 0.9612221,
    "content_safety": false,
    "content_safety_labels": {
        "status": "unavailable"
    },
    "custom_topics": false,
    "disfluencies": false,
    "dual_channel": false,
    "entity_detection": true,
    "filter_profanity": false,
    "format_text": false,
    "iab_categories": true,
    "iab_categories_result": {},
    "id": "892bb9e6-e397-4957-901a-16e88d04b444",
    "language_code": "de",
    "language_detection": false,
    "language_model": "assemblyai_default",
    "punctuate": true,
    "redact_pii": false,
    "redact_pii_audio": false,
    "sentiment_analysis": false,
    "speaker_labels": true,
    "speakers_expected": 2,
    "speed_boost": false,
    "status": "completed",
    "summarization": false,
    "throttled": false,
    "utterances": [
        {
            "end": 25040,
            "speaker": "A",
            "start": 7040,
            "text": "Willkommen zum Engineering Kiosk Adventkalender oder für unsere deutschen Zuhörerinnen Adventskalender. So viel Zeit muss sein, vor allem dieser ruhigen oder eigentlich, Andi, hast du mitbekommen, was das für ein Problem war mit diesem S Adventskalender und Adventkalender. Wir hatten da sogar eine Diskussion in Discord zu dem ganzen Thema."
        },
        {
            "end": 33180,
            "speaker": "B",
            "start": 25040,
            "text": "Es ist für Deutsche auch echt ungewöhnlich, Adventkalender zu sagen. Ich glaube, das Wort gibt es im Deutschen gar nicht, deswegen weiß ich gar nicht, wie ihr Österreicher darauf kommt."
        },
        {
            "end": 46700,
            "speaker": "A",
            "start": 33180,
            "text": "Ich hätte jetzt weitergemacht mit vor allem in dieser ruhigen Adventszeit und der Dirk von unserem befreundeten Podcast Zilbot hat natürlich sofort gesehen, dass dort ein S ist bei Adventszeit und bei Adventkalender nicht und hat sich da natürlich auch sofort beschwert, dass die Konsistenz fehlt."
        },
        {
            "end": 49380,
            "speaker": "B",
            "start": 46700,
            "text": "Verstehe ich, verstehe ich komplett und geht mir auch genauso."
        },
        {
            "end": 77680,
            "speaker": "A",
            "start": 49380,
            "text": "Also ich spare mir jetzt mal den ganzen Rest von diesem Intro, weil vielleicht hat der eine oder die andere schon gemerkt, wir sind heute in einer Sonderadventsfolge und wir haben uns kurz überlegt, sollen wir schon eine Jahresrückblick Sendung machen, weil alle machen ja irgendwie ein Jahresrückblick und keine Angst, wir machen keinen Jahresrückblick. Wir haben uns dem bisher immer entzogen und wollten keinen Jahresrückblick machen, aber wir machen mal so einen kleinen Mini Rückblick und zwar auf unseren Advent ohne ES Kalender."
        },
        {
            "end": 135360,
            "speaker": "B",
            "start": 77680,
            "text": "Ja, nicht nur auf den Adventskalender mit ES, sondern vielleicht auch so ein bisschen auf die Community. Und es ist eine Sonderfolge, weil der Adventskalender ist eigentlich immer wie folgt aufgebaut. Entweder haben wir befreundete Podcasts, die eine beisteuern oder der Wolfgang macht eine alleine oder ich mache eine alleine. Und deswegen ist das, glaube ich, Premiere, die erste Adventskalenderfolge, die wir zusammen machen. Aber lass uns mal einsteigen. Wir haben hier und da mal ein paar Fragen bekommen. Hör mal, wie machen wir eigentlich den Adventskalender und was sind so die positiven negativen Seiten? Wie ist er aus unserer Sicht gelaufen? Hat er sich gelohnt? Bringt er uns was? Und wie viel Zusatzstress erzeugt so ein Adventskalender denn eigentlich? Da werde ich mal ganz kurz Einblicke geben, wie wir diesen Adventskalender eigentlich auf die Beine stellen. Im Endeffekt beginnt die Planung früher als gedacht. Vielleicht kaufen einige Leute von euch die Geschenke für Weihnachten schon im Sommer, im Spätsommer beginnt bei uns die Planung für diesen Adventskalender. Die ersten E Mails gingen so im September raus."
        },
        {
            "end": 141720,
            "speaker": "A",
            "start": 135360,
            "text": "Ich wollte gerade sagen, im Sommer bist du mal um die Ecke gekommen. Dieses Jahr machen wir alles viel viel früher und starten eigentlich schon im Sommer."
        },
        {
            "end": 162500,
            "speaker": "B",
            "start": 141720,
            "text": "Ja, hat nicht so ganz funktioniert. Naja gut, wie gesagt, die Planung begann dann Ungarn im September. Die beginnt eigentlich immer gleich. Wir gehen dann auf unsere deutschsprachige Tech Podcast Liste. Die haben wir mal zusammengestellt. Eine kuratierte Liste an deutschsprachigen Podcasts im Softwareentwicklungs und Tech Sektor. Wer also es leid ist nur uns zu hören, schaut doch mal in die Liste rein. Da gibt es ziemlich coole Podcast."
        },
        {
            "end": 171540,
            "speaker": "A",
            "start": 162580,
            "text": "Also ich würde fast sagen, das ist ein Pflichtbesuch, wenn jemand noch nicht auf dieser Webseite war. Jetzt sofort hingehen auf unsere Startseite oben rechts Tech Podcasts anklicken und in dieser."
        },
        {
            "end": 286250,
            "speaker": "B",
            "start": 171540,
            "text": "Liste haben wir unter einem Attribut, ob diese Podcast noch aktiv sind oder nicht. Denn diese Liste hat eine ganze Menge Podcast. Aber ich würde sagen, nur ein Drittel ist aktiv und aktiv bedeutet innerhalb der letzten, ich glaube zwei oder drei Monate eine Podcast Folge released. Und das ist uns schon recht wichtig, dass wir hier Podcasts vorstellen, die wirklich noch aktiv sind. Dann schauen wir da mal so durch. Hey, wen könnte man denn anschreiben für eine Adventskalender Folge? Und haben wir eine Selektion getroffen. Die Selektion dieses Jahr sah anders aus als letztes Jahr. Wir haben versucht, andere neue Podcasts, die letztes Jahr im Adventskalender nicht dabei waren, dieses Jahr mal mit zu inkludieren. Dann haben wir Ende September die Mails rausgeschickt und da haben wir so ein bisschen beschrieben, was wir vorhaben und bis wann wir denn die Einsendung bräuchten. Und die Einsendung, da war die Deadline Mitte bis letzte Novemberwoche. Ich sag mal so funktioniert halb gut. Manche Podcast haben uns gar nicht geantwortet, bei manchen brauchte man so ein paar E Mails, um das Konzept noch mal vielleicht zu erklären. Da muss ich vielleicht an meiner Kommunikation noch ein bisschen arbeiten und es ist bei uns ja nicht anders. Das Weihnachtsgeschäft ist chaotisch. So wird das bei anderen Menschen auch sein. Und dann kam natürlich manche Einsendungen relativ spät oder Mitte Dezember auch. Aber wir sind ja jung, dynamisch, agil und flexibel. Deswegen haben wir das natürlich alles ratzfatz noch geregelt bekommen. Eine Tagesplanung bauen wir ganz klassisch in Excel oder in Google Sheets, wann welche Episode rausgeht und dann gibt es noch diesen Punkt, dass Wolfgang und ich auch noch Episoden machen müssen. Ich glaube, ich habe ein To Do in meiner To Do Liste seit September überlege dir fünf Themen für den Adventskalender und ich habe sie am zwanzigster dezember diesem To Do abgehakt, weil ich eigentlich von der Hand in den Mund gelebt habe und mir ein Thema ausgesucht habe und das dann an dem Tag recherchiert habe und aufgenommen habe. Also die Ambitionen waren da, die Umsetzung war fragwürdig."
        },
        {
            "end": 292890,
            "speaker": "A",
            "start": 286569,
            "text": "Also meine Themen hatte ich schon relativ früh, muss ich sagen, bis auf das letzte Thema. Das war eine spontane Sache."
        },
        {
            "end": 352390,
            "speaker": "B",
            "start": 292970,
            "text": "Dann hat uns eine Frage erreicht, wie viele Episoden kommen denn von Gästen und wie viel kommen denn von uns im Adventskalender. Zwei tausend vier und zwanzig hatten wir zwanzig Adventskalender Episoden und vier reguläre. Reguläre sind unsere Dienstags Releases einmal in der Woche, die behalten wir auch in der Weihnachtszeit auch einfach bei. Zwei tausend vier und zwanzig hatten wir dann zwölf Einsendungen von anderen Podcasts und acht Episoden von uns, also vier von Wolfgang und vier von mir. Zwei tausend fünf und zwanzig war es ein bisschen anders, da hatten wir ebenfalls zwanzig Adventskalender Episoden und vier reguläre. Bei vier und zwanzig Tagen geht das halt immer ganz gut so auf. Da hatten wir nur neun Einsendungen von befreundeten Podcasts und elf Adventskalender Episoden kamen von uns. Und wie gesagt, der Adventskalender zwei tausend fünf und zwanzig enthält andere Podcasts als der Adventskalender zwei tausend vier und zwanzig da gibt es eine Ausnahme und zwar ist das vom Stefan vom IT Berufe Podcast, aber dann noch mal geticktes Dankeschön, dass er auch noch relativ spontan eingesprungen ist, weil wir ein Spot frei hatten."
        },
        {
            "end": 360230,
            "speaker": "A",
            "start": 352390,
            "text": "Du hast jetzt gesagt, du hast von der Hand in den Mund gelebt mit deinen fünf Episoden, das klingt jetzt nicht sehr positiv. Gibt es auch was Positives am Adventkalender?"
        },
        {
            "end": 397270,
            "speaker": "B",
            "start": 360310,
            "text": "Was ich immer sehr, sehr positiv finde, ist der Outreach zu den anderen, denn ich stoße da sehr auf positiv gestimmte Leute und die freuen sich auch immer, wenn sich die Podcast mal connecten. Die Community gibt uns sehr positives Feedback über die kurzen Episoden. Kann ich auch verstehen. Jeden Dienstag so eine Episode von circa einer Stunde ist schon ein Brett und man muss auch die Zeit finden, die Episoden zu hören. So eine kurze Episode von fünf bis zehn bis zwölf Minuten, die hört man wohl mal eher schneller, wenn man auf dem Weg zum Bäcker ist oder so. Das kann ich schon verstehen. Und wir haben sogar eine Person in der Community. Diese Person hört uns eigentlich gar nicht, außer die Adventskalender Episoden, weil die so kurz sind. Das bringt mich auch immer zum Lachen."
        },
        {
            "end": 408910,
            "speaker": "A",
            "start": 397270,
            "text": "Dafür ist der Richard mit dem Handel RW in unserer Discord Community dafür sonst sehr, sehr aktiv. Also der steuert einfach viel Content bei und hört weniger. Ist ja auch ideal. Und genau dafür ist ja auch die Community dann da."
        },
        {
            "end": 449690,
            "speaker": "B",
            "start": 408910,
            "text": "Und der letzte positive Effekt, der mir mal relativ schnell einfällt, ist unsere datengetriebene Thematik. Und zwar unsere Haupt KPI oder die Haupt KPI von Podcasts sind eigentlich die Downloadzahlen. Downloadzahlen pro Monat oder pro Woche und die gehen natürlich bei eine Adventskalender Episode schon sehr nach oben oder bzw. Wenn man vier und zwanzig Tage durch Release jeden Tag eine Episode, dann hat man natürlich automatisch mehr Downloads. Der Nachteil ist, im Januar kommt dann wieder der große Drop, da muss man gucken, dass man dann nicht irgendwie in eine schlechte Laune fällt. Die Downloadzahlen sahen so schön aus, so viele Leute haben wir erreicht und vielleicht auch mit Wissen bestückt."
        },
        {
            "end": 496480,
            "speaker": "A",
            "start": 449690,
            "text": "Aber was da auch sehr schön zu sehen ist, dass die Statistiken konstant gleich bleiben. Das heißt, die kurzen Episoden werden genau genauso gehört wie die langen. Die langen werden immer noch gehört und das sind auch keine Auto Downloads, weil Auto Downloads erkennt man ganz gut, dass sie genau bei Release, also um drei in der Nacht, in den ersten Morgenstunden downgeloadet werden. Aber die ganzen Downloads dann über den Tag verteilt sind üblicherweise dann wirklich Streams, also Personen, die dann wirklich die Episode hören. Und da sehen wir wirklich konstant dasselbe Level. Also da müssen wir schon sagen, großes Dankeschön an unsere Hörer innen. Das auch wenn jeden Tag eine Episode eintrudelt und dann noch eine lange jeden Dienstag, dass man da konstant dabeibleibt. Und das ist für uns natürlich auch eine große Bestätigung und vielleicht sogar der einzige Grund oder der Hauptgrund, warum wir dann auch so was machen."
        },
        {
            "end": 501360,
            "speaker": "B",
            "start": 496480,
            "text": "Wo die Sonne scheint, gibt es auch Schatten. Was sind also die negativen Seiten, Wolfgang."
        },
        {
            "end": 521960,
            "speaker": "A",
            "start": 501360,
            "text": "Des Adventskalenders, Weil du gerade Schatten sagst, super Trivia. Wissen In Wien hat es dieses Jahr im Dezember minus ein hundert Prozent Sonnenstunden gegeben, also null. Genau, die hatten keine Sonne bisher in Wien. Möchte dazu sagen, Tirol hat plus vierzig Prozent zum letzten Jahr im Dezember habt ihr Sonne da im Norden da oben, da hängt ja normal auch immer diese Suppe und dieser Nebel."
        },
        {
            "end": 533760,
            "speaker": "B",
            "start": 521960,
            "text": "Ich habe seit kurzem eine PV Anlage und wenn man eine neue PV Anlage hat, dann kennt das jeder. Man schaut erst mal auf die Performance von der PV Anlage. Wie viel kommt denn da, wie viel erntet man ja von der Sonne, sagt man ja so schön. Und es ist sehr enttäuschend."
        },
        {
            "end": 599020,
            "speaker": "A",
            "start": 533760,
            "text": "Also habe ich wenigstens in Tirol die Sonne. Zu den Schattenseiten von den Episoden, aber jetzt mal Ende mit dem Werbeblock für Tirol. Schattenseiten von der ganzen Adventkalender Aktion ist natürlich einfach die Zeit und es ist immer wieder überraschend, wie lange man doch braucht, um so eine Episode zu bauen, zu recherchieren. Also das Schneiden dauert üblicherweise bei so kurzen Episoden dreiig Minuten. Meistens bekommt man da auch sehr gute Files, das sind Podcaster, die haben schon in ihrer Pipeline die ganzen Tools, da bekommt man mehr oder weniger eine fertige Datei, da muss man nur aussenrum Intro und ähnliches dazulegen. Also das geht so in einer halben Stunde. Aber wenn man so eine Episode recherchiert einfach nur für zehn Minuten, da hängt man schon einige Stunden dran im Endeffekt. Also einfach mal die Idee am Anfang, da muss man die Idee entwickeln, dann macht man Research, dann liest man etwas drüber, dann hat man noch ein paar Konversationen mit irgendeinem Chatty, dann macht man sich so eine grobe Struktur, was man eigentlich sprechen will, dann spricht man das Ganze ein und dann komme ich noch mal, der dann am Ende auch schneidet und unsere eigenen Episoden sind bisschen mehr Schneideaufwand und dann sind es am Ende doch einige Stunden für läppische zehn Minuten, muss man sagen."
        },
        {
            "end": 617410,
            "speaker": "B",
            "start": 599660,
            "text": "Dieser zeitliche Aufwand schlägt sich halt auch echt zu Buche, besonders weil der normale Podcast ja weiterläuft, der normale E Mail Verkehr läuft ja weiter, das normale Community Management läuft ja weiter und jeden Tag eine Episode zu releasen, auch wenn diese Episode von einem befreundeten Podcast kommt, Vielen lieben Dank nochmal an alle, die da."
        },
        {
            "end": 634330,
            "speaker": "A",
            "start": 617410,
            "text": "Mitgemacht haben, weil die müssen ja dann auch die Stunden investieren, um das alles vorzubereiten. Also da haben wir natürlich schon ein bisschen was ausgelagert, aber ein Freund hat kürzlich zu mir gesagt, ihr bekommt alle Episoden von außen, aber dass man die dann natürlich trotzdem noch schneiden muss, und organisieren muss und im Vorfeld alles klären muss. Also im Endeffekt ist es natürlich auch."
        },
        {
            "end": 658270,
            "speaker": "B",
            "start": 634330,
            "text": "Viel Zeit und jetzt kann man ja aber eine E Mail, das sind ja nur fünf Minuten, ne, sind es in der Regel nicht. Kontext Switche ist dabei. Ich sende auch nicht nur zehn E Mails raus, da kommen nämlich ein paar mehr zusammen, dann spricht man mit den Leuten vielleicht noch mal und so weiter und so fort auf verschiedenen Kanälen, zum Beispiel mit dem Christian Grüße gehen raus, habe ich die ganze Thematik auch noch per SMS mal irgendwie kurz oder imessage kurz geklärt. Also du bist irgendwie auf allen Kanälen aktiv."
        },
        {
            "end": 680980,
            "speaker": "A",
            "start": 658270,
            "text": "Da möchte ich mich übrigens gleich bedanken bei den drei von Urlaub im User Space, Christian, Enrico und Jan, weil die sehr kurzfristig noch eingesprungen sind, weil uns sind natürlich auch paar Podcaster abgesprungen kurzfristig, weil die zu viel zu tun hatten oder andere Probleme und dann ist es schön zu sehen, dass man solche Podcaster hat wie die drei, die man einfach fragt und paar Tage später hat man eine Episode im E Mail Postfach. Also vielen Dank dafür."
        },
        {
            "end": 694460,
            "speaker": "B",
            "start": 680980,
            "text": "Auch Andi Lehr vom Happy Bootstrapping Podcast, der auch Teil unseres Adventskalenders war, hat uns denn mal gefragt, hör mal Jungs, wie ist der Adventskalender eigentlich aus eurer Sicht gelaufen? Hat er sich gelohnt? Bringt er uns was? Wolfgang, wie ist dein Resümee zwei tausend fünf und zwanzig?"
        },
        {
            "end": 749440,
            "speaker": "A",
            "start": 694460,
            "text": "Ja, Vorhersagen sind immer schwierig, vor allem wenn sie die Zukunft betreffen, würde ich mal sagen. Der Adventskalender, oh jetzt habe ich Adventskalender gesagt, Advent, der Adventkalender läuft ja noch, das heißt eigentlich sehen wir das erst nächstes Jahr. Wir hatten natürlich letztes Jahr schon einen Adventkalender, aber es ist natürlich auch schwierig da irgendwie eine Korrelation herzustellen, weil die Zahlen im Januar gehen dann nach unten, aber gesamt, wenn man es dann natürlich vergleicht zum jeweiligen Vorjahr wieder, hat man natürlich schon höhere höhere Innenzahlen. Aber ob das jetzt natürlich wirklich dem Adventkalender an zu attributieren, attributieren, schwieriges Wort, aber ob das dem Adventkalender anzurechnen ist, das ist natürlich schon schwierig und dazu haben wir jetzt keinen Zuwachs von, keine Ahnung, zwei hundert Prozent oder so, dass man das vielleicht dann noch rechtfertigen könnte. Aber wir haben natürlich ein Wachstum. Wir sehen ein Wachstum und wir bekommen positives Feedback und hoffen natürlich, dass wir da auch einfach paar Leute erreichen, die dann den Engineering Kiosk ganz cool finden und einfach dabei bleiben."
        },
        {
            "end": 785940,
            "speaker": "B",
            "start": 749440,
            "text": "Natürlich machen dann die Teilnehmer des Adventskalenders auch hier und da ein bisschen Werbung. Hier und da gibt es auf den Social Media Plattformen reshare, aber wir drehen den Scheinwerfer natürlich dann mit unserer Hörerschaft auch auf diese anderen Podcast, wie zum Beispiel dieses Jahr für die Smarthütte, einem Zero Day Security Podcast, Digitale Anomalien, der ein bisschen was über die Historie von Food und Bar gesagt hat, den Python Podcast, dem Till Podcast, dem IT Berufe Podcast, Urlaub im User Space, Focus on DevOps und so weiter und so fort. Also hört da auch mal rein. Vielleicht hat euch die ein oder andere Folge da mal gefallen Und wir versuchen."
        },
        {
            "end": 814920,
            "speaker": "A",
            "start": 785940,
            "text": "Ja die gesamte Podcast Szene dadurch auch zu unterstützen und zu fördern. Wir wollen ja unsere Hörerschaft nicht für uns vereinnahmen, sondern es soll eine offene Community sein und es gibt coolen Content da draußen. Insofern hört da gerne mal rein Und wir hören ja auch andere Podcasts. Also man kann ja überall was Neues und Cooles lernen und es gibt so viele Nischen und Teilbereiche, auch wenn man bei uns in die kuradierte Liste hineinschaut. Das sind wirklich von Game Development über Gesellschaft bis zu Security ist eigentlich alles dabei und es gibt ja viele spannende Themen."
        },
        {
            "end": 847080,
            "speaker": "B",
            "start": 814920,
            "text": "Aber nicht nur die Tech Podcast Community ist gewachsen, sondern auch unsere eigene Community im Discord. Dieses Jahr sind ungefähr ein hundert dreiig, ein hundert fünf und dreiig neue Mitglieder in die Discord Community gekommen und die Leute hier drin sind, das ist echt eine diverse Truppe. Also da sind Security Engineers bei, Leute, die in klassischen Webagenturen arbeiten, Leute aus dem Cloud DevOps Umfeld, JavaScript Frontendler, Leute aus dem Net Umfeld, Leute, die in der städtischen Schul IT arbeiten, Leute, die im Embedded Software Development Feld unterwegs sind, Elektriker, Maschinenbauer."
        },
        {
            "end": 850840,
            "speaker": "A",
            "start": 847080,
            "text": "Wir haben wirklich alles. Ganz viele Quereinsteiger eben auch aus solchen Bereichen."
        },
        {
            "end": 865240,
            "speaker": "B",
            "start": 850920,
            "text": "Und besonders bei den Quereinsteigern finde ich die Storys immer super interessant. Zum Beispiel ist da ein gelernter Kaufmann, der einen Wunsch hat, raus aus dem Verkauf, rein in die IT und zu Hause jetzt gerade einfach mal so einen kleinen Kubernetes Cluster aufsetzt. What the fuck, habe ich gedacht."
        },
        {
            "end": 866120,
            "speaker": "A",
            "start": 865640,
            "text": "Geil."
        },
        {
            "end": 889800,
            "speaker": "B",
            "start": 866440,
            "text": "Oder jemand anders, der einfach vor vier Jahren aus reiner Neugier angefangen hat, neben dem Hauptberuf mit Java zu programmieren, um damals einfach irgendwelche PDF Monats Pläne zu parsen und versucht jetzt sein Hobby zum Beruf zu machen. Also mega diese Motivation. Und da freut mich natürlich ganz besonders, dass die bei uns in der Community sind, davon Mehrwert haben und vielleicht sogar den Schritt in die IT schaffen."
        },
        {
            "end": 929010,
            "speaker": "A",
            "start": 889880,
            "text": "Wenn Leute mich fragen, warum Networking so wichtig ist, sage ich auch ganz oft, wenn man so ein Netzwerk hat, dann hat man einfach ganz viele Leute, die man was fragen kann, die man mal anschreiben kann, wenn man ein Problem hat, einfach was ist deine Meinung dazu? Und das ist auch die Idee von unserem Suche, Feedback oder Hilfe Channel in Discord. Und genau darum geht es. Also wir haben dann, wie gesagt, von Elektriker bis Verkäufer und irgendwelche Hardcore Nerds alles dabei. Die Idee ist, dass man genau diesen Wissenspool eigentlich nutzen kann. Also wer noch nicht bei uns in der Discord Community ist, kommt vorbei, bringt euer Wissen mit ein, aber es ist auch ganz viel Wissen da und auch Erfahrung in anderen Firmen von groß bis klein. Und genau diesen Austausch wollen wir eigentlich pflegen durch unsere Community."
        },
        {
            "end": 965070,
            "speaker": "B",
            "start": 929170,
            "text": "Und wodurch wird Wissen produziert, Wolfgang? Durch ganz viel Koffein. Und seit zwei tausend vier und zwanzig kann man uns als kleines Dankeschön hier und da auch mal einen Kaffee ausgeben. Wir haben den Preis nicht erhöht, der Kaffeepreis ist stabil geblieben bei uns. Vier Euro kostet ein Kaffee. Und in zwei tausend fünf und zwanzig hatten wir neun und dreiig spendable Spender mit insgesamt zwei hundert zehn Kaffee. Zugegeben, die zwei hundert zehn Kaffee haben wir noch nicht getrunken. Ich bin mir auch nicht sicher, ob wir das noch schaffen. Das wären ein hundert fünf Kaffee für jeden. Wolfgang, wie lange wollen wir dafür brauchen?"
        },
        {
            "end": 969670,
            "speaker": "A",
            "start": 965150,
            "text": "Ja, zu zweit haben wir das nicht gemacht, aber ein hundert Kaffee sind kein Problem bei mir."
        },
        {
            "end": 1008050,
            "speaker": "B",
            "start": 969670,
            "text": "Da wollen wir auf jeden Fall ein richtig dickes Danke sagen, denn uns freut jedes Mal, wenn wir so eine E Mail bekommen, dass irgendjemand uns wieder einen Kaffee ausgegeben hat. Und Wolfgang und ich treffen uns so drei, vier Mal im Jahr. In der Regel wird dann auch etwas aus diesem Pot genommen. Vielleicht wird es nicht immer ein Kaffee, vielleicht wird es auch mal ein Glühwein oder ein Bier oder vielleicht mal irgendwo ein Frühstück zum Beispiel ganz klassisch auf der Foss gehen wir morgens immer los und holen uns irgendwo ein Frühstück. Das wird meist dann auch aus diesem Pot bezahlt, Aber wir nehmen das nicht als Selbstverständlichkeit an, dass Leute für diesen Content zahlen. Deswegen sind wir umso dankbarer, wenn hier und da mal ein Kaffee reinkommt für diese ganzen Kaffeespenden."
        },
        {
            "end": 1080210,
            "speaker": "A",
            "start": 1008050,
            "text": "Andi, bin eigentlich schon ein bisschen enttäuscht, dass du jetzt so viel schon gelernt hast von mir, aber jetzt kein einziges Mal Kaffee richtig ausgesprochen hast. Aber gut, mit dem muss ich irgendwie leben. Das habe ich langsam gelernt. Auf jeden Fall werden diese Kaffeespenden über die Plattform Buy Me a Coffee organisiert und die entwickeln natürlich auch ihr System immer weiter. Und die hatten kürzlich mal ein neues Feature, dass man auch wirklich so eine Subscription machen kann, wo man monatlich spendet. Und wir hatten dann überlegt, sollen wir dieses Feature aktivieren oder nicht, weil da geht es ja auch darum, dass man vielleicht Zusatz Content dann für alle, die so eine Subscription haben, zur Verfügung stellt. Und den haben wir eigentlich nicht so richtig. Und dann haben wir eigentlich zugewartet und irgendwann haben wir eine E Mail bekommen von Buy Me a Coffee, dass der Fabian eine monatliche Subscription abgeschlossen hat. Jetzt haben die dieses Feature einfach mal scheinbar so aktiviert für alle und wir haben da gerade nichts Großes irgendwie angeboten oder sonst irgendwas gemacht. Scheinbar gibt es so Leute wie Fabian, aber später kam auch Martin und Julian dazu, die sich einfach gedacht haben, wir machen das Ganze monatlich. Und das hat uns dann eigentlich schon überrascht, weil wir wollten gar nicht unbedingt in dieses ganze Game mit Zusatz Content und so weiter einsteigen. Also auch danke an euch drei, die einfach mal so eine monatliche Subscription abgeschlossen habt, um uns zu fördern."
        },
        {
            "end": 1099210,
            "speaker": "B",
            "start": 1080210,
            "text": "Das war Wolfgangs kleiner persönlicher Kaffee Rückblick. Und obwohl der Wolfgang gesagt hat, wir machen Rückblick. Und obwohl der Wolfgang Tschuldigung, ich werde es nie lernen. Ab und zu bin ich auch ignorant. Natürlich auch vielen lieben Dank von meiner Seite. Wie gesagt, immer wenn wir die E Mail Inbox aufmachen und da ist so eine E Mail, ich freue mich in Rad ab."
        },
        {
            "end": 1144670,
            "speaker": "A",
            "start": 1099210,
            "text": "Worüber wir uns aber auch freuen und das ist ganz ohne Geld möglich ist sonstiges Feedback oder auch besonders Input. Also wenn jemand Ideen hat oder Themen, über die wir sprechen können oder auch ganz normale Fra gerne in Discord stellen, uns ein E Mail schreiben an stetigengineeringkiosk de V. Man kann auch immer noch das Formular ausfüllen auf engineeringkiosk, dev AMA für askme anything. Das ist immer offen. Wir schauen da auch immer wieder rein und übernehmen Fragen, wenn dort interessante Fragen auftauchen. Also auch das hilft uns einfach weiterzumachen, besonders das gute Feedback, aber auch Input. Und die Kaffeespenden sind eigentlich die Treiber bei uns, damit wir die Motivation hochhalten oder meine Motivation vor allem hochgehalten wird, dass es mit Anni noch weiterhin aushalte und da wöchentlich Episoden aufnehme."
        },
        {
            "end": 1168470,
            "speaker": "B",
            "start": 1144750,
            "text": "Ich bin nichts anderes gewohnt, dass du geldgetrieben bist, der Kapitalisten Wolfgang. Okay, ich finde einfach super, dass ich mich selbst zwinge, jede Woche neu zu lernen, deswegen belassen wir es bei dem. Das war unser kleiner Adventskalender Behind the Scenes Beitrag bzw. Making of Wolfgang. Jetzt gibt es aber noch eine finale Frage, die wir noch nicht beantwortet Wird es einen Adventskalender zwei tausend sechs und zwanzig geben?"
        },
        {
            "end": 1173110,
            "speaker": "A",
            "start": 1168470,
            "text": "Also Adventskalender gibt es bei mir sowieso keine. Das es kommt mir nicht ins Hass."
        },
        {
            "end": 1185510,
            "speaker": "B",
            "start": 1173190,
            "text": "Klassische Berater Antwort mal wieder nix auf die Straße gebracht. Somit lassen wir dieses Mysterium einfach mal offen und entscheiden das wahrscheinlich im kommenden Sommer, wenn wir dann uns wieder vornehmen, früher zu starten."
        },
        {
            "end": 1199160,
            "speaker": "A",
            "start": 1185510,
            "text": "Und solltet ihr das genau jetzt am vier und zwanzigste Hören, wenn die Episode released wird, genießt euren Abend heute, der soll ja irgendwie heilig sein oder so, habe ich gehört. Genießt ihn einfach und auch die nächsten Feiertage, die noch kommen und denkt an die besinnliche Zeit."
        },
        {
            "end": 1202280,
            "speaker": "B",
            "start": 1199160,
            "text": "Das war's von uns. Wir hören uns beim nächsten Mal und tschüss."
        },
        {
            "end": 1203000,
            "speaker": "A",
            "start": 1202440,
            "text": "Ciao."
        }
    ],
    "webhook_auth": false
}