{
    "confidence": 0.9631057,
    "language_code": "de",
    "speakers_expected": 2,
    "status": "completed",
    "audio_duration": 3396,
    "utterances": [
        {
            "start": 3360,
            "end": 71730,
            "speaker": "A",
            "text": "Willkommen zu einer neuen Episode bei deinem Lieblings Tech Podcast, in dem sich ein Ruhrbottler und ein Österreicher über Tech Themen unterhalten. Heute sprechen wir über Performance Reviews oder ganz klassisch gesagt Mitarbeiter Innengespräch mit Leistungsbeurteilung. Auch wenn Andi und ich jetzt schon vermutlich viele hunderte solche Gespräche erlebt haben, ist es ein Thema, zu dem ich Andi fast zwingen musste, denn es ist schwierig und auch heikel. Oft ist es unangenehm mit viel Ärger Gefühlen und vielleicht sogar mit Enttäuschungen verbunden. Aber genau darüber wollen wir sprechen. Was gibt es für Möglichkeiten, Performance Reviews durchzuführen? Ist das Ganze eine Leistungsbeurteilung oder eher eine Feedbackfunktion, um zu wachsen? Wie darf oder soll das Ganze mit Beförderungen oder Gehaltserhöhungen verknüpft sein? Und ganz ganz Wie können wir diese Performance Reviews besser nutzen als Lead und Managerin, aber auch ganz besonders als leistungsbewertete Person? Denn dieses Review ist nicht einseitig, auch wenn das oft so klingt und uns das oft so dargestellt wird. Wir können es beeinflussen und auch für uns positiv nutzen. Also legen wir los mit einem etwas ungeliebten Thema, das wir vielleicht ein bisschen in das Positive drehen können. Andi, seit wie lang bist du jetzt eigentlich Manager?"
        },
        {
            "start": 71730,
            "end": 84490,
            "speaker": "B",
            "text": "Das ist eine sehr gute Frage. Man gebe mir eine Sekunde. Ich muss auf LinkedIn nachgucken, weil LinkedIn ist immer mein aktuellster Lebenslauf. Wenn du so möchtest, so circa zehn, zehneinhalb Jahre mache ich einen Engineering Manager oder Director Job bereits."
        },
        {
            "start": 84490,
            "end": 97650,
            "speaker": "A",
            "text": "Okay, das heißt, du hast mal mindestens zehn Performance Review Cycles, so Jahresreviews eigentlich durch. Wenn du jetzt an diese ganzen Reviews denkst, an diese Zeit, wo du diese Reviews gemacht hast, welche Gefühle kommen da bei dir hoch?"
        },
        {
            "start": 97810,
            "end": 159760,
            "speaker": "B",
            "text": "Gemischte Gefühle. Es ist auf der einen Seite immer eine Möglichkeit für mich natürlich gute Arbeit auch wertzuschätzen. Ich meine, das tut man natürlich über das ganze Jahr, aber in so einer Performance Review wird das natürlich offiziell dokumentiert. Deswegen hat das natürlich ein bisschen bisschen mehr Gewicht. Auf der anderen Seite ist es sehr, sehr viel Arbeit, besonders wenn man das gut machen möchte und besonders wenn man viele Direct Reports, also wenn man jetzt so vier Direct Report hat, dann geht das noch. Aber wenn man jetzt so bei zehn, elf, zwölf, dann ist das schon richtige Akkordarbeit. Und ja, es kann halt nicht immer jeder performen und ab und zu muss man halt auch nicht so ganz so gute Statusmeldungen überbringen bzw. In die Zukunft gucken mit Entwicklungspotenzial. Und das sind dann öfter mal etwas schwierigere Gespräche bzw. Gespräche, wo man sich vielleicht das Ergebnis anders vorgestellt hat. Also ich sage mal, gemischte Gefühle so oder so ist notwendig, aber ich habe sie ja auch. Das bedeutet also mein Manager macht sie auch mit mir und das bedeutet, die Gefühle, die jetzt gerade widerspiegel, die hat mein Manager dann natürlich auch bzw. Die habe ich dann auch, wenn ich gute Neuigkeiten erwarte, aber vielleicht dann nicht so gute Neuigkeiten bekomme."
        },
        {
            "start": 159760,
            "end": 200750,
            "speaker": "A",
            "text": "Also nachdem du da jetzt die Schweiz einnimmst, probier mal da meine Meinung reinzubringen, weil wenn ich darauf zurückblicke, dann ist es für mich eigentlich war das immer nur der absolute Horror. Es war extrem viel Arbeit, es war immer so eine Fairness Sache, es hat viele enttäuschte Gesichter gegeben, Es war irgendwo Angst in dem ganzen Prozess drinnen. Es war oft intransparent. Zumindest haben die Leute das teilweise so empfunden. Es gibt das ganze Bias Problem. Also da geht es gar nicht jetzt darum als Manager, sondern auch was man an Reviews erhält. Ganze Politik hat natürlich mitgespielt. Man hat irgendwie Diskussionen auf Peer Ebene mit den Vorgesetzten. Geld ist ein Riesenthema. Also für mich war das eigentlich immer eine sehr negative Zeit, die blickt nicht sehr positiv darauf zurück."
        },
        {
            "start": 200830,
            "end": 221870,
            "speaker": "B",
            "text": "Du sprichst aber gerade sehr, sehr viele Sachen, die vom Prozess bzw. Von der größeren Firmenstruktur vorgegeben werden und zu der du dich als Manager ja auch committed hast. Also du kannst dich ja nicht da hinstellen und ja, der Prozess ist total kacke, ich glaube da nicht dran und deswegen finde ich das jetzt doof. Und auf der anderen Seite erwartest du ja natürlich auch in irgendeiner Art und Weise eine Bewertung, auf der du dann gemessen wirst, oder?"
        },
        {
            "start": 221870,
            "end": 255930,
            "speaker": "A",
            "text": "Ja, ich sage nicht, dass es sinnlos ist, aber wenn ich darauf zurückblicke, meine Empfindungen damit sind auf jeden Fall sehr negativ. Aber nachdem das Ganze eben nicht wegzudenken ist, wollen wir heute mal drüber sprechen, und zwar wie man diese Performance Reviews natürlich macht. Einerseits von Manager Seite, was für Probleme es damit gibt, aber auch was man auf der anderen Seite, wenn man diese empfängt, auf der Individual Contributor Seite, was man damit machen kann. Und ich glaube, diese Seite wird gerade sehr unterschätzt, weil man als Individual Contributor sehr wohl darauf einwirken kann und es auch steuern kann und auch ins Positive steuern kann. Und genau darüber wollen wir heute uns mal unterhalten."
        },
        {
            "start": 256090,
            "end": 315640,
            "speaker": "B",
            "text": "Ich wollte schon sagen, du kommst hier rein mit so einer Schwarzmalerei, machst sie das sonst in negativ und ich als Podcast Hörer hätte schon längst irgendwie aufgelegt, weil höre ich mir jetzt hier so eine negative Klamotte an. Also ich denke, dass jeder Prozess, egal ob Performance Review oder Code Review, völlig egal von irgendjemand als nicht fair oder schlecht bezeichnet wird. Und es gibt immer etwas zu verbessern. Ich denke aber auch, es gehört zum Menschsein und zu der Gesellschaft und natürlich auch, wo du Verträge eingehst, wo du natürlich auch Erwartungen hast, dass du weiterentwickelt hast, dass sowas dazugehört. Und du sagst gerade Individual Contributor hat auch eine sehr große Rolle. Und jetzt Achtung, jeder Manager, es sei denn, du bist der CEO, jeder Manager ist ja auch wieder Individual Contributor, wenn du so möchtest. Das bedeutet also auch wenn du jetzt gerade zuhörst und Manager oder Director bist, bleib dran, weil für dich haben wir natürlich auch ein paar Sachen, weil du bist ja eigentlich auch irgendwann Teil eines Performance Reviews und dann die empfangende Person."
        },
        {
            "start": 315640,
            "end": 328680,
            "speaker": "A",
            "text": "Aber jetzt bist du natürlich durch mehr Firmen durchgegangen in deinem Manager Dasein. Wie würdest du denn grundsätzlich mal Performance Review beschreiben, was du jetzt so erlebt hast und was für dich so ein Performance Review darstellt, möglichst objektiv gesehen?"
        },
        {
            "start": 315694,
            "end": 375694,
            "speaker": "",
            "text": "[Werbung]"
        },
        {
            "start": 389160,
            "end": 429350,
            "speaker": "B",
            "text": "Auf gut Deutsch würde ich mal sagen, dass die klassische Leistungsbeurteilung, so wird man das im deutschen Mittelstand, glaube ich, bezeichnen, findet in der Regel einmal im Jahr statt. Manche Firmen machen es zweimal im Jahr. Meist so April und September ist in der Regel eine Rückschau, was man so als Mitarbeiter geleistet hat, ob man jetzt seinen Job nach Dienst gemacht hat oder ob man die sogenannte Extra Meile gegangen ist. Man schaut in der Regel bis zur letzten Performance Review zurück. Also man schaut jetzt nicht die letzten fünf Jahre zurück und schaut, okay, was kann ich im nächsten Jahr erreichen. Vielleicht gibt es eine Zieldefinition sogar noch Entwicklungsfelder, strukturiertes Feedback. Die ganze Sache wird in der Regel in einer sogenannten Personalakte dokumentiert."
        },
        {
            "start": 429910,
            "end": 433070,
            "speaker": "A",
            "text": "Jetzt klingt schon ziemlich Enterprise gut, ob."
        },
        {
            "start": 433070,
            "end": 477260,
            "speaker": "B",
            "text": "Das jetzt ein Workday Record ist oder eine Personalakte, aber im Endeffekt ist es das. Und manchmal ist die Performance Review auch an dein Gehalt gekoppelt. Bzw. Ist ein Signal oder ein Datenpunkt, um das Gehalt zu verargumentieren oder nicht. Und hinten dran, und das ist ist je nach Firma unterschiedlich, wird es ab und zu an den Mitarbeiter kommuniziert oder nicht, findet dann auch eher eine Kategorisierung in, ich sag mal, Schubladen statt, ob die Person High Performer, Low Performer ist oder im guten Mittelfeld und wie viel Potenzial in der Person steckt und ob sie auf einem positiven Trend ist und ähnliches. Also dass man so eine Mitarbeiterkategorisierung nach Leistungsspektrum hat, würde ich mal sagen. Fasst das irgendwie auch deine Erfahrung zusammen oder habe ich irgendwas vergessen?"
        },
        {
            "start": 477640,
            "end": 534450,
            "speaker": "A",
            "text": "Was für mich noch ganz wichtig ist, was eigentlich so ein Performance Review ausmacht, ist, dass es ein definierter Prozess ist, der klar formal definiert ist, jedem, hoffentlich jeder und jedem bewusst ist und klar ist, wie der funktioniert in der Firma. Ich glaube aber auch, dass es ganz viele Firmen gibt, die gar keinen formalen Prozess haben und bei denen das irgendwie so nebenbei läuft. Gerade im Mittelstand oder in kleineren Firmen, die ich zumindest auch kenne, läuft es einfach so nebenbei. Da gibt es dann irgendwann eine Gehaltserhöhung, vielleicht gibt es so ein Gespräch, wenn überhaupt, aber teilweise läuft es auch so ganz kontinuierlich mit das ganze Jahr ein bisschen Feedback und manche sehen das vielleicht auch ganz cool an. Wir haben da keinen Prozess, wir machen das ganz agil und dynamisch. Aber ich glaube, dass da natürlich auch ganz viel auf der Strecke bleibt, weil so ein Performance Review ja auch gewisse Ziele hat. Und umso strukturierter das ist, umso besser kann man die ganzen Ziele natürlich erfüllen, weil es da ja ganz viele Dimensionen auch gibt, auf denen man arbeitet."
        },
        {
            "start": 534680,
            "end": 592940,
            "speaker": "B",
            "text": "Du hast jetzt die Struktur und die Definition so positiv hervorgehoben, das ist alles auch richtig. In der Regel ist das irgendwie dokumentiert bzw. Der zeitliche Ablauf und was man zu erwarten hat. Ich möchte aber auch sagen, dass eine Performance Review immer einen gewissen Floor hat und auch einen sehr, sehr großen Anteil an Subjektivität drin hat. Denn besonders bei uns in der Tech Branche, bei uns in der Tech Branche, ich meine, wir machen einen kreativen Beruf, hoffentlich coden wir nicht zweimal genau das Gleiche. Es ist ja keine repetitive Aufgabe. Und deswegen ist Performance bzw. Leistung, die Definition von Performance. Wann hat der Wolfgang den performt? Wann war der Wolfgang ein Top Performer? Und ich rede nicht von zehn X Engineer oder ähnliches ist auch sehr, sehr schwammig und deswegen würde ich sagen, ist jede Performance Review halt auch ein bisschen irgendwie flaut und sehr viel Subjektivität dran, was die ganze Sache wieder in Bezug auf deine Struktur so ein bisschen verwässert."
        },
        {
            "start": 592940,
            "end": 593820,
            "speaker": "A",
            "text": "Würde ich fast sagen."
        },
        {
            "start": 594050,
            "end": 606410,
            "speaker": "B",
            "text": "Also du kannst ja nicht jede Arbeit quantifizieren, das möchte ich damit glaube ich sagen. Du hast ja keinen Grafana Chart. Wolfgang muss diesen Schwellenwert erreichen, es sei denn, du machst Change Lines of Code oder Commits oder so, aber ich hoffe, da bist du rausgewachsen."
        },
        {
            "start": 606410,
            "end": 662810,
            "speaker": "A",
            "text": "Ja, wie man das Ganze misst, da kommen wir später noch darauf zu sprechen, Aber ganz allgemein gebe dir natürlich recht, nur weil du eine Struktur hast, heißt es noch lange nicht, dass es eine gute Struktur ist oder dass das gut funktioniert. Ein Beispiel, was ich miterlebt habe, das war das Mitarbeitergespräch an der Uni. Immer wie an der Uni gearbeitet habe und meinen Doktor gemacht habe, da muss man natürlich so ein Mitarbeitergespräch machen, das ist formal genau strukturiert, da gibt es auch ein Formular, das man ausfüllen muss, das man ablegen muss und so weiter. Und es war immer dann so eine Sache, ja, Ziel, Ziel ist ja immer noch Doktorarbeit oder ganz klar, alles läuft gut, veröffentlicht wird ja auch Check, Check, danke, das war das Mitarbeitergespräch. Also nur weil es eine Struktur gibt, heißt es noch lange nicht, dass es irgendwie strukturiert und sinnvoller abläuft. Und genau darüber wollen wir auch ein bisschen sprechen. Was sind denn für dich jetzt eigentlich die Ziele von so einem strukturierten Performance Review? Was gibt es für Dimensionen, die wir beurteilen oder wofür machen wir das Performance Review eigentlich?"
        },
        {
            "start": 662810,
            "end": 772800,
            "speaker": "B",
            "text": "Ich würde sagen, es gibt mehrere Ziele. Auf der einen Seite ist die Performance Review dafür da, um das, was hoffentlich das ganze Jahr über auch kommuniziert wird, das bedeutet Feedback, Wachstumsmöglichkeiten, aber auch Lob und wo man ein sehr gutes Projekt gemacht hat oder wo man sehr gute Arbeit gemacht hat, dass all das natürlich auch stark kommuniziert wird und auch Achtung, dokumentiert wird. Denn in One on Ones wird halt oft auch Feedback gegeben, hoffe ich zumindest. Das wird vielleicht in deinem One on One Dokument irgendwie dokumentiert, aber es wird dann nicht offiziell dokumentiert, wo dann der CEO Zugriff drauf hat. Und dieses Feedback und diese Bewertung, die führt man natürlich an einem gewissen Zeitpunkt durch, Dann ist das eine Momentaufnahme bzw. Eine Momentaufnahme über den letzten Zeitraum und die kann natürlich dann teammässig oder abteilungsmässig sogar zu einem Vergleich führen. Und das kann natürlich dann firmentechnisch zur Fairness führen in Bezug auf Gehaltsbänder, Beförderungen und Co. Weil wenn du immer nur auf den Einzelnen guckst, dann ist es immer relativ schwierig zu sagen, okay, ist diese Person jetzt Senior oder Staff oder ähnliches, Weil auch wenn man es nicht wahrhaben möchte, es findet ein Vergleich statt, weil du musst ja eine gewisse Homogenität in der Firma irgendwie behalten, damit du zum Beispiel nicht die Beförderung verwässerst oder ähnliches. Deswegen ist das so ein Ziel, würde ich sagen, oder bzw. Die zwei Ziele, dass die ganze Sache, was du das ganze Jahr kommunizierst, auch dokumentiert wird und natürlich, dass du, wenn Gehälter und Beförderung an die Performance Review gebunden sind, Beförderung wahrscheinlich oft und dann auch das Gehalt irgendwie, dass du dann eine gewisse Vergleichbarkeit über die Firma bzw. Über die Teams weg hast. Und Transparenz ist auch ein Ziel, ich hoffe, aber das ist generell gegeben, dass Leute wissen, wie der Prozess abläuft, was sie zu erwarten haben, was sie aber auch vorzubereiten haben und so weiter und so fort."
        },
        {
            "start": 773120,
            "end": 793000,
            "speaker": "A",
            "text": "Bezüglich Transparenz finde ich auch wichtig, dass einfach das auch hinuntergeschrieben wird. Und das ist dann der große Unterschied, wenn es keine formalen Prozesse gibt und das einfach irgendwo zwischen Tür und Angel gelöst wird, dann wird es meistens auch nicht niedergeschrieben und damit ist es natürlich auch nirgends festgehalten und irgendwie transparent auch wieder einsehbar. Was wurde da besprochen?"
        },
        {
            "start": 793080,
            "end": 848710,
            "speaker": "B",
            "text": "Ja genau, genau das meinte ich ja mit Dokumentation und Achtung, die Leute hassen diesen Spruch, aber ich finde den wirklich gut. Wer schreibt, der bleibt. Wie oft habe ich schon eine Story gehört, irgendjemand hat bei Vertragsverhandlungen etwas zugesagt bekommen, nach einem Jahr bekommt man die andere Stelle, auf die man sich eigentlich beworben hat und dann ändert sich der Manager oder der Manager, der es versprochen hat, ändert sich ja nichts mehr und so weiter. So was gibt es ja noch und nöcher solche Stories. Deswegen und teilweise muss diese Änderung ja noch nicht mal in deiner Kontrolle liegen, sondern kann außerhalb deiner Kontrolle liegen. Und wenn man sich bei einem Performance Review zum Beispiel auch darauf einigt, hey, das Projekt war nicht so gut oder hier hast du Entwicklungspotenzial und lass uns mal zusammen daran arbeiten und man erarbeitet dann wirklich auch irgendwie Erfolgskriterien, dann kann das natürlich auch positiv wirken, weil man sagen kann, hey, letztes Jahr haben wir diese Erfolgskriterien definiert, habe ich die erreicht? Ja, hast du ja super. Wozu das dann führen kann, ist eine andere Frage zu Gehalt oder ähnliches. Aber ich bin Fan. Wer schreibt, der bleibt."
        },
        {
            "start": 848710,
            "end": 911330,
            "speaker": "A",
            "text": "Und das ist auch ein ganz guter Punkt, den du jetzt angesprochen hast mit dem Schreiben in Richtung Zukunft. Weil ganz oft denkt man ja bei einem Performance Review Meeting eigentlich immer an die Vergangenheit. Es wird die Vergangenheit beurteilt, was natürlich stimmt, aber dieses Performance Review und dieses Meeting auch danach hat auch eine Komponente, die in die Zukunft blickt. Sei es natürlich mit einer Beförderung, ist klar, dann ist es in der Zukunft die Beförderung. Aber auch wenn man jetzt natürlich gerade in die Entwicklung, in den Wachstum geht von Talents, dass man in der Zukunft etwas ändert, dass man das aufschreibt, Was will man ändern? Wo will man sich hin entwickeln? Ist es vielleicht ein Ziel, irgendwie eine spezielle Position einzunehmen, Staff Level zu bekommen, einfach im Level zu steigen, eine Engineering Manager Position zu bekommen, was es auch immer ist, in einem speziellen Projekt irgendwie Ownership zu haben, Dann sind es sehr viele Dinge, die die Zukunft betreffen und nicht nur die Vergangenheit. Die ergeben sich aus der Vergangenheit, betreffen aber auch die Zukunft. Und das ist eigentlich auch eine Stärke, die man ganz oft vergiss sehr oft einfach nur verknüpft, okay, das ist eine Beurteilung. Ich bekomme eine Gehaltserhöhung, ja oder nein und that's it."
        },
        {
            "start": 911330,
            "end": 923970,
            "speaker": "B",
            "text": "Ich finde, der Zukunftsaspekt ist essentiell, denn dort hast du als individual Contributor ja auch die Chance zu Hey, ich möchte mich in den Bereich BI weiterentwickeln, ich möchte mich im Bereich Design weiterentwickeln."
        },
        {
            "start": 923970,
            "end": 933590,
            "speaker": "A",
            "text": "Wie schaffst du es jetzt zwei Bereiche zu nennen, wo ich die überhaupt nicht sehe? Design und BI. Wie schaffst du das so einfach so rauszuschütteln?"
        },
        {
            "start": 933910,
            "end": 935150,
            "speaker": "B",
            "text": "Ja, weil es nicht immer um mich geht."
        },
        {
            "start": 935150,
            "end": 936630,
            "speaker": "A",
            "text": "Wolfgang Ich verstehe."
        },
        {
            "start": 937190,
            "end": 974520,
            "speaker": "B",
            "text": "Im Endeffekt kann man aber solche Wünsche natürlich auch im Performance Review ansprechen und dann kann man zusammen mit deiner Vorgesetzten und deinem Vorgesetzten darüber sprechen, okay, wie ist denn die Zukunft für dich in diesem Unternehmen? Es sei denn, es kann ja auch sein, dass du eine Staff Engineer Rolle anstrebst und dann dein Vorgesetzter sagt verstehe ich und ich sehe dich da auch in Zukunft, aber ich habe keinen Platz für einen Staff Engineer in meinem Team. Vielleicht kann man aber dann daran arbeiten, dass man vielleicht das Team wechselt oder ähnliches, denn das ist ja dann kein wirklicher Verlust für deine Vorgesetzte, sondern weil du deine Vorgesetzte möchte ja auch, dass du in der Firma bleibst. Also solche Sachen kann man natürlich da auch ansprechen."
        },
        {
            "start": 974520,
            "end": 1047880,
            "speaker": "A",
            "text": "Jetzt habe ich zu Beginn schon gesagt, meine persönlichen Erfahrungen waren natürlich ganz oft auch angstorientiert, Intransparenz, Politik Biases, die da herumgeflogen sind und also diese ganzen negativen Aspekte. Und grundsätzlich, was du auch schon richtig angesprochen hast, sollte es eigentlich schon der Fall sein, dass man von so einem Performance Review nicht überrascht wird. Also es sollte ja alles eigentlich kommuniziert werden unter dem Jahr und man sollte dann eigentlich nur eine Zusammenfassung bekommen und keine große Überraschung, was in der Realität oft nicht passiert. Jetzt hast du auch schon erwähnt, das Feedback sollte ja über dem Jahr stattfinden in One on One. Wir hatten da ja auch schon ziemlich viele Episoden darüber gemacht. Eine der ersten Episoden, unsere Episode zehn, ging es wirklich um One on One, aber auch die Episode ein und sechzig, schwierige One on One, wo es um schwierige Themen ging und auch Episode fünf und siebzig wo es um Evaluierung von der Job Performance ging, da haben wir über diese Sachen gesprochen, die unter dem Jahr stattfinden sollten. Also das mal vorausgesetzt. Aber wenn man jetzt auf das Performance Review bzw. Meeting an sich eingeht, was hast denn du für Varianten bisher erlebt in deinen Firmen? Also so wie ich dich verstanden habe, hast du bisher immer Performance Reviews erlebt oder hat es auch eine Firma gegeben, wo es gar keine Performance Reviews gab?"
        },
        {
            "start": 1047880,
            "end": 1059200,
            "speaker": "B",
            "text": "Umso kleiner die Firma, desto unstrukturierter war der Prozess und da war das eher ein Jahresgespräch, wo man sich mit einem Kaffee zusammengesetzt hat und wo kaum einer eine Vorbereitung hatte. Ich glaube, das würde ich dann nicht als Performance Review bezeichnen."
        },
        {
            "start": 1059200,
            "end": 1063560,
            "speaker": "A",
            "text": "Naja, aber es hat zumindest einen Termin im Kalender gegeben, falls es einen Kalender gegeben hat."
        },
        {
            "start": 1064120,
            "end": 1081270,
            "speaker": "B",
            "text": "Einen Kalender hat es gegeben, aber ja, es war dann eher fraglich dieses, also der Sinn dieses Gesprächs war dann eher fraglich, weil dann halt, wie gesagt, keine Dokumentation stattgefunden hat. Und im Endeffekt ist auch immer die Testfrage, Wolfgang, was hast du letzte Woche Freitag gegessen?"
        },
        {
            "start": 1081350,
            "end": 1084470,
            "speaker": "A",
            "text": "Ja, ich kann sie dir nie beantworten. Das solltest du langsam wissen."
        },
        {
            "start": 1084470,
            "end": 1117490,
            "speaker": "B",
            "text": "Ja, okay. Und das beweist ja eigentlich schon. Wie sollst du dich an das Performance Gespräch von vor einem Jahr erinnern oder an die ganzen Projekte oder ähnliches. Also wenn man sich da nicht vorbereitet, wenn man keine Dokumentation hat. Deswegen sage ich die Sinnhaftigkeit dieser Wir treffen uns auf einen Kaffee und sprechen mal über dein Jahr ist so ein bisschen so lala nicht gegeben. Desto größer die Firma wurde, umso mehr Struktur gab es da. Und da gab es ein paar Unterschiede in den verschiedenen Firmen. Ich war in einer Firma, da habe ich als Manager komplett alleine entschieden und da war nur meine Meinung maßgeblich."
        },
        {
            "start": 1117490,
            "end": 1119090,
            "speaker": "A",
            "text": "Wie hast du dir die Meinung gebildet?"
        },
        {
            "start": 1119090,
            "end": 1214550,
            "speaker": "B",
            "text": "Ich habe mir angesehen, was die Person über das Jahr so geleistet hat, welche Projekte diese geleistet hat oder geleitet hat. Ich habe mir unsere One on One Dokumentation noch mal durchgelesen, welches Feedback ich über das Jahr gegeben habe, ob es, ob wir über Entwicklungsmöglichkeiten gesprochen haben, habe diese reflektiert und habe mir versucht, einen objektiven Entscheidungskatalog zusammenzustellen, was natürlich nicht möglich ist, wenn ich als Manager alleine irgendwie entscheide, weil ich bin Mensch und ein bisschen Bias spielt halt mit, auch wenn man bias aware ist, wie zum Beispiel, keine Ahnung, ich fahr Snowboard und wenn jemand Snowboard fährt, dann ist der klassische Bias halt, dass ich die Person mag, auch wenn man sich dessen bewusst ist. Als Mensch schwingt halt immer ein Bias mit, aber dass man dann halt mal sein Feedback runterschreibt, dass ein Tag liegen lässt und nächsten Tag vielleicht mal mit neuen Augen drauf schaut und sagt, okay, welche Subjektivität ist innen drin, welche Subjektivität kann man denn rausnehmen? So, ich habe mir halt ein paar Datenpunkte geholt. Ich habe jetzt nicht rumgefragt, hey, wie findest du denn die Person oder ähnliches, weil das würde schon wieder in so eine Peer Review Ecke gehen. Gab es aber auch bei manchen Firmen. Bei manchen Firmen gab es vor dem Performance Review Gespräch so eine Art Survey, dass du, wenn wir beide jetzt ein Performance Review Gespräch führen würden, dann hast du mir drei Personen genannt, mit der du das letzte Jahr zusammengearbeitet hast, die dann gewisse Fragen beantworten, wie zum Beispiel, was war der größte Impact, den der Wolfgang im letzten Jahr geleistet hat? Wie würdest du Wolfgangs Verhalten anhand der Company Values beschreiben und welche Entwicklungsmöglichkeiten siehst du bei Wolfgang Und dann ein generelles Kommentar so nach dem hey, es ist super mit dir zu arbeiten oder ähnliches."
        },
        {
            "start": 1214550,
            "end": 1220650,
            "speaker": "A",
            "text": "Wie lange hat sowas gedauert, wenn du das jetzt für jemand anderen ausgefüllt hast? Also rein jetzt vom Umfang her, ja."
        },
        {
            "start": 1220650,
            "end": 1305590,
            "speaker": "B",
            "text": "Bei diesen vier Fragen dauert das gar nicht so lange, sofern man sich vorher Gedanken macht. Ich meine, der ganze Prozess ist natürlich, ich bekomme diese Anfrage für dieses Formular. Ich springe ja nicht sofort in die E Mail, öffne das Formular und trage das ein und bin nach zehn Minuten fertig, sondern ich lasse das erstmal wirken, denke darüber nach, schau mir vielleicht an, okay, was war im Quartal eins, zwei, drei mit der Person, auch wenn ich mit dieser Person zusammengearbeitet habe, scroll mal durch den Chatverlauf und so weiter. Also wenn man da schon wirklich gutes Feedback geben möchte und gutes Feedback meine ich jetzt nicht, diese Person kommuniziert gut, sondern diese Person kommuniziert gut, weil wir zusammen in regelmäßigen Meetings, wie zum Beispiel dem Architektur Meeting waren und dort hat er immer die richtigen Fragen gestellt, besonders als es damals um die Architektur unserer Plattform ging und so weiter. Also dass du explizite Beispiele gibst, warum etwas gut war, was es mit dir gemacht hat und welchen Impact es auf dieses Meeting zum Beispiel hatte. Also dieses richtig gute fundamentale Feedback zu geben, das dauert halt. Und auch bei diesen vier Fragen würde ich sagen, ohne die Denkarbeit zuvor, dreiig bis sechzig Minuten, vielleicht mit AI, um die richtige Formulierung zu finden, jetzt ein bisschen schneller, weil man die Stichpunkte hat, aber die Datenpunkte zu sammeln und dann wirklich fundamentales Feedback zu geben, womit die Person auch was anfangen kann. Weil ich lese super oft irgendwie so Wischiwaschi Feedback und dann muss ich zugeben, lass es direkt sein, diese Person kommuniziert gut, lass diesen Satz einfach weg, der bringt nichts."
        },
        {
            "start": 1305670,
            "end": 1354570,
            "speaker": "A",
            "text": "Die Schwierigkeit, die ich ja immer mit diesem System habe oder hatte jetzt rein als Reviewer, wenn du nicht auf der Manager Seite bist, weil als Manager hast du die ganze ein hundert eins Dokumente und im Idealfall hast du da drin ja dann Beispiele stehen und hast diese Feedback hier unter dem Jahr schon gegeben. Aber jetzt als Normalstehender, wenn ich keine Notes unter dem Jahr mache, mich zurück zu erinnern, vor sechs Monaten, da war ja dieses Projekt und das hat gut funktioniert. Klar, das weiß man vielleicht noch, aber dann irgendwie ein konkretes Beispiel und dann auch noch so zu formulieren, dass die andere Person da was davon hat, Vor sechs Monaten hatten wir ja dieses Projekt und in diesem Init Meeting kannst du dich noch erinnern, da hast du ja gut formuliert, die Problemstellung oder keine Ahnung, es macht niemand und es schafft niemand und es ist ein großes Problem. Also ohne Notes ist es fast unmöglich, meiner Meinung nach, irgendwie ein Jahr zusammenzufassen."
        },
        {
            "start": 1354730,
            "end": 1401310,
            "speaker": "B",
            "text": "Manche Firmen haben so eine Art Company Thank You System, wo man sagen kann, Wolfgang, du hast jetzt im Juni ein Projekt abgeschlossen und das hat so einen positiven Impact auf meine Arbeit. Dann kann ich in das System gehen und kann sagen, hey Wolfgang, super gute Arbeit am Projekt XY, besonders dein Drive, wie du es implementiert hast, hat mich beeindruckt, riesen Dankeschön. Und dann wird dieses Dankeschön dann entweder in deiner Personalakte oder in deinem Workday oder sowas vermerkt oder was auch viele Firmen machen, dann beim All Hands am Ende noch mal vorgelesen, so hey, diese Person hat dieses Danke bekommen, aber anonym. Und das ist ein gutes System, wie du dich an solche positiven Feedback Sachen zumindest erinnern kannst. Du kannst sagen, okay, welche Danksagung habe ich über das Jahr ausgesprochen."
        },
        {
            "start": 1401390,
            "end": 1459920,
            "speaker": "A",
            "text": "Google hat so ein ähnliches System, die haben so ein Self Assessment System, das man jederzeit triggern kann. Das heißt, wenn man ein Projekt abgeschlossen hat, dann kann ich jetzt bei anderen Feedback einholen und fragen, dass die mich beurteilen für dieses spezielle Projekt und das bleibt dann eben auch dementsprechend gespeichert und kann ich dann später verwenden und dann kann ich diese Zeitfenster sozusagen kleiner machen. Und üblicherweise ist dann auch einfacher natürlich irgendwelche konkreten Beispiele dort reinzuschreiben und Feedback zu geben. Das erhält man dann auch sofort, Was natürlich der Vorteil ist, dass man das dann eben sich auch noch erinnern kann an die Meetings zum Beispiel, wo man irgendwas schlecht oder gut gemacht hat und kann natürlich dementsprechend auch reagieren und man hat es noch dokumentiert für die Jahresgespräche. Keine Ahnung, ob das Google noch immer hat, sie haben es mal eingeführt, aber es klingt für mich auf jeden Fall sehr sinnvoll und es wird getriggert von der Person, die Feedback einholen will, was meiner Meinung nach auch noch wichtig ist, weil man die Initiative zeigt, okay, ich will Feedback bekommen und bekommt es nicht irgendwie aufgedrückt."
        },
        {
            "start": 1460000,
            "end": 1514270,
            "speaker": "B",
            "text": "Ein Trick ist auch, den ich ab und zu mal mache, ist, wenn du jetzt was sehr Gutes gemacht hast oder wo ich denke, da hast du Entwicklungspotenzial, dass ich deinem Manager eine E Mail schreibe und sage, hey, ich wollte nur mal positives Feedback und mein Wolfgang geben buff, buff, buff und das zeitnah nach der Aktion, was dein Manager dann damit macht. Ich hoffe weiterleiten irgendwann. Aber das hat natürlich dann einen eine gesendete E Mail in meinem Postfach, wo ich dann am Ende des Jahres einfach reingucken kann, welchem Manager habe ich denn eine E Mail geschrieben, Weil im Endeffekt ist es genau das, wer schreibt, der bleibt und keiner kann sich daran erinnern. Deswegen gebe ich, versuche ich immer Feedback zeitnah zu geben und wenn ich nicht den Mut habe, diese Person das Feedback selbst zu geben, dann mache ich es über den Manager. Ich als Manager freue mich immer, wenn ich solche E Mails bekommen habe, bekomme ich jetzt auch noch hier. Und da ist natürlich auch so eine super Art, wie man Feedback weiterleiten kann und natürlich dann den Record zu haben am Ende des Jahres, falls du nach Peer Feedback gefragt wirst, diese E Mails wieder rauszuholen."
        },
        {
            "start": 1514270,
            "end": 1561280,
            "speaker": "A",
            "text": "Und das sind jetzt alle schon Beispiele, wie man den ganzen Prozess optimieren kann, unabhängig wie dieser Prozess natürlich definiert ist. Und gute Firmen haben genau dafür auch Trainings und da könnt ihr auch mal überlegen, habt ihr schon jemals so ein Training bekommen oder gibt es irgendwie Guidelines oder Hilfestellungen, wie man denn überhaupt gutes Feedback gibt, welche Tools dafür zur Verfügung stehen, Wird man animiert, wirklich Feedback einzuholen? Also das sind dann so kulturelle Dinge, die man auch wirklich schulen muss bzw. Die man in die Breite tragen muss, weil sonst funktionieren diese Systeme natürlich auch nicht und die brauchen einfach eine gute Kultur und eine offene Kultur, Sonst kann man diese ganzen Systeme natürlich sowieso vergessen. Aber ein System, was wahrscheinlich, glaube ich zu wissen, nachdem wir es beide erlebt haben, das komplexeste war in Bezug auf Feedback Systeme, war bei Trivago, würde ich."
        },
        {
            "start": 1561280,
            "end": 1567160,
            "speaker": "B",
            "text": "Mal sagen, oder wahrscheinlich nicht das komplexeste, aber das System, wo am meisten Zeit investiert wurde."
        },
        {
            "start": 1567160,
            "end": 1573080,
            "speaker": "A",
            "text": "Kannst du es mal für alle erklären? Ich glaube, wir haben es sicher schon ein, zweimal erwähnt, aber kannst du mal grob erklären, wie das funktioniert hat?"
        },
        {
            "start": 1573080,
            "end": 1595220,
            "speaker": "B",
            "text": "Ja, ähnlich wie das Peer Feedback, was ich gerade genannt hatte, gab es ein drei hundert sechzig Degree, also drei hundert sechzig Grad Feedback und das ist genau das, was es ist. Ich habe zehn bis, ich glaube, sogar fünfzehn Leute ausgewählt, mit denen ich das letzte Jahr eine Verbindung hatte, sei es projektmässig oder in irgendwelchen Gruppen oder Meetings."
        },
        {
            "start": 1595540,
            "end": 1604900,
            "speaker": "A",
            "text": "Also fünfzehn war nicht die Minimalgröße, es war frei, aber es hat durchaus Leute gegeben, die fünfzehn Reviewer angefordert haben."
        },
        {
            "start": 1605060,
            "end": 1632400,
            "speaker": "B",
            "text": "Genau, in den ersten Jahren gab es da kein Limit. Und da gab es dann alles von Leuten, die, ich glaube, vier Leute ausgewählt haben zu vier und zwanzig oder dreiig teilweise. Und die Personen, die ausgewählt wurden, waren jetzt nicht nur dein Team, sondern waren auch deine Manager und andere Manager. Also es war wirklich drei hundert sechzig Grad über dir, neben dir und unter dir. Und dieser Fragebogen, der dann rausgesendet wurde, der hatte zehn Fragen oder ähnliches. Ich glaube, da war eine Frage zu jeder Company Value mindestens."
        },
        {
            "start": 1632400,
            "end": 1647600,
            "speaker": "A",
            "text": "Ja, ja, es war irgendwas in der Größenordnung und jeweils eine Bewertung auf einer Skala, also von null bis fünf oder meets expectations und does not meet expectations oder so ähnlich. Und dann noch jeweils einen großen freite pro Subfrage."
        },
        {
            "start": 1647600,
            "end": 1654360,
            "speaker": "B",
            "text": "Genau, und pro Company Value und die Firma hatte sieben oder acht Company Values, glaube ich. Also im Endeffekt war es jetzt, du."
        },
        {
            "start": 1654360,
            "end": 1657040,
            "speaker": "A",
            "text": "Wissen, du hast länger dort gearbeitet, bei dir ist weniger lang."
        },
        {
            "start": 1657440,
            "end": 1681540,
            "speaker": "B",
            "text": "Ja, ich kann da jetzt irgendwie rum. Du, im Endeffekt war es ein sehr langes Formular, auch pro Person. Und dann hast du natürlich, weiß ich nicht, wenn du zehn, fünfzehn, zwanzig dieser Feedback Anfragen gekriegt hast, es gab Leute, die haben da fast zwei komplette Arbeitswochen mit verbracht, Feedback reinzugeben. Und wie ich gerade schon erwähnt habe, konstruktives Feedback braucht halt Zeit, braucht halt Beispiele."
        },
        {
            "start": 1681780,
            "end": 1687220,
            "speaker": "A",
            "text": "Also ich glaube, mein Maximum waren achtzig Anfragen, die ich bekommen habe für achtzig Reviews."
        },
        {
            "start": 1687300,
            "end": 1737750,
            "speaker": "B",
            "text": "Genau. Und da war jetzt auch nicht die Pflicht. Ich hatte auch relativ viele Anfragen jetzt, achtzig waren es, glaube ich, nicht, Aber da war jetzt auch nicht die Pflicht, dass du jeden ausfüllst, sondern dass du dann einfach irgendwann sagst, hey, pass mal auf, wir haben, weiß ich nicht, an drei Tagen über das letzte Jahr zusammengearbeitet. Sei mir nicht böse, aber ich fülle deine Frage nicht aus, weil ich kann relativ wenig konstruktives Feedback geben. Und da hat man halt ganz stark priorisiert. Und das war es am Anfang. Über die Jahre wurde das System aber auch optimiert und ich glaube, da wurde auch ein Cap dran gesetzt, wie viele Leute man anfragen darf und so weiter und so fort. Also man hat schon gemerkt, oh die Mitarbeiter, man legt halt damit irgendwie die Firma auch so ein bisschen lahm, aber der Manager hat dann später das komplette Feedback lesen müssen, zusammenfassen müssen und dann in einer Zusammenfassung auch irgendwie übermitteln müssen. Und das war natürlich auch ein Riesenberg."
        },
        {
            "start": 1737750,
            "end": 1766870,
            "speaker": "A",
            "text": "Arbeit und zwar schriftlich. Also zusammenfassen, anonymisieren, Personen zum Beispiel rausstreichen, damit man nicht zurück tracken kann, wer hat dieses Feedback gegeben. Viele haben sich da extreme Mühe gemacht und das wirklich in einem Fließtext zusammengefasst. Andere haben nur leicht anonymisiert. Da gab es natürlich auch alle Varianten. Aber eben, es hört ja nicht auf bei dem Review grundsätzlich niederschreiben bei den einzelnen Personen, sondern es wird dann zusammengefasst. Es ist ein Prozess dahinter, der auch noch mal ganz viel Zeit benötigt."
        },
        {
            "start": 1767030,
            "end": 1838330,
            "speaker": "B",
            "text": "Ziel der ganzen Thematik war natürlich den Bias von einer Person irgendwie rauszunehmen und damals hatten wir keine generative AI, wo du einfach nur die ganzen Texte reinschmeissen konntest, dann summarize please. Aber hat es gut funktioniert? Ich glaube, man hat ein sehr gutes Bild bekommen. War das Resultat stark abhängig von der Arbeit, die der Manager investiert hat? Ja, aber auch wie qualitativ hochwertiges Feedback du erhalten hast, denn er oder sie ist ein guter Kommunikator. Ja, hatte ich gerade schon gesprochen. Kann man zwar kommunizieren, aber was bringt einem das? Du weißt nicht, auf welcher Ebene von Kommunikation reden wir von geschriebener Kommunikation, verbaler Kommunikation, in Stresssituationen und so weiter. Deswegen, naja, wie sinnvoll ist dieses Feedback? Also es war abhängig, wie gut man dem Feedback geben ist und Feedback geben ist halt auch hart. Deswegen, ich gebe aber zu, der Ansatz, den fand ich sehr positiv und den habe ich in anderen Firmen dann auch vermisst. Da war ich so ein bisschen gespoilert, denn besonders, wo man nur einen Peer Feedback hat, also auf seiner Ebene, weil ich fand diesen von oben Feedback zu kriegen und von unten Feedback zu kriegen, fand ich schon sehr, sehr gut, muss ich zugeben. Und hast halt nicht jede Firma."
        },
        {
            "start": 1838330,
            "end": 1972840,
            "speaker": "A",
            "text": "Also ich bin auch ein großer Supporter von dem ganzen System. Wie gesagt, vielleicht ein paar weniger Review Leute hätte auch gereicht, weil man hat schon auch gemerkt als Manager, wenn man das zusammengefasst hat, das Bild war eigentlich relativ klar. Man braucht nicht zwanzig Stimmen, sondern sechs bis sieben Stimmen reichen komplett aus, um sich ein gutes Bild zu verschaffen. Es gibt natürlich so Leute, die mit sehr viel anderen Zusammenarbeiten, gerade so Starf Rollen oder sowas in der Richtung kann man natürlich dann schon rechtfertigen, aber der Aufwand, der dahinter steckt und du hast schon angesprochen, es war wirklich so, die Firma ist fast zwei Wochen so stillgestanden und die Manager, da hast du es bei jedem schon gesehen, die hatten das bis oben hin voll, wenn du nur das Wort drei hundert sechzig erwähnt hast, wenn du irgendwie achtzig Reviews schreiben sollst und zusammenfassen und so weiter. Aber nichtsdestotrotz finde ich es ein sehr gutes System, was dann schon irgendwann ein extremer Bruch war und da haben wir jetzt gar nicht so richtig drüber gesprochen bzw. Wir haben es jetzt als gleichwertig beachtet. Das eine ist ja Feedback geben, das heißt in die Richtung Wachstum, wo gibt es Probleme, was läuft gut, was kann man noch vertiefen und so weiter, gibt es ja die zweite Komponente, die da ganz klar dran hängt, das ist diese Beförderung Gehaltserhöhungs Komponente und in irgendeiner Form ist es natürlich verwandt bzw. Wird füreinander verwendet. Ganz konkret bei dem drei hundert sechzig in Trivago gab es mal einen Bruch, wo das sehr algorithmisch gehandhabt wurde, weil man musste ja quasi Noten vergeben und da kommt eine Nummer am Ende raus und wenn man diese Nummern direkt verknüpft mit Gehaltserhöhungen oder wenn man so macht wie Google früher oder Microsoft, dass man fünf bis zwanzig Prozent der Low Performer und Low Performer heißt einfach immer die untersten, egal wie gut die sind, wenn man die automatisch dann kündigt oder automatisch Konsequenzen setzt aus so einer Zahl, die da aus so einem Feedback Tool rauspurzelt, dann hat man natürlich einen extremen Vertrauensverlust von so einem Tool. Und bei Trivago hat man das schon auch gemerkt, dass da ein extremer Bruch drinnen war und die Leute dann nicht mehr so ehrliches Feedback gegeben haben, dass ein Vertrauensverlust da war und dass das schon zu Problemen geführt hat. Man hat es danach dann auch wieder bisschen zurückgefahren und geändert. Aber ich glaube, diese Schnittstelle zwischen Feedback und direkter Gehaltserhöhung, die ist ein großes Problem und die entscheidet, ob das ganze System funktioniert oder kippt."
        },
        {
            "start": 1973000,
            "end": 2030100,
            "speaker": "B",
            "text": "Da gibt es halt so eine Balance. Wenn du das komplette System transparent machst, wofür es dann auch genutzt wird, dann ist das natürlich sehr positiv, weil jeder weiß, was er zu erwarten hat, aber besonders wenn es dann an Geld geht und an irgendwelche Algorithmen, dann kann man das System natürlich relativ schnell gamen. Und eine negative Seite der ganzen drei hundert sechzig Feedback Thematik, und das ist jetzt nicht nur bei Trivago, sondern auch bei Peer Feedback genau, ist es, dass die Auswahl der Feedbackgeber essentiell ist. Wenn ich nur Leute wähle, mit denen ich gut kann, dann kriege ich natürlich nur tolles Feedback. Aber da ist es die Aufgabe deiner Vorgesetzten und deines Vorgesetzten, die Liste der Feedbackgeber vielleicht auch mal zu kontrollieren, vielleicht auch mal kritische Leute reinzunehmen, mit denen du zwar gearbeitet hast, die aber vielleicht auch dir dann Entwicklungs Feedback geben. Also die Auswahl der Feedbackgeber ist da essentiell und es ist halt sehr, sehr wichtig, dieses Feedback als ein Signal und nicht als das Signal zu verwenden, was."
        },
        {
            "start": 2030100,
            "end": 2094010,
            "speaker": "A",
            "text": "Natürlich bei einem Algorithmus schon nicht mehr der Fall ist, weil wenn der Algorithmus diese Benotung als Input nimmt, dann hast du einfach eine starre Verknüpfung. Und man sieht auch, dass da die Industrie eigentlich ziemlich zurückgerudert hat. Also wie gesagt, Microsoft hatte das bis zwei tausend dreizehn Google auch sowas in der Größenordnung, dass man wirklich die Low Performer, die untersten fünf bis zehn Prozent, dann wirklich mehr oder weniger gekündigt hatte, so die klassische Higher and Fire Mentalität. Und die sind da aber auch zurückgerudert und haben einen wichtigen Schritt gemacht, dass man das Feedback trennt von dem Gespräch über das Gehalt, dass man also wirklich ein Meeting hat, wo es darum geht, das Feedback zu verarbeiten, sich zu überlegen, was macht man daraus, wie geht man weiter, was sind die nächsten Schritte und dann wirklich zeitlich versetzt, keine Ahnung, Monat später macht man wirklich ein Meeting zum Gehalt, wo dann eben das Feedback einfließt, aber natürlich auch ganz viele andere Dinge mit einfließen und man es probiert möglichst zu entkoppeln und keinen klaren Link dazwischen hat, wie ein Algorithmus, der einfach sagt, wenn die Note drei ist, dann kannst du schon keine Gehaltserhöhung mehr bekommen."
        },
        {
            "start": 2094010,
            "end": 2153200,
            "speaker": "B",
            "text": "Naja, man spricht auch von dieser Glockenkurve, denn im Endeffekt, und das muss ich jetzt leider mal so sagen, ist es so, dass nicht jeder ein High Performer sein kann. Und es gibt eine statistische Normalverteilung, dass du, wenn du zehn Leute hast, dass du nicht zehn Top Performer hast, sondern dass du einen statistischen Anteil an Leuten hast, die performen sehr gut dann einen dicken Bauch von Leuten, die schwimmen im guten Mittelfeld und dann gibt es Leute, die performen halt nicht so gut oder bzw. Bringen eine andere Art von Performance. Und wir reden die ganze Zeit von Performance, obwohl natürlich auch die Definition von Performance sehr schwierig und sehr schwammig ist. Die muss dann jede Firma für sich selbst finden, ab wann man gut performt oder halt auch nicht. Und das hatte ich ja gerade gesagt, wir machen kreativen Beruf. Ich hoffe, man hat irgendwelche Zielsetzungen bzw. Klaren Aufgaben. Wolfgang, du bist jetzt verantwortlich für dieses Projekt. Und da kann man natürlich dann schon in irgendeiner Art und Weise eine Performance von ableiten bzw. Anhand der Erwartungen gleichsetzen."
        },
        {
            "start": 2153520,
            "end": 2231980,
            "speaker": "A",
            "text": "Wobei, wie gesagt, diese Glockenkurve, dieses starre System, dass man immer Low Performer haben muss, davon ist man eigentlich schon weggegangen. Zumindest ist Google davon weggegangen, Microsoft davon weggegangen. Microsoft hatte, glaube ich, überhaupt fünfzehn Prozent, wenn ich das richtig im Kopf habe. Und wenn du jetzt ein Team hast, das auch nur einigermaßen gut funktioniert und du musst immer fünfzehn Prozent der Leute rauskicken, mehr oder weniger, dann hast du natürlich schon ein ziemliches Problem Und das hilft natürlich auch nicht, irgendein Vertrauen aufzubauen. Und daher ist man davon auch weggegangen, dass man weniger so ein Zahlen Game hat, sondern halt wirklich qualitatives Feedback, auch Abstimmungsrunden hat unter den Peers. Das heißt, die Manager sprechen sich ab. Wie schaut denn bei dir ein High Performer aus? Wie schaut bei dir ein High Performer aus, Dass man so ein Leveling findet, okay, das ist bei dir ein High Performer in deinem Team und was ist bei mir ein High Performer? Das muss man dann natürlich auch dementsprechend beweisen, unter Anführungszeichen. Das heißt wirklich erklären. Bei einem Projekt X hat er so agiert, da war er wirklich auf einem hohen Staff Level, hat da die Architektur organisiert, hat die Leute mit einbezogen, dass man so Beispiele bringt, was ein High Performer dann wirklich macht, um so einen Abgleich über Teams hinweg dann auch zu bekommen und weniger die klassische Zahlenkeule, wo man einfach sagt, okay, mit der und der Note bekommt man keine Gehaltserhöhung oder wird sogar gefeuert."
        },
        {
            "start": 2232060,
            "end": 2251060,
            "speaker": "B",
            "text": "Die gezwungene Aktion auf Basis dieser Glockenkurve, das macht keinen Sinn. Aber stellst du somit die statistische, das statistische Modell in Frage, Wolfgang Also denkst Du du hast jetzt ein gut funktionierendes Team und gut funktionierendes Team hat halt auch Low Performer. Man hat ja ein diverses Team."
        },
        {
            "start": 2251060,
            "end": 2278460,
            "speaker": "A",
            "text": "Ja, die Frage ist immer, was ist was ist Low Performer? Ist Low Performer zu niedrig oder gut genug? Und klar hast du immer eine Glockenkurve und du wirst Leute haben, die High Performer sind oder vielleicht auch anders performen. Da sind wir wieder bei keinen Klub zum Beispiel. Oder wenn es darum geht, irgendwie Team Moral hochzuhalten. Es gibt ja auch so Leute, die auf anderer Ebene kontributen für das Team und das ist dann auch wesentlich schwieriger natürlich festzumachen, muss man auch klar sagen."
        },
        {
            "start": 2278540,
            "end": 2305620,
            "speaker": "B",
            "text": "Ja, aber sollte dann nicht die Performance Erwartung mit den Do's and Don'ts, Du hast ja gerade irgendwie gesagt, OK, verwende Beispiele, was Performance ist und verwende auch nicht Beispiele, was dann halt nicht als Performance angesehen wird. Sollte dann die Definition dann nicht angepasst werden, Denn ich stimme dir zu, es gibt verschiedene Archetypen von verschiedenen Senior und Self Engineers, die eine gewisse Art von Arbeit leisten, die notwendig ist, die vielleicht nicht direkten Einfluss auf die Top Level kpis hat."
        },
        {
            "start": 2305620,
            "end": 2348510,
            "speaker": "A",
            "text": "Naja, im Endeffekt haben sie schon Einfluss auf die Top Level kpis natürlich über einen anderen Weg. Das Problem ist, wenn das sehr strukturiert ist und der Fragebogen natürlich nur auf eine Größe hinarbeitet, irgendeine Value Contribution, dann ist es natürlich schwierig über irgendwie ein numerisches System abzubilden. Natürlich in den Abgleich Meetings über Peers und über andere Teams kann ich das sehr wohl mit reinnehmen und das ist dann schon eine Firmenentscheidung gemeinsam mit anderen Manager innen zum Beispiel entscheiden ist uns Glubork das wirklich wert oder wollen wir das nicht fördern, wie das auch immer ist. Also das ist dann die Aufgabe dieser Manager innen, das zu entscheiden. Aber dass es Company weit möglichst fair natürlich abgeht."
        },
        {
            "start": 2348510,
            "end": 2538570,
            "speaker": "B",
            "text": "Ich hatte mal einen Fall in einer Firma, da habe ich ein Team geleitet und da habe ich eine Beförderung begleitet vom Seniors zum Staff Engineer und das Profil eines Staff Engineers in der Firma sah so aus, dass du eigentlich ein sehr starker Generalist sein solltest. Du solltest dich in sehr vielen Bereichen sehr gut auskennen. Jetzt war die Person, die ich bei der Beförderung begleitet habe, aber ein wirklich ein Experte für Streamingdienste für Kafka und diese Person hatte einen so starken Impact auf die komplette Streaming Architektur, was dann auch wirklich in neuen Revenue Zahlen sichtbar war und Co. Und man auch mit Daten über Incidents und allem Pipapo beweisen konnte, wo durch das tiefen Wissen, wo kein Staff oder Principal rankam, weil die halt Generalisten waren, weil die halt sich über viele Systeme auskannten und die Person so dermaßen tief in dieser Technologie drin war und deswegen neue Algorithmen dafür geschrieben hat und so weiter und so fort, dass es ein paar Wochen Überzeugungsarbeit von mir für das Top Management gebraucht hat, dass diese Staff Promotion durchging, denn das war wirklich anstrengend. Ich habe echt viele Dokumente geschrieben und auch mit Graphen versehen und habe wirklich tief in den Daten gewühlt, kann man schon sagen. Und ich musste ein Verständnis schaffen, dass diese Art von Arbeit, und davon rede ich jetzt von Archetypen von diesen Leuten, die notwendige Arbeit tun, damit das ganze Konstrukt zusammenhält, aber halt nicht in die klassische Schublade nach der Firmendefinition passt. Und da muss man dann schon auch sehr, sehr eng mit seiner Vorgesetzten und seinem Vorgesetzten arbeiten und auch diese Daten rausholen, damit sowas auch, ich sage mal, eine Erfolgschance hat. Also was ich damit sagen möchte ist, falls ihr eine solche Situation habt, falls ihr jemanden habt, der einen unglaublichen Wert fürs Team leistet, zum Beispiel diese eine Person hält immer den Bild grün und enable fünf andere Teams, dass sie kontinuierlich schippen können und Produkte entwickeln können und nicht an Ops Arbeit irgendwie kleben bleiben, macht das in irgendeiner Art und Weise sichtbar, dokumentiert das, was das für einen Impact hat. Von mir aus auch, mag jetzt zwar eine schlechte Meinung sein für viele, lasst doch mal das ganze Team für zwei Wochen die Zeit tracken, wie viele Stunden verbringen die auf Software Engineering, wie viele Stunden verbringen die die Deployment Pipeline zu reparieren oder oder oder und sagt denen ganz transparent, wozu ihr das macht. Hey, wir würden gerne verstehen, wo ihr eure Zeit verschwendet, Nicht, weil wir Micromanage betreiben wollen, sondern weil wir den Prozess optimieren wollen oder weil wir vielleicht den Wert von Glue Work, so wie Wolfgang es gerade beschrieben hat, also die Arbeit, die andere Arbeit zusammenhält, sichtbar machen wollen oder oder. Und dann hat man eine Datenbasis, auf der man argumentieren kann. Kurzum, wenn ihr die Datenbasis nicht habt, erstellt sie oder lasst sie erstellen und untermalt euren Punkt. Und dann kriegt man vielleicht auch Leute, die in der Glockenkurve als Low Performer kalibriert werden, weil sie halt nicht die Arbeit machen, die laut der Firma als wertvolle Arbeit gemacht werden, vielleicht auch sichtbar und dann gedreht."
        },
        {
            "start": 2538650,
            "end": 2614480,
            "speaker": "A",
            "text": "Und das ist, glaube ich, ein sehr wichtiger Punkt, weil auf der Product Seite hat man ja üblicherweise Metriken, da hat man okrs. By the way hatten wir eine sehr coole Episode ein hundert zehn zu okrs. Da gibt es Product Owner, die den Progress tracken. Das heißt, man hat da sehr viele kpis. Auf der Hardcore technischen Seite hat man auch oft kpis, sprich wie stabil ist meine Plattform, Resilience Metriken und so weiter. Also da gibt es Metriken, aber dann gibt es ganz viele Bereiche, die eben nicht klar getrackt werden oder auch in keinem Anforderungsprofil stehen oder in der Zielvereinbarung genau die du jetzt genannt hast. Und da ist schon die Aufgabe von dem Manager, genau diese auch schriftlich zu dokumentieren und vielleicht auch sogar in irgendwelche Zielvereinbarungen reinzubekommen, weil dann ist es auch klar definiert. Und wenn man das erst macht, wenn man so ein Kalibrierungsmeeting hat mit Peers, dann ist es zu spät. Also auch da wieder ganze Jahr über das Besprechen. In manchen Firmen habe ich auch erlebt, wird GLUB einfach nicht geschätzt zum Beispiel. Und dann heißt es ganz klar, jemand, der nur GLUB macht, ist für uns wertlos. Und dann muss man natürlich dementsprechend auch reagieren, weil dann kann man es vielleicht nicht rein verhandeln. Da muss man auf einer anderen Ebene agieren oder das schon frühzeitig unter dem Jahr halt mit der Person klären und vielleicht auch unter Umständen auf die Glue Work verzichten, wenn es nicht anders in der Firma möglich ist."
        },
        {
            "start": 2614480,
            "end": 2661760,
            "speaker": "B",
            "text": "Aber ich meine, das ist auch eine Arbeit von Expectation Management. Man muss auch ganz brutal Wenn die Person Glue Work liebt, dann ist es vielleicht auch die falsche Firma, weil im Endeffekt auch die Firma verändert sich, Personen verändern sich, sie entdecken, dass diese Art von Arbeit super viel Spaß macht und das ist völlig okay. Man muss nicht immer alles erzwingen, dass diese Arbeit, wenn sie in der Firma nicht wertgeschätzt wird, dass man die dann in der Firma macht. Dann sollte man den Arbeitgeber wechseln. Jetzt haben wir die ganze Zeit über die Arbeit der Vorgesetzten oder des Vorgesetzten gesprochen oder was deine Leute drumherum so machen, dir Peer Feedback geben und so weiter und so fort. Aber Wolfgang, welche Aufgabe hast du denn als, ich nenne es mal individuell Contributor? Was kannst du tun als Performance Review Empfänger? Oder sitzt du da nur und lässt alles auf dich einprasseln?"
        },
        {
            "start": 2661760,
            "end": 2743330,
            "speaker": "A",
            "text": "Ich muss ja zugeben, dass ich das auch viel zu wenig genutzt habe, weil was es ja ganz oft gibt, auch in diesen Feedback Tools, ist so ein Self Assessment, wo man sich selbst bewertet. Und natürlich kann man sich jetzt darauf verlassen, dass die Managerin so schlau ist und mitdenkt und alles aufzeichnet und vielleicht in ein hundert eins Dokumenten da alles mitschreibt. Aber ich würde mal sagen, selbst ist die Frau oder der Mann und alles, was man selber macht, kann man steuern. Und wir hatten ja auch mal eine Episode zu breakdocuments gemacht, die ER Episode, wo es genau darum gegangen ist, aufschreiben, aufschreiben, aufschreiben, weil dann hat man etwas in der Hinterhand. Also nicht nur für sich selber, was hat man geleistet. Kann ja auch psychologisch sehr guten Effekt haben, dass man mal sieht, was man alles geleistet hat und weitergebracht hat, weil gerade wenn es viel ist, vergisst man das eine oder das andere. Aber wenn man das natürlich zur Verfügung hat für so ein Self Assessment, für eine Gehaltsverhandlung, für ein Feedback Gespräch, wo man sagen kann, ja, das ist ganz nett, dass du mir das Feedback gibst, kann es auch irgendwie nachvollziehen, aber es gab ja dieses Projekt und dieses Projekt und da hat es sehr wohl gut funktioniert. Hast du das noch am Schirm zum Beispiel? Also es kann ja auch sein, dass die Managerin ein falsches Bild hat oder vielleicht ein unvollständiges Bild und umso mehr man da natürlich in der Hand hat, umso besser. Das heißt, diese Selbstbeurteilung muss man unbedingt wahrnehmen bzw. Es ist ein Tool, was man in der Hand hat, um das Ganze zu steuern und in die Richtung zu lenken, die man gerne hätte."
        },
        {
            "start": 2743410,
            "end": 2824960,
            "speaker": "B",
            "text": "Und das klingt jetzt ach, mein Manager weiß nicht, was er tut. Doch, diese Person hat mit hoher Wahrscheinlichkeit zehn Direct Reports und fünf und dreiig andere Aufgaben. Es ist nur menschlich, dass man einfach nicht alles sieht und du willst ja auch nicht konstant beobachtet werden, weil dann gilt das nämlich als Micromanagement. Also du musst dieser Person, die die Performance Review schreibt, halt schon irgendwie auch ein bisschen helfen, weil es ist ja nur menschlich, dass man nicht alles auf dem Schirm hat. Eine Sache, über die ich ab und zu mal stolper, ist, dass viele ics sagen, ja, mein Manager ist für meine Weiterbildung verantwortlich und da kriege ich immer so einen ganzen roten Kopf, wie in diesen Disney Filmen, wenn da jemand so aufregt. Denn ich denke, das ist eine zu einfache Aussage, denn man kann sich zurücklehnen und sagen, so ich war ja so ein toller Hecht, jetzt erwarte ich mal hier Lobeshymnen und die Weiterentwicklung. Aber ich bin der Meinung, jeder ist für sich selbst verantwortlich und du musst deine Weiterbildung und auch deine Gehaltserhöhung und Co. In deine eigene Hand nehmen. Und du musst auch die Fakten, die zu einer Gehaltserhöhung führen könnten oder zu einer positiven Performance Review, musst du auch liefern. Das bedeutet, mach deine Arbeit sichtbar, dokumentiere das. Ich rede immer von Output versus Outcome. Output ist der Pull Request, den du machst und Outcome ist das deployed Produkt, was dann später dir fünf und dreiig mehr Kunden gebracht hat."
        },
        {
            "start": 2824960,
            "end": 2845900,
            "speaker": "A",
            "text": "Und die fünf und dreiig Kunden, das ist das Wichtige, weil da habe ich wieder eine Zahl, vor allem wenn ich mit Managern, Produktleuten spreche, die sind zahlengetrieben. Und wenn ich sagen kann, wir haben fünf und dreiig Kunden mehr und dieses Tool wurde dann vielleicht noch von fünf anderen Teams auch verwendet und dort hat es wieder mehr Kunden gegeben. Das sind dann wirkliche Erfolgsstories und diese sollte man unbedingt aufschreiben."
        },
        {
            "start": 2845980,
            "end": 2953830,
            "speaker": "B",
            "text": "Und ich kenne viele Leute, die sagen, boah, immer muss ich hier alles auf Business Metriken runterbrechen. Ja, ich verstehe diese Sichtweise, ich will doch nur, ich sitze doch nur hier und will doch nur Tech machen. Ich möchte nur noch mal ganz kurz in Erinnerung rufen, ihr sitzt da und macht nur Tech, weil jemand das Risiko eingegangen ist, eine Firma zu gründen, ein Produkt zu launchen, euch einen Arbeitsplatz zu geben. Das bedeutet, ihr seid da und helft den Traum von jemandem anders umzusetzen und ihr seid nicht da des Tech wegen, sondern ihr seid da, um Probleme zu lösen. Und eure Waffe, um Probleme zu lösen, ist halt oft Software. Wenn ihr also sagt, immer muss ich alles in Business Metriken übersetzen, dann muss ich euch leider sagen, das ist das ganze Spiel. Deswegen bist du Arbeitnehmer. Also es sei denn, du arbeitest für eine Non Profit Organisation, dann ist das was anderes. Aber die meisten von uns werden für eine profitorientierte Organisation arbeiten. Und da ist es halt in der Regel so, dass ohne Moos nichts los. Und das ist halt der Haupttreiber der ganzen Thematik. Deswegen werdet euch dessen bewusst, weswegen ihr einen Job habt und was ihr da eigentlich tut. Und bietet dann Fakten bzw. Outcomes. Output versus Outcome. Output ist die Aktion. Outcome ist das, was deine Aktion bewirkt und der Outcome ist das Wichtige und nicht der Output. Du kannst dein Output hochschreiben, du kannst fünf und dreiig Pull Requests haben, die zehn Millionen Zeilen ändern, aber du kannst null Outcome von diesen fünf und dreiig Pull Requests haben. Oder du kannst an dem richtigen Zeug arbeiten, zwei Pull Requests machen und einen enorm hohen Outcome haben. Wenn ihr in Outcome Impact denkt, dann dreht euer Bild sich etwas Perspektive und dann dreht sich auch die Art und Weise, wie ihr zum Beispiel euren Impact dokumentiert."
        },
        {
            "start": 2953830,
            "end": 3004300,
            "speaker": "A",
            "text": "Wenn man keine Zahlen hat, dann kann man ja trotzdem qualitatives Feedback oder Einschätzungen machen. Und da ist es natürlich nicht ideal, die eigene zu machen, weil ich kann immer sagen, ich bin gut und ich war toll, aber ihr könnt ja auch bei anderen Feedback einholen. Das kann natürlich, wenn es da einen Prozess gibt, also so ein strukturiertes Tool, wie ich erwähnt habe bei Google zum Beispiel, so ein Self Assessment Tool nach einem abgeschlossenen Projekt frage einfach drei, vier Leute, könnt ihr mir da was schreiben über dieses Self Assessment Tool? Oder auch wenn es keine Struktur gibt, es bringt einen niemand um, wenn man einfach mal kannst du mir ein paar Zeilen schreiben, wie das Projekt gelaufen ist, kannst du mir da Feedback geben, was ich besser machen kann, was ich ändern kann. Ob ich das dann verwende für irgendeine Gehaltsverhandlung oder einfach für mich selber, um zu wissen, wo ich stehe, was ich vielleicht verbessern kann, ist dann egal. Aber dieses Feedback ist super wichtig einzufordern und dann auch anzunehmen und zu verarbeiten."
        },
        {
            "start": 3004610,
            "end": 3110250,
            "speaker": "B",
            "text": "Und speziell dieses anzunehmen und zu verarbeiten, da sträuben sich ziemlich viele, denn immer wenn ich nach Feedback frage, dann ist es sehr einfach, positives Feedback zu geben, aber ich frage immer explizit nach Feedback, was ich verbessern kann. Was mir geholfen hat, ist zu verstehen, was Feedback ist bzw. Wann es für mich relevant ist, meiner Meinung nach. Feedback ist das, was andere durch Beobachten von dir sehen bzw. Feststellen. Das bedeutet auch im Umkehrschluss, das, was du kommunizierst und wie du handelst, das wird gesehen und das ist der Input für Feedback von anderen. Was du aus dem Feedback nimmst, was du bekommst und dann in der Zukunft änderst bzw. Ändern möchtest, das bestimmst du und du kannst dir ja deine Philosophie selbst hinlegen, wie zum Beispiel möchtest du an deinen Schwächen arbeiten oder möchtest du dich auf deine Stärken konzentrieren und die Schwächen einfach schwach sein lassen. Zwei mögliche Wege. Aber im Endeffekt, das, was du annimmst und ändern möchtest, das bestimmst du und niemand anders. Das heißt nicht, dass du jedes Feedback, was du bekommst, ändern musst. Und jetzt kommt das meines Erachtens nach wichtigste, was ich gelernt habe, was ich oft nicht eingestehen möchte, auch mir selbst nicht. Wenn der Wolfgang mir zum Beispiel Feedback gibt, wir haben ja hier im Podcast auch Performance Review Gespräche sozusagen, wir nennen das Milestone Review, da sagen wir, was gut lief und was schlecht lief. Und ab und zu, ich möchte sagen, geben wir uns dann auch Feedback, was ich gut fand, was ich nicht so gut fand. Dann kommt ab und zu auch mal Feedback von Wolfgang, was der Wolfgang nicht so gut fand. Und wenn das dann Gefühle bei mir auslöst, positive oder negative, wenn so ein kleines Brodeln ist, wenn ich das macht mich jetzt sauer, warum auch immer, oder sehe ich anders Genau, dann ist das das richtige Feedback, dann ist es für mich, möchte ich mich nicht eingestehen. Aber in der Regel ist es so. Wie wird das hier zur Feedback Folge? Performance Review Feedback Synonym?"
        },
        {
            "start": 3110250,
            "end": 3113570,
            "speaker": "A",
            "text": "War das jetzt ein Metakommentar oder ein Podcast Kommentar?"
        },
        {
            "start": 3113730,
            "end": 3117430,
            "speaker": "B",
            "text": "Keine Ahnung, wenn du jetzt darauf antwortest, war das ein Podcast Kommentar."
        },
        {
            "start": 3118140,
            "end": 3165580,
            "speaker": "A",
            "text": "Es hängt ja auch sehr stark zusammen, weil das Feedback bestimmt ja auch irgendwo dann eben die Entscheidungen, wenn es um Gehalt und Beförderungen, um die Zukunft, wie wir am Anfang gesagt haben, auch geht. Und ich würde fast sagen, die zwei Sachen ergänzen sich. Also ein Performance Review und kontinuierliches Feedback über das gesamte Jahr hinweg und ein Meeting pro Jahr ist kein kontinuierliches Feedback. Streite immer wieder mit Leuten, die behaupten, wir haben ja eh zwei Mitarbeitergespräche in dem Jahr, also da brauche ich keine One Once oder ähnliches. Das ist für mich kein kontinuierliches Feedback. Aber wenn man die zwei, ich nenne sie mal Tools, Performance Review und das kontinuierliche Feedback zusammennimmt, dann hat es schon für beide Seiten, für Manager, aber auch für den IC definitiv einen großen Hebel, mit dem man dann auch ganz viel bewegen kann."
        },
        {
            "start": 3165740,
            "end": 3238440,
            "speaker": "B",
            "text": "Wie ich am Anfang schon gesagt hatte. Ich glaube, jeder Performance Review Prozess ist in irgendeiner Art und Weise flawed bzw. Passt zumindest nicht auf jede Art von Arbeit und Co. Und man hat ja auch diverse Team und ja, deine Vorgesetzte und dein Vorgesetzter haben einen großen Einfluss auf die Performance Review. Aber teilweise gibt es auch Regeln von der Firma, für die deine Vorgesetzte zum Beispiel nichts kann, dann aber ausüben muss. Also manche Sachen hat man unter Kontrolle und manche nicht. Dennoch könnt ihr es bzw. Könnt ihr es zumindest zu einem gewissen Grad beeinflussen. Da müsst ihr aber Arbeit reinstecken und im Endeffekt ist es halt immer imperfekt. Ich kenne aber auch keinen perfekten Prozess. Ich glaube, den gibt es nicht und ich glaube, nach diesem sollte man auch nicht streben, denn diese Prozesse werden auch unterjährig teilweise angepasst und das erstellt dann neue Herausforderungen, um die Performance Review Prozesse über die Jahre zu vergleichen. Beispiel, wenn ihr irgendein Peer Review Survey habt und habt die Skala geändert, dann könnt ihr leider die Peer Review Ergebnisse aus den letzten Jahren nicht mehr mit diesen jährigen vergleichen. Da gibt es halt überall solche Flaws. Aber jetzt kann man sich fragen, verändert man den Prozess nicht und hält die Vergleichbarkeit oder entwickelt man sich weiter und tauscht ein paar Probleme durch andere Probleme? Denn das ist es eigentlich, was Weiterentwicklung oft ist."
        },
        {
            "start": 3238680,
            "end": 3292450,
            "speaker": "A",
            "text": "Man merkt ja auch bei den großen Firmen, dass sich die weiterentwickelt haben. Also wenn man Google zum Beispiel nimmt oder Microsoft, dass die eben sich auch geändert haben und die Prozesse ständig anpassen. Und je nachdem, wie dann die Reaktionen sind, sollte man das Ganze auch anpassen. Adobe zum Beispiel ist komplett weggegangen von dem ganzen Zahlen Game. Die machen überhaupt keine Noten mehr in dem Sinne und machen nur mehr qualitatives Feedback und am Ende entscheidet der Manager. Also es gibt auch bei den ganz großen durchaus starke Veränderungen und da merkt man schon, dass die Industrie sich so ein bisschen wendet, meiner Meinung nach. Der Mittelstand, kleinere Firmen, die gehen vielleicht mehr in den strukturierten Prozess rein, vielleicht sogar eine Benotung. Die großen gehen wieder weg von der Benotung, habe ich so das Gefühl. Also es ist schon, auch wenn man so auf die letzten zehn Jahre blickt, durchaus ein Wandel in der Industrie festzustellen. Und das ist ja nichts Schlechtes. Und am Ende muss es zur Kultur passen, die du in der Firma hast. Und die Kultur ist das, was die."
        },
        {
            "start": 3292450,
            "end": 3299250,
            "speaker": "B",
            "text": "Leute leben, die du in der Firma hast oder haben möchtest. Und das bestimmt das Level. Von daher sage ja Kultur ist das."
        },
        {
            "start": 3299250,
            "end": 3300970,
            "speaker": "A",
            "text": "Was gelebt wird und nicht was man will."
        },
        {
            "start": 3301210,
            "end": 3309210,
            "speaker": "B",
            "text": "Das war es jetzt aber auch zu einem Thema, das teilweise nicht so sexy sein kann. Ich weiß nicht, ob Performance Reviews sexy sein können, aber wir haben dabei haben."
        },
        {
            "start": 3309210,
            "end": 3343410,
            "speaker": "A",
            "text": "Wir jetzt die nicht sexy Sachen gar nicht besprochen. Der Klassiker des PIP, der Performance Improvement Plan zum Beispiel. Also wenn es dann wirklich um den letzten Schritt geht, die ganze Seite, wie man denn wirklich Performance beurteilt auf der Manager Seite. Also diese Seite haben wir jetzt mal bewusst weggelassen. Falls da Interesse herrscht, schickt uns mal eine Discord Message, da machen wir vielleicht eine eigene Episode dazu, unsere Erfahrungen, wie man Performance beurteilen kann und auch kalibrieren über Teams hinweg. Aber uns war vor allem jetzt auch mal wichtig zu zeigen, dass dieses Performance Review Meeting nicht nur negativ ist, sondern wirklich ein Hebel, den alle nutzen können."
        },
        {
            "start": 3343790,
            "end": 3366910,
            "speaker": "B",
            "text": "Das war das Wort zum Sonntag bzw. Zum Dienstag. Wir haben zwar gerade erst den Jahresbeginn und für viele kommt die Performance Review erst zum Jahresende, deswegen ist es wahrscheinlich die komplett falsche Zeit, diese Episode zu posten, aber völlig egal, denn das gibt euch die Möglichkeit, jetzt euren Output über das Jahr hin zu tracken und die nächste Performance Review Ende des Jahres besser zu machen."
        },
        {
            "start": 3366910,
            "end": 3386320,
            "speaker": "A",
            "text": "Und an alle kein Performance Review ohne kontinuierliches Feedback. Ein schweres Wort, kontinuierlich. Kein Performance Review ohne kontinuierliches Feedback unter dem Jahr. Also wenn wir schon bei den guten Jahresvorsätzen sind, vielleicht Feedback auch frühzeitig geben, wäre so ein guter Vorsatz, den man vielleicht in den aktuellen Zielen mit reinnehmen könnte."
        },
        {
            "start": 3386320,
            "end": 3388400,
            "speaker": "B",
            "text": "Das war's von uns, bis bald. Bye bye."
        },
        {
            "start": 3388400,
            "end": 3388920,
            "speaker": "A",
            "text": "Ciao."
        }
    ]
}