{
    "Abenteuer": {
        "short_desc": "Abenteuer-Spiele für Softwareentwickler:innen – Quests wie lange Debugging-Reisen.",
        "long_desc": "Abenteuer-Spiele für Softwareentwickler:innen sind wie epische Debugging-Sessions: voller Rätsel, versteckter Hinweise und unerwarteter Wendungen. Statt nur Codezeilen zu durchforsten, begibst du dich hier auf Quests, die logisches Denken und Kreativität verlangen. Tauche ein in Abenteuerwelten für Devs – und starte deine nächste digitale Reise noch heute!",
        "usage_count": 1
    },
    "Action": {
        "short_desc": "Action-Spiele für Softwareentwickler:innen – schnelle Reaktionen treffen auf Debugging-Reflexe.",
        "long_desc": "Action-Spiele für Softwareentwickler:innen verbinden Geschwindigkeit mit klugen Entscheidungen. Fehlerquellen tauchen wie Bugs auf, und du brauchst präzise Reaktionen, um sie zu beseitigen. Ob bei Boss-Fights oder Code-Battles – hier zählt Reaktionsfähigkeit. Spiele jetzt und trainiere deine Dev-Reflexe in virtuellen Actionszenarien!",
        "usage_count": 1
    },
    "Early Access": {
        "short_desc": "Early-Access-Spiele für Softwareentwickler:innen – Beta-Tests wie Software im Rollout.",
        "long_desc": "Early-Access-Spiele für Softwareentwickler:innen sind wie Beta-Versionen im echten Dev-Leben. Du erlebst unfertige Features, findest Bugs und gibst Feedback, das die Entwicklung mitgestaltet. Perfekt für alle, die das Iterieren lieben. Spiele jetzt Early-Access-Games und werde selbst Teil des Entwickler:innen-Workflows im Gaming!",
        "usage_count": 4
    },
    "Gelegenheitsspiele": {
        "short_desc": "Gelegenheitsspiele für Softwareentwickler:innen – kleine Coding-Pausen mit Fun-Faktor.",
        "long_desc": "Gelegenheitsspiele für Softwareentwickler:innen sind perfekt für kurze Breaks zwischen Meetings oder Builds. Kleine Rätsel, schnelle Runden oder simple Code-Twists trainieren den Kopf, ohne dich zu überlasten. Genau das Richtige, wenn du ein kurzes Dev-Timeout brauchst. Teste diese Games jetzt und bringe Abwechslung in deinen Arbeitsalltag!",
        "usage_count": 5
    },
    "Indie": {
        "short_desc": "Indie-Spiele für Softwareentwickler:innen – kreative Projekte wie Open-Source-Code im Gaming.",
        "long_desc": "Indie-Spiele für Softwareentwickler:innen sind wie kleine, geniale Side-Projects. Sie überraschen mit frischen Ideen, cleverem Design und unkonventionellen Mechaniken – ganz wie im Open-Source-Universum. Wenn du Lust auf Innovation statt Mainstream hast, entdecke jetzt diese kreativen Gaming-Experimente für Entwickler:innen!",
        "usage_count": 14
    },
    "Kostenlos spielbar": {
        "short_desc": "",
        "long_desc": "",
        "usage_count": 1
    },
    "Massively Multiplayer": {
        "short_desc": "MMO-Spiele für Softwareentwickler:innen – Kollaboration wie im Open-Source-Projekt.",
        "long_desc": "Massively Multiplayer Games für Softwareentwickler:innen sind wie Open-Source-Communities. Gemeinsam mit tausenden anderen Devs koordinierst du Projekte, kämpfst gegen Bugs und entwickelst Strategien im Team. Perfekt, wenn du Kollaboration und Scale liebst. Werde Teil einer MMO-Welt für Entwickler:innen und tauche jetzt in riesige digitale Universen ein!",
        "usage_count": 2
    },
    "Programmierung": {
        "short_desc": "Programmierung als Spiel – Code-Challenges für Softwareentwickler:innen, die Spaß machen.",
        "long_desc": "Hier wird Programmierung selbst zum Spiel. Diese Games für Softwareentwickler:innen fordern dich mit Coding-Puzzles, Refactoring-Challenges und Algorithmen, die wie Boss-Gegner warten. Ideal, wenn du spielerisch dein Können testen willst. Schnapp dir Tastatur und Gehirnschmalz – probiere diese Coding-Games jetzt aus!",
        "usage_count": 2
    },
    "Simulation": {
        "short_desc": "Simulations-Spiele für Softwareentwickler:innen – Systeme bauen wie produktive Pipelines.",
        "long_desc": "Simulationen für Softwareentwickler:innen fühlen sich an wie das Modellieren komplexer Systeme. Ob Infrastruktur, Prozesse oder ganze Ökosysteme – alles will logisch geplant und stabil gehalten werden. Hier kannst du deine Dev-Mindset-Skills spielerisch einsetzen. Starte jetzt eine Simulation und teste, ob deine virtuelle Architektur skaliert!",
        "usage_count": 15
    },
    "Strategie": {
        "short_desc": "Strategische Spiele für Softwareentwickler:innen – baue Systeme wie Architekturentscheidungen im Code.",
        "long_desc": "Strategie-Spiele für Softwareentwickler:innen fordern dich wie komplexe Architekturentscheidungen im Alltag. Plane Ressourcen, skaliere Systeme und meistere Abhängigkeiten wie in realen Projekten. Perfekt, wenn du deine Denkweise trainieren willst. Teste diese Spiele jetzt und finde heraus, ob dein Dev-Mindset auch in der virtuellen Welt Bestand hat!",
        "usage_count": 14
    }
}